<abi-corpus version='2.2' path='build/lib/liballegro_video.so' architecture='elf-amd-x86_64' soname='liballegro_video.so.5.2'>
  <elf-needed>
    <dependency name='liballegro_audio.so.5.2'/>
    <dependency name='libtheoradec.so.1'/>
    <dependency name='libogg.so.0'/>
    <dependency name='libvorbis.so.0'/>
    <dependency name='liballegro.so.5.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_al_compute_scaled_dimensions' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_video_identify_ogv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_video_ogv_vtable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_close_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_allegro_video_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_audio_rate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_event_source' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_fps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_frame' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_position' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_scaled_height' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_scaled_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_identify_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_identify_video_f' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_init_video_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_video_addon_initialized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_video_playing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_open_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_seek_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_set_video_playing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_shutdown_video_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_start_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_start_video_with_voice' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='addons/video/ogv.c' comp-dir-path='build/addons/video' language='LANG_C11'>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
    <class-decl name='ALLEGRO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-3'/>
    <function-decl name='_al_video_ogv_vtable' mangled-name='_al_video_ogv_vtable' filepath='addons/video/ogv.c' line='1362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_video_ogv_vtable'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_al_video_identify_ogv' mangled-name='_al_video_identify_ogv' filepath='addons/video/ogv.c' line='1367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_video_identify_ogv'>
      <parameter type-id='type-id-2' name='f' filepath='addons/video/ogv.c' line='1367' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <typedef-decl name='ALLEGRO_FILE' type-id='type-id-3' filepath='include/allegro5/file.h' line='15' column='1' id='type-id-1'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/video/video.c' comp-dir-path='build/addons/video' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='type-id-5'/>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <type-decl name='double' size-in-bits='64' id='type-id-7'/>
    <enum-decl name='ALLEGRO_VIDEO_POSITION_TYPE' filepath='addons/video/allegro5/allegro_video.h' line='42' column='1' id='type-id-8'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ALLEGRO_VIDEO_POSITION_ACTUAL' value='0'/>
      <enumerator name='ALLEGRO_VIDEO_POSITION_VIDEO_DECODE' value='1'/>
      <enumerator name='ALLEGRO_VIDEO_POSITION_AUDIO_DECODE' value='2'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='type-id-10'/>
    <type-decl name='int' size-in-bits='32' id='type-id-11'/>
    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='1024' id='type-id-12'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-13' id='type-id-14'/>
    </array-type-def>
    <class-decl name='ALLEGRO_EVENT_SOURCE' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='76' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pad' type-id='type-id-12' visibility='default' filepath='include/allegro5/events.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VIDEO' size-in-bits='2048' is-struct='yes' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='15' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-4' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_frame' type-id='type-id-17' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='video_position' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fps' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='scaled_width' type-id='type-id-10' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='scaled_height' type-id='type-id-10' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mixer' type-id='type-id-18' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='voice' type-id='type-id-19' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='audio' type-id='type-id-20' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='audio_position' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='audio_rate' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='es_inited' type-id='type-id-5' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='es' type-id='type-id-21' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='filename' type-id='type-id-22' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='playing' type-id='type-id-5' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='position' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dtor_item' type-id='type-id-23' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='data' type-id='type-id-24' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VIDEO_INTERFACE' size-in-bits='384' is-struct='yes' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='6' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='open_video' type-id='type-id-26' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='7' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='close_video' type-id='type-id-26' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_video' type-id='type-id-26' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_video_playing' type-id='type-id-26' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='seek_video' type-id='type-id-27' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='update_video' type-id='type-id-26' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_EVENT_SOURCE' type-id='type-id-15' filepath='include/allegro5/events.h' line='74' column='1' id='type-id-21'/>
    <typedef-decl name='ALLEGRO_VIDEO' type-id='type-id-16' filepath='addons/video/allegro5/allegro_video.h' line='53' column='1' id='type-id-28'/>
    <typedef-decl name='ALLEGRO_VIDEO_INTERFACE' type-id='type-id-25' filepath='addons/video/allegro5/internal/aintern_video.h' line='13' column='1' id='type-id-29'/>
    <typedef-decl name='ALLEGRO_VIDEO_POSITION_TYPE' type-id='type-id-8' filepath='addons/video/allegro5/allegro_video.h' line='51' column='1' id='type-id-30'/>
    <typedef-decl name='__uint32_t' type-id='type-id-31' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-32'/>
    <typedef-decl name='uint32_t' type-id='type-id-32' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-33'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-9'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-31'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-27'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-23'/>
    <class-decl name='ALLEGRO_AUDIO_STREAM' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-49'/>
    <class-decl name='ALLEGRO_BITMAP' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-50'/>
    <class-decl name='ALLEGRO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-51'/>
    <class-decl name='ALLEGRO_MIXER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-52'/>
    <class-decl name='ALLEGRO_PATH' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-53'/>
    <class-decl name='ALLEGRO_VOICE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-54'/>
    <class-decl name='_AL_LIST_ITEM' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-55'/>
    <typedef-decl name='ALLEGRO_AUDIO_STREAM' type-id='type-id-49' filepath='addons/video/../audio/allegro5/allegro_audio.h' line='166' column='1' id='type-id-41'/>
    <typedef-decl name='ALLEGRO_MIXER' type-id='type-id-52' filepath='addons/video/../audio/allegro5/allegro_audio.h' line='171' column='1' id='type-id-45'/>
    <typedef-decl name='ALLEGRO_VOICE' type-id='type-id-54' filepath='addons/video/../audio/allegro5/allegro_audio.h' line='176' column='1' id='type-id-47'/>
    <function-decl name='al_open_video' mangled-name='al_open_video' filepath='addons/video/video.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_open_video'>
      <parameter type-id='type-id-39' name='filename' filepath='addons/video/video.c' line='100' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='al_close_video' mangled-name='al_close_video' filepath='addons/video/video.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_close_video'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='141' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='al_get_video_event_source' mangled-name='al_get_video_event_source' filepath='addons/video/video.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_video_event_source'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='156' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_start_video' mangled-name='al_start_video' filepath='addons/video/video.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_start_video'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='164' column='1'/>
      <parameter type-id='type-id-18' name='mixer' filepath='addons/video/video.c' line='164' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='al_start_video_with_voice' mangled-name='al_start_video_with_voice' filepath='addons/video/video.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_start_video_with_voice'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='179' column='1'/>
      <parameter type-id='type-id-19' name='voice' filepath='addons/video/video.c' line='179' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='al_set_video_playing' mangled-name='al_set_video_playing' filepath='addons/video/video.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_video_playing'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='190' column='1'/>
      <parameter type-id='type-id-5' name='play' filepath='addons/video/video.c' line='190' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='al_is_video_playing' mangled-name='al_is_video_playing' filepath='addons/video/video.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_video_playing'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='202' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='al_get_video_frame' mangled-name='al_get_video_frame' filepath='addons/video/video.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_video_frame'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='211' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='al_get_video_position' mangled-name='al_get_video_position' filepath='addons/video/video.c' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_video_position'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='221' column='1'/>
      <parameter type-id='type-id-30' name='which' filepath='addons/video/video.c' line='221' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='al_seek_video' mangled-name='al_seek_video' filepath='addons/video/video.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_seek_video'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='234' column='1'/>
      <parameter type-id='type-id-7' name='pos_in_seconds' filepath='addons/video/video.c' line='234' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='al_get_video_audio_rate' mangled-name='al_get_video_audio_rate' filepath='addons/video/video.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_video_audio_rate'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='243' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='al_get_video_fps' mangled-name='al_get_video_fps' filepath='addons/video/video.c' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_video_fps'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='251' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='al_get_video_scaled_width' mangled-name='al_get_video_scaled_width' filepath='addons/video/video.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_video_scaled_width'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='259' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_video_scaled_height' mangled-name='al_get_video_scaled_height' filepath='addons/video/video.c' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_video_scaled_height'>
      <parameter type-id='type-id-35' name='video' filepath='addons/video/video.c' line='267' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_init_video_addon' mangled-name='al_init_video_addon' filepath='addons/video/video.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_init_video_addon'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='al_is_video_addon_initialized' mangled-name='al_is_video_addon_initialized' filepath='addons/video/video.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_video_addon_initialized'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='al_shutdown_video_addon' mangled-name='al_shutdown_video_addon' filepath='addons/video/video.c' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_shutdown_video_addon'>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='al_get_allegro_video_version' mangled-name='al_get_allegro_video_version' filepath='addons/video/video.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_allegro_video_version'>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='al_identify_video_f' mangled-name='al_identify_video_f' filepath='addons/video/video.c' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_identify_video_f'>
      <parameter type-id='type-id-44' name='fp' filepath='addons/video/video.c' line='326' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='al_identify_video' mangled-name='al_identify_video' filepath='addons/video/video.c' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_identify_video'>
      <parameter type-id='type-id-39' name='filename' filepath='addons/video/video.c' line='334' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='_al_compute_scaled_dimensions' mangled-name='_al_compute_scaled_dimensions' filepath='addons/video/video.c' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_compute_scaled_dimensions'>
      <parameter type-id='type-id-11' name='frame_w' filepath='addons/video/video.c' line='347' column='1'/>
      <parameter type-id='type-id-11' name='frame_h' filepath='addons/video/video.c' line='347' column='1'/>
      <parameter type-id='type-id-10' name='aspect_ratio' filepath='addons/video/video.c' line='347' column='1'/>
      <parameter type-id='type-id-40' name='scaled_w' filepath='addons/video/video.c' line='348' column='1'/>
      <parameter type-id='type-id-40' name='scaled_h' filepath='addons/video/video.c' line='348' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-50' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-42'/>
    <typedef-decl name='ALLEGRO_FILE' type-id='type-id-51' filepath='include/allegro5/file.h' line='15' column='1' id='type-id-43'/>
    <typedef-decl name='_AL_LIST_ITEM' type-id='type-id-55' filepath='include/allegro5/internal/aintern_list.h' line='9' column='1' id='type-id-48'/>
    <typedef-decl name='ALLEGRO_PATH' type-id='type-id-53' filepath='include/allegro5/path.h' line='20' column='1' id='type-id-46'/>
    <type-decl name='void' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' id='type-id-24'/>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-37'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
</abi-corpus>
