<abi-corpus version='2.2' path='build/lib/liballegro_physfs.so' architecture='elf-amd-x86_64' soname='liballegro_physfs.so.5.2'>
  <elf-needed>
    <dependency name='liballegro.so.5.2'/>
    <dependency name='libphysfs.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_al_get_phys_vtable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_physfs_process_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_set_physfs_fs_interface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_allegro_physfs_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_set_physfs_file_interface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='addons/physfs/a5_physfs.c' comp-dir-path='build/addons/physfs' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <type-decl name='int' size-in-bits='32' id='type-id-3'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-4'/>
    <class-decl name='ALLEGRO_FILE_INTERFACE' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/allegro5/file.h' line='20' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_fopen' type-id='type-id-6' visibility='default' filepath='include/allegro5/file.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_fclose' type-id='type-id-7' visibility='default' filepath='include/allegro5/file.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_fread' type-id='type-id-8' visibility='default' filepath='include/allegro5/file.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fi_fwrite' type-id='type-id-8' visibility='default' filepath='include/allegro5/file.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fi_fflush' type-id='type-id-7' visibility='default' filepath='include/allegro5/file.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fi_ftell' type-id='type-id-9' visibility='default' filepath='include/allegro5/file.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fi_fseek' type-id='type-id-10' visibility='default' filepath='include/allegro5/file.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fi_feof' type-id='type-id-7' visibility='default' filepath='include/allegro5/file.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fi_ferror' type-id='type-id-11' visibility='default' filepath='include/allegro5/file.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fi_ferrmsg' type-id='type-id-12' visibility='default' filepath='include/allegro5/file.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fi_fclearerr' type-id='type-id-13' visibility='default' filepath='include/allegro5/file.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fi_fungetc' type-id='type-id-14' visibility='default' filepath='include/allegro5/file.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='fi_fsize' type-id='type-id-9' visibility='default' filepath='include/allegro5/file.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_FILE_INTERFACE' type-id='type-id-5' filepath='include/allegro5/file.h' line='35' column='1' id='type-id-15'/>
    <typedef-decl name='__int64_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-16'/>
    <typedef-decl name='__off_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-17'/>
    <typedef-decl name='__uint32_t' type-id='type-id-18' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-19'/>
    <typedef-decl name='int64_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-20'/>
    <typedef-decl name='off_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='85' column='1' id='type-id-21'/>
    <typedef-decl name='size_t' type-id='type-id-22' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-23'/>
    <typedef-decl name='uint32_t' type-id='type-id-19' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-24'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-18'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-10'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <class-decl name='ALLEGRO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-40'/>
    <function-decl name='_al_get_phys_vtable' mangled-name='_al_get_phys_vtable' filepath='addons/physfs/a5_physfs.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_get_phys_vtable'>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='al_set_physfs_file_interface' mangled-name='al_set_physfs_file_interface' filepath='addons/physfs/a5_physfs.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_physfs_file_interface'>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='al_get_allegro_physfs_version' mangled-name='al_get_allegro_physfs_version' filepath='addons/physfs/a5_physfs.c' line='310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_allegro_physfs_version'>
      <return type-id='type-id-24'/>
    </function-decl>
    <typedef-decl name='ALLEGRO_FILE' type-id='type-id-40' filepath='include/allegro5/file.h' line='15' column='1' id='type-id-38'/>
    <type-decl name='void' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' id='type-id-42'/>
    <function-type size-in-bits='64' id='type-id-25'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-26'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-31'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-32'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-34'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-33'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-35'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-41'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-37'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='addons/physfs/a5_physfs_dir.c' comp-dir-path='build/addons/physfs' language='LANG_C11'>
    <class-decl name='_al_tagbstring' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/utf8.h' line='20' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mlen' type-id='type-id-3' visibility='default' filepath='include/allegro5/utf8.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slen' type-id='type-id-3' visibility='default' filepath='include/allegro5/utf8.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-44' visibility='default' filepath='include/allegro5/utf8.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_USTR' type-id='type-id-43' filepath='include/allegro5/utf8.h' line='12' column='1' id='type-id-45'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-46'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-44'/>
    <function-decl name='_al_physfs_process_path' mangled-name='_al_physfs_process_path' filepath='addons/physfs/a5_physfs_dir.c' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_physfs_process_path'>
      <parameter type-id='type-id-30' name='path' filepath='addons/physfs/a5_physfs_dir.c' line='56' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_al_set_physfs_fs_interface' mangled-name='_al_set_physfs_fs_interface' filepath='addons/physfs/a5_physfs_dir.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_set_physfs_fs_interface'>
      <return type-id='type-id-41'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
