<abi-corpus version='2.2' path='build/lib/liballegro.so' architecture='elf-amd-x86_64' soname='liballegro.so.5.2'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libX11.so.6'/>
    <dependency name='libXcursor.so.1'/>
    <dependency name='libXi.so.6'/>
    <dependency name='libXinerama.so.1'/>
    <dependency name='libXrandr.so.2'/>
    <dependency name='libXss.so.1'/>
    <dependency name='libOpenGL.so.0'/>
    <dependency name='libGLX.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_al_aa_delete' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_aa_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_aa_insert' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_aa_search' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_add_display_invalidated_callback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_add_display_validated_callback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_al_haptic_driver_list' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_joydrv_linux' size='104' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_joystick_driver_list' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_keyboard_common_names' size='1816' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_keyboard_driver_list' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_mouse_driver_list' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_rgb_scale_1' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_rgb_scale_4' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_rgb_scale_5' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_rgb_scale_6' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_system_interfaces' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_touch_input_driver_list' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_u8_to_float' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_unix_initial_time' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_user_assert_handler' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_user_trace_handler' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_xglx_mmon_interface' size='104' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_xwin_initial_icon' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_fixtorad_r' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_radtofix_r' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/allegro.c' comp-dir-path='build' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <typedef-decl name='__uint32_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-4'/>
    <typedef-decl name='uint32_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-3'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-9'/>
    <function-decl name='al_get_allegro_version' mangled-name='al_get_allegro_version' filepath='src/allegro.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_allegro_version'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='al_run_main' mangled-name='al_run_main' filepath='src/allegro.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_run_main'>
      <parameter type-id='type-id-2' name='argc' filepath='src/allegro.c' line='36' column='1'/>
      <parameter type-id='type-id-7' name='argv' filepath='src/allegro.c' line='36' column='1'/>
      <parameter type-id='type-id-9' name='user_main' filepath='src/allegro.c' line='36' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_get_least_multiple' mangled-name='_al_get_least_multiple' filepath='src/allegro.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_get_least_multiple'>
      <parameter type-id='type-id-2' name='val' filepath='src/allegro.c' line='45' column='1'/>
      <parameter type-id='type-id-2' name='mul' filepath='src/allegro.c' line='45' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-8'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/bitmap.c' comp-dir-path='build' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='type-id-10'/>
    <enum-decl name='ALLEGRO_BITMAP_WRAP' filepath='include/allegro5/bitmap.h' line='17' column='1' id='type-id-11'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_DEFAULT' value='0'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_REPEAT' value='1'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_CLAMP' value='2'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_MIRROR' value='3'/>
    </enum-decl>
    <enum-decl name='ALLEGRO_SHADER_PLATFORM' filepath='include/allegro5/shader.h' line='25' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='ALLEGRO_SHADER_AUTO' value='0'/>
      <enumerator name='ALLEGRO_SHADER_GLSL' value='1'/>
      <enumerator name='ALLEGRO_SHADER_HLSL' value='2'/>
      <enumerator name='ALLEGRO_SHADER_AUTO_MINIMAL' value='3'/>
      <enumerator name='ALLEGRO_SHADER_GLSL_MINIMAL' value='4'/>
      <enumerator name='ALLEGRO_SHADER_HLSL_MINIMAL' value='5'/>
      <enumerator name='ALLEGRO_SHADER_HLSL_SM_3_0' value='6'/>
    </enum-decl>
    <enum-decl name='ALLEGRO_SHADER_TYPE' filepath='include/allegro5/shader.h' line='16' column='1' id='type-id-14'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='ALLEGRO_VERTEX_SHADER' value='1'/>
      <enumerator name='ALLEGRO_PIXEL_SHADER' value='2'/>
    </enum-decl>
    <enum-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' filepath='include/allegro5/mouse_cursor.h' line='12' column='1' id='type-id-15'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_NONE' value='0'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_DEFAULT' value='1'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ARROW' value='2'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_BUSY' value='3'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_QUESTION' value='4'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_EDIT' value='5'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_MOVE' value='6'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_N' value='7'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_W' value='8'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_S' value='9'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_E' value='10'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NW' value='11'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SW' value='12'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SE' value='13'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NE' value='14'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PROGRESS' value='15'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PRECISION' value='16'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_LINK' value='17'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ALT_SELECT' value='18'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_UNAVAILABLE' value='19'/>
      <enumerator name='ALLEGRO_NUM_SYSTEM_MOUSE_CURSORS' value='20'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='type-id-16'/>
    <array-type-def dimensions='2' type-id='type-id-16' size-in-bits='512' id='type-id-17'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-18' id='type-id-19'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-18' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='1024' id='type-id-20'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-18' id='type-id-21'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='1152' id='type-id-22'>
      <subrange length='36' lower-bound='0' upper-bound='35' type-id='type-id-18' id='type-id-23'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-24'/>
    <class-decl name='ALLEGRO_BITMAP' size-in-bits='3456' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='18' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vt' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_depth' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_samples' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_display' type-id='type-id-27' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_wrap_u' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_wrap_v' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_memory_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pitch' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cr_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ct' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cb_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='locked' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lock_x' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lock_y' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='lock_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lock_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lock_data' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lock_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='locked_region' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='transform' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='inverse_transform' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='inverse_transform_dirty' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='proj_transform' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='use_bitmap_blender' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='blender' type-id='type-id-32' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='shader' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='parent' type-id='type-id-34' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='xofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='yofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='memory' type-id='type-id-35' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='extra' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dtor_item' type-id='type-id-36' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dirty' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BITMAP_INTERFACE' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='114' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='draw_bitmap_region' type-id='type-id-38' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='upload_bitmap' type-id='type-id-39' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='update_clipping_rectangle' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='destroy_bitmap' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_region' type-id='type-id-41' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unlock_region' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lock_compressed_region' type-id='type-id-42' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlock_compressed_region' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bitmap_pointer_changed' type-id='type-id-43' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backup_dirty_bitmap' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BLENDER' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='92' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blend_op' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='blend_source' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blend_dest' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blend_alpha_op' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blend_alpha_source' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='blend_alpha_dest' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='blend_color' type-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_COLOR' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/color.h' line='15' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r' type-id='type-id-16' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='g' type-id='type-id-16' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b' type-id='type-id-16' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='a' type-id='type-id-16' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY' size-in-bits='5056' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='124' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='vt' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='refresh_rate' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='min_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='min_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='max_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='backbuffer_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='extra_settings' type-id='type-id-50' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ogl_extras' type-id='type-id-51' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='bitmaps' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='num_cache_vertices' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='cache_enabled' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='vertex_cache_size' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='vertex_cache' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='cache_texture' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='cur_blender' type-id='type-id-32' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='default_shader' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='projview_transform' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='render_state' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='display_invalidated_callbacks' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='display_validated_callbacks' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='use_constraints' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY_INTERFACE' size-in-bits='2944' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='16' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='create_display' type-id='type-id-56' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy_display' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_current_display' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unset_current_display' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear' type-id='type-id-59' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='draw_pixel' type-id='type-id-60' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flip_display' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='update_display_region' type-id='type-id-61' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='acknowledge_resize' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='resize_display' type-id='type-id-62' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='quick_size' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_orientation' type-id='type-id-63' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='create_bitmap' type-id='type-id-64' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_target_bitmap' type-id='type-id-65' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get_backbuffer' type-id='type-id-66' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_compatible_bitmap' type-id='type-id-67' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='switch_out' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='switch_in' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='draw_memory_bitmap_region' type-id='type-id-68' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='wait_for_vsync' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='set_mouse_cursor' type-id='type-id-69' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='set_system_mouse_cursor' type-id='type-id-70' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='show_mouse_cursor' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='hide_mouse_cursor' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='set_icons' type-id='type-id-71' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='set_window_position' type-id='type-id-72' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='get_window_position' type-id='type-id-73' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='get_window_borders' type-id='type-id-74' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='set_window_constraints' type-id='type-id-75' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='get_window_constraints' type-id='type-id-74' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='set_display_flag' type-id='type-id-76' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='set_window_title' type-id='type-id-77' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='flush_vertex_cache' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='prepare_vertex_cache' type-id='type-id-78' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='update_transformation' type-id='type-id-65' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='shutdown' type-id='type-id-79' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='acknowledge_drawing_halt' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='acknowledge_drawing_resume' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='set_display_option' type-id='type-id-72' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='clear_depth_buffer' type-id='type-id-80' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='update_render_state' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='get_clipboard_text' type-id='type-id-81' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='set_clipboard_text' type-id='type-id-82' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='has_clipboard_text' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='apply_window_constraints' type-id='type-id-83' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EVENT_SOURCE' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='76' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pad' type-id='type-id-20' visibility='default' filepath='include/allegro5/events.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' size-in-bits='1408' is-struct='yes' naming-typedef-id='type-id-50' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='114' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='required' type-id='type-id-86' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suggested' type-id='type-id-86' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='settings' type-id='type-id-22' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='info' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='index' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='score' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_LOCKED_REGION' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='24' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-29' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pitch' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pixel_size' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_SHADER' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='38' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vertex_copy' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pixel_copy' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='log' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='platform' type-id='type-id-90' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vt' type-id='type-id-91' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bitmaps' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dtor_item' type-id='type-id-36' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_SHADER_INTERFACE' size-in-bits='896' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='13' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attach_shader_source' type-id='type-id-93' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='build_shader' type-id='type-id-94' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='use_shader' type-id='type-id-95' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='unuse_shader' type-id='type-id-96' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='destroy_shader' type-id='type-id-97' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='on_lost_device' type-id='type-id-97' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='on_reset_device' type-id='type-id-97' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='set_shader_sampler' type-id='type-id-98' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='set_shader_matrix' type-id='type-id-99' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='set_shader_int' type-id='type-id-100' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='set_shader_float' type-id='type-id-101' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='set_shader_int_vector' type-id='type-id-102' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='set_shader_float_vector' type-id='type-id-103' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='set_shader_bool' type-id='type-id-104' visibility='default' filepath='include/allegro5/internal/aintern_shader.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TRANSFORM' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/allegro5/transformations.h' line='14' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-17' visibility='default' filepath='include/allegro5/transformations.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ALLEGRO_RENDER_STATE' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='103' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_mask' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='depth_test' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depth_function' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alpha_test' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alpha_function' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='alpha_test_value' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_VECTOR' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='9' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_itemsize' type-id='type-id-108' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_items' type-id='type-id-6' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_size' type-id='type-id-108' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_unused' type-id='type-id-108' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_al_tagbstring' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/utf8.h' line='20' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mlen' type-id='type-id-2' visibility='default' filepath='include/allegro5/utf8.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slen' type-id='type-id-2' visibility='default' filepath='include/allegro5/utf8.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-35' visibility='default' filepath='include/allegro5/utf8.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-25' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-110'/>
    <typedef-decl name='ALLEGRO_BITMAP_INTERFACE' type-id='type-id-37' filepath='include/allegro5/internal/aintern_bitmap.h' line='16' column='1' id='type-id-111'/>
    <typedef-decl name='ALLEGRO_BITMAP_WRAP' type-id='type-id-11' filepath='include/allegro5/bitmap.h' line='22' column='1' id='type-id-28'/>
    <typedef-decl name='ALLEGRO_BLENDER' type-id='type-id-44' filepath='include/allegro5/internal/aintern_display.h' line='101' column='1' id='type-id-32'/>
    <typedef-decl name='ALLEGRO_COLOR' type-id='type-id-46' filepath='include/allegro5/color.h' line='13' column='1' id='type-id-45'/>
    <typedef-decl name='ALLEGRO_DISPLAY' type-id='type-id-47' filepath='include/allegro5/display.h' line='113' column='1' id='type-id-112'/>
    <typedef-decl name='ALLEGRO_DISPLAY_INTERFACE' type-id='type-id-55' filepath='include/allegro5/internal/aintern_display.h' line='14' column='1' id='type-id-113'/>
    <typedef-decl name='ALLEGRO_EVENT_SOURCE' type-id='type-id-84' filepath='include/allegro5/events.h' line='74' column='1' id='type-id-48'/>
    <typedef-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' type-id='type-id-85' filepath='include/allegro5/internal/aintern_display.h' line='122' column='1' id='type-id-50'/>
    <typedef-decl name='ALLEGRO_LOCKED_REGION' type-id='type-id-87' filepath='include/allegro5/bitmap_lock.h' line='23' column='1' id='type-id-30'/>
    <typedef-decl name='ALLEGRO_SHADER' type-id='type-id-88' filepath='include/allegro5/shader.h' line='14' column='1' id='type-id-114'/>
    <typedef-decl name='ALLEGRO_SHADER_INTERFACE' type-id='type-id-92' filepath='include/allegro5/internal/aintern_shader.h' line='11' column='1' id='type-id-115'/>
    <typedef-decl name='ALLEGRO_SHADER_PLATFORM' type-id='type-id-13' filepath='include/allegro5/shader.h' line='37' column='1' id='type-id-90'/>
    <typedef-decl name='ALLEGRO_SHADER_TYPE' type-id='type-id-14' filepath='include/allegro5/shader.h' line='23' column='1' id='type-id-116'/>
    <typedef-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' type-id='type-id-15' filepath='include/allegro5/mouse_cursor.h' line='35' column='1' id='type-id-117'/>
    <typedef-decl name='ALLEGRO_TRANSFORM' type-id='type-id-105' filepath='include/allegro5/transformations.h' line='12' column='1' id='type-id-31'/>
    <typedef-decl name='ALLEGRO_USTR' type-id='type-id-109' filepath='include/allegro5/utf8.h' line='12' column='1' id='type-id-118'/>
    <typedef-decl name='_ALLEGRO_RENDER_STATE' type-id='type-id-106' filepath='include/allegro5/internal/aintern_display.h' line='107' column='1' id='type-id-54'/>
    <typedef-decl name='_AL_LIST_ITEM' type-id='type-id-119' filepath='include/allegro5/internal/aintern_list.h' line='9' column='1' id='type-id-120'/>
    <typedef-decl name='_AL_VECTOR' type-id='type-id-107' filepath='include/allegro5/internal/aintern_vector.h' line='16' column='1' id='type-id-52'/>
    <typedef-decl name='__int64_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-121'/>
    <typedef-decl name='int64_t' type-id='type-id-121' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-86'/>
    <typedef-decl name='size_t' type-id='type-id-18' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-108'/>
    <typedef-decl name='uintptr_t' type-id='type-id-18' filepath='/usr/include/stdint.h' line='79' column='1' id='type-id-53'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-12'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-122'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-81'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-154'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-156'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
    <class-decl name='ALLEGRO_MOUSE_CURSOR' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-185'/>
    <class-decl name='ALLEGRO_OGL_EXTRAS' size-in-bits='4992' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='128' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extension_list' type-id='type-id-186' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='extension_api' type-id='type-id-187' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ogl_info' type-id='type-id-188' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opengl_target' type-id='type-id-34' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='backbuffer' type-id='type-id-34' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='is_shared' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fbos' type-id='type-id-189' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='program_object' type-id='type-id-190' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='varlocs' type-id='type-id-191' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='vao' type-id='type-id-190' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='vbo' type-id='type-id-190' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_LIST_ITEM' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/misc/list.c' line='50' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-192' visibility='default' filepath='src/misc/list.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-36' visibility='default' filepath='src/misc/list.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev' type-id='type-id-36' visibility='default' filepath='src/misc/list.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-29' visibility='default' filepath='src/misc/list.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dtor' type-id='type-id-193' visibility='default' filepath='src/misc/list.c' line='55' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_MOUSE_CURSOR' type-id='type-id-185' filepath='include/allegro5/mouse_cursor.h' line='10' column='1' id='type-id-183'/>
    <function-decl name='_al_create_bitmap_params' mangled-name='_al_create_bitmap_params' filepath='src/bitmap.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_create_bitmap_params'>
      <parameter type-id='type-id-27' name='current_display' filepath='src/bitmap.c' line='98' column='1'/>
      <parameter type-id='type-id-2' name='w' filepath='src/bitmap.c' line='99' column='1'/>
      <parameter type-id='type-id-2' name='h' filepath='src/bitmap.c' line='99' column='1'/>
      <parameter type-id='type-id-2' name='format' filepath='src/bitmap.c' line='99' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap.c' line='99' column='1'/>
      <parameter type-id='type-id-2' name='depth' filepath='src/bitmap.c' line='99' column='1'/>
      <parameter type-id='type-id-2' name='samples' filepath='src/bitmap.c' line='99' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_create_bitmap' mangled-name='al_create_bitmap' filepath='src/bitmap.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_bitmap'>
      <parameter type-id='type-id-2' name='w' filepath='src/bitmap.c' line='188' column='1'/>
      <parameter type-id='type-id-2' name='h' filepath='src/bitmap.c' line='188' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_destroy_bitmap' mangled-name='al_destroy_bitmap' filepath='src/bitmap.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_destroy_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='206' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_convert_mask_to_alpha' mangled-name='al_convert_mask_to_alpha' filepath='src/bitmap.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_convert_mask_to_alpha'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='255' column='1'/>
      <parameter type-id='type-id-45' name='mask_color' filepath='src/bitmap.c' line='255' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_bitmap_width' mangled-name='al_get_bitmap_width' filepath='src/bitmap.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_width'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='291' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_bitmap_height' mangled-name='al_get_bitmap_height' filepath='src/bitmap.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_height'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='300' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_bitmap_format' mangled-name='al_get_bitmap_format' filepath='src/bitmap.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_format'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='309' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_get_bitmap_memory_format' mangled-name='_al_get_bitmap_memory_format' filepath='src/bitmap.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_get_bitmap_memory_format'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='318' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_bitmap_flags' mangled-name='al_get_bitmap_flags' filepath='src/bitmap.c' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_flags'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='330' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_get_bitmap_display' mangled-name='_al_get_bitmap_display' filepath='src/bitmap.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_get_bitmap_display'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='339' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='al_get_bitmap_depth' mangled-name='al_get_bitmap_depth' filepath='src/bitmap.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_depth'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='350' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_bitmap_samples' mangled-name='al_get_bitmap_samples' filepath='src/bitmap.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_samples'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='361' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_bitmap_blend_color' mangled-name='al_get_bitmap_blend_color' filepath='src/bitmap.c' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_blend_color'>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='al_get_bitmap_blender' mangled-name='al_get_bitmap_blender' filepath='src/bitmap.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_blender'>
      <parameter type-id='type-id-163' name='op' filepath='src/bitmap.c' line='389' column='1'/>
      <parameter type-id='type-id-163' name='src' filepath='src/bitmap.c' line='389' column='1'/>
      <parameter type-id='type-id-163' name='dst' filepath='src/bitmap.c' line='389' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_separate_bitmap_blender' mangled-name='al_get_separate_bitmap_blender' filepath='src/bitmap.c' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_separate_bitmap_blender'>
      <parameter type-id='type-id-163' name='op' filepath='src/bitmap.c' line='396' column='1'/>
      <parameter type-id='type-id-163' name='src' filepath='src/bitmap.c' line='396' column='1'/>
      <parameter type-id='type-id-163' name='dst' filepath='src/bitmap.c' line='396' column='1'/>
      <parameter type-id='type-id-163' name='alpha_op' filepath='src/bitmap.c' line='396' column='1'/>
      <parameter type-id='type-id-163' name='alpha_src' filepath='src/bitmap.c' line='396' column='1'/>
      <parameter type-id='type-id-163' name='alpha_dst' filepath='src/bitmap.c' line='396' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_set_bitmap_blend_color' mangled-name='al_set_bitmap_blend_color' filepath='src/bitmap.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_bitmap_blend_color'>
      <parameter type-id='type-id-45' name='col' filepath='src/bitmap.c' line='432' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_set_bitmap_blender' mangled-name='al_set_bitmap_blender' filepath='src/bitmap.c' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_bitmap_blender'>
      <parameter type-id='type-id-2' name='op' filepath='src/bitmap.c' line='445' column='1'/>
      <parameter type-id='type-id-2' name='src' filepath='src/bitmap.c' line='445' column='1'/>
      <parameter type-id='type-id-2' name='dest' filepath='src/bitmap.c' line='445' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_set_separate_bitmap_blender' mangled-name='al_set_separate_bitmap_blender' filepath='src/bitmap.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_separate_bitmap_blender'>
      <parameter type-id='type-id-2' name='op' filepath='src/bitmap.c' line='456' column='1'/>
      <parameter type-id='type-id-2' name='src' filepath='src/bitmap.c' line='456' column='1'/>
      <parameter type-id='type-id-2' name='dst' filepath='src/bitmap.c' line='456' column='1'/>
      <parameter type-id='type-id-2' name='alpha_op' filepath='src/bitmap.c' line='456' column='1'/>
      <parameter type-id='type-id-2' name='alpha_src' filepath='src/bitmap.c' line='456' column='1'/>
      <parameter type-id='type-id-2' name='alpha_dst' filepath='src/bitmap.c' line='456' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_reset_bitmap_blender' mangled-name='al_reset_bitmap_blender' filepath='src/bitmap.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_reset_bitmap_blender'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_set_clipping_rectangle' mangled-name='al_set_clipping_rectangle' filepath='src/bitmap.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_clipping_rectangle'>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap.c' line='487' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap.c' line='487' column='1'/>
      <parameter type-id='type-id-2' name='width' filepath='src/bitmap.c' line='487' column='1'/>
      <parameter type-id='type-id-2' name='height' filepath='src/bitmap.c' line='487' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_reset_clipping_rectangle' mangled-name='al_reset_clipping_rectangle' filepath='src/bitmap.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_reset_clipping_rectangle'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_clipping_rectangle' mangled-name='al_get_clipping_rectangle' filepath='src/bitmap.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_clipping_rectangle'>
      <parameter type-id='type-id-163' name='x' filepath='src/bitmap.c' line='543' column='1'/>
      <parameter type-id='type-id-163' name='y' filepath='src/bitmap.c' line='543' column='1'/>
      <parameter type-id='type-id-163' name='w' filepath='src/bitmap.c' line='543' column='1'/>
      <parameter type-id='type-id-163' name='h' filepath='src/bitmap.c' line='543' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_create_sub_bitmap' mangled-name='al_create_sub_bitmap' filepath='src/bitmap.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_sub_bitmap'>
      <parameter type-id='type-id-34' name='parent' filepath='src/bitmap.c' line='559' column='1'/>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap.c' line='560' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap.c' line='560' column='1'/>
      <parameter type-id='type-id-2' name='w' filepath='src/bitmap.c' line='560' column='1'/>
      <parameter type-id='type-id-2' name='h' filepath='src/bitmap.c' line='560' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_reparent_bitmap' mangled-name='al_reparent_bitmap' filepath='src/bitmap.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_reparent_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='608' column='1'/>
      <parameter type-id='type-id-34' name='parent' filepath='src/bitmap.c' line='608' column='1'/>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap.c' line='609' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap.c' line='609' column='1'/>
      <parameter type-id='type-id-2' name='w' filepath='src/bitmap.c' line='609' column='1'/>
      <parameter type-id='type-id-2' name='h' filepath='src/bitmap.c' line='609' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_is_sub_bitmap' mangled-name='al_is_sub_bitmap' filepath='src/bitmap.c' line='633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_sub_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='633' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_parent_bitmap' mangled-name='al_get_parent_bitmap' filepath='src/bitmap.c' line='641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_parent_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='641' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_get_bitmap_x' mangled-name='al_get_bitmap_x' filepath='src/bitmap.c' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_x'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='650' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_bitmap_y' mangled-name='al_get_bitmap_y' filepath='src/bitmap.c' line='659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_bitmap_y'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='659' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_copy_bitmap_data' mangled-name='_al_copy_bitmap_data' filepath='src/bitmap.c' line='722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_copy_bitmap_data'>
      <parameter type-id='type-id-29' name='src' filepath='src/bitmap.c' line='723' column='1'/>
      <parameter type-id='type-id-2' name='src_pitch' filepath='src/bitmap.c' line='723' column='1'/>
      <parameter type-id='type-id-29' name='dst' filepath='src/bitmap.c' line='723' column='1'/>
      <parameter type-id='type-id-2' name='dst_pitch' filepath='src/bitmap.c' line='723' column='1'/>
      <parameter type-id='type-id-2' name='sx' filepath='src/bitmap.c' line='724' column='1'/>
      <parameter type-id='type-id-2' name='sy' filepath='src/bitmap.c' line='724' column='1'/>
      <parameter type-id='type-id-2' name='dx' filepath='src/bitmap.c' line='724' column='1'/>
      <parameter type-id='type-id-2' name='dy' filepath='src/bitmap.c' line='724' column='1'/>
      <parameter type-id='type-id-2' name='width' filepath='src/bitmap.c' line='724' column='1'/>
      <parameter type-id='type-id-2' name='height' filepath='src/bitmap.c' line='724' column='1'/>
      <parameter type-id='type-id-2' name='format' filepath='src/bitmap.c' line='725' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_convert_bitmap_data' mangled-name='_al_convert_bitmap_data' filepath='src/bitmap.c' line='765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_convert_bitmap_data'>
      <parameter type-id='type-id-29' name='src' filepath='src/bitmap.c' line='766' column='1'/>
      <parameter type-id='type-id-2' name='src_format' filepath='src/bitmap.c' line='766' column='1'/>
      <parameter type-id='type-id-2' name='src_pitch' filepath='src/bitmap.c' line='766' column='1'/>
      <parameter type-id='type-id-29' name='dst' filepath='src/bitmap.c' line='767' column='1'/>
      <parameter type-id='type-id-2' name='dst_format' filepath='src/bitmap.c' line='767' column='1'/>
      <parameter type-id='type-id-2' name='dst_pitch' filepath='src/bitmap.c' line='767' column='1'/>
      <parameter type-id='type-id-2' name='sx' filepath='src/bitmap.c' line='768' column='1'/>
      <parameter type-id='type-id-2' name='sy' filepath='src/bitmap.c' line='768' column='1'/>
      <parameter type-id='type-id-2' name='dx' filepath='src/bitmap.c' line='768' column='1'/>
      <parameter type-id='type-id-2' name='dy' filepath='src/bitmap.c' line='768' column='1'/>
      <parameter type-id='type-id-2' name='width' filepath='src/bitmap.c' line='768' column='1'/>
      <parameter type-id='type-id-2' name='height' filepath='src/bitmap.c' line='768' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_clone_bitmap' mangled-name='al_clone_bitmap' filepath='src/bitmap.c' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_clone_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='793' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_backup_dirty_bitmap' mangled-name='al_backup_dirty_bitmap' filepath='src/bitmap.c' line='811' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_backup_dirty_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='811' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_get_bitmap_wrap' mangled-name='_al_get_bitmap_wrap' filepath='src/bitmap.c' line='818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_get_bitmap_wrap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap.c' line='818' column='1'/>
      <parameter type-id='type-id-126' name='wrap_u' filepath='src/bitmap.c' line='818' column='1'/>
      <parameter type-id='type-id-126' name='wrap_v' filepath='src/bitmap.c' line='818' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <type-decl name='void' id='type-id-194'/>
    <pointer-type-def type-id='type-id-194' id='type-id-29'/>
    <function-type size-in-bits='64' id='type-id-123'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-34'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-124'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-34'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-27'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-129'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-129'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-134'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-142'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-140'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-141'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-144'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-145'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-146'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-155'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-149'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-150'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-151'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-152'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-153'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-164'>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-169'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-171'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-175'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-178'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-179'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-180'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-181'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-29'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/bitmap_draw.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='al_draw_tinted_bitmap_region' mangled-name='al_draw_tinted_bitmap_region' filepath='src/bitmap_draw.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_tinted_bitmap_region'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='125' column='1'/>
      <parameter type-id='type-id-45' name='tint' filepath='src/bitmap_draw.c' line='126' column='1'/>
      <parameter type-id='type-id-16' name='sx' filepath='src/bitmap_draw.c' line='127' column='1'/>
      <parameter type-id='type-id-16' name='sy' filepath='src/bitmap_draw.c' line='127' column='1'/>
      <parameter type-id='type-id-16' name='sw' filepath='src/bitmap_draw.c' line='127' column='1'/>
      <parameter type-id='type-id-16' name='sh' filepath='src/bitmap_draw.c' line='127' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='127' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='127' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='128' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_tinted_bitmap' mangled-name='al_draw_tinted_bitmap' filepath='src/bitmap_draw.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_tinted_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='137' column='1'/>
      <parameter type-id='type-id-45' name='tint' filepath='src/bitmap_draw.c' line='137' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='138' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='138' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='138' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_bitmap' mangled-name='al_draw_bitmap' filepath='src/bitmap_draw.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='148' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='148' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='148' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='148' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_bitmap_region' mangled-name='al_draw_bitmap_region' filepath='src/bitmap_draw.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_bitmap_region'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='156' column='1'/>
      <parameter type-id='type-id-16' name='sx' filepath='src/bitmap_draw.c' line='157' column='1'/>
      <parameter type-id='type-id-16' name='sy' filepath='src/bitmap_draw.c' line='157' column='1'/>
      <parameter type-id='type-id-16' name='sw' filepath='src/bitmap_draw.c' line='157' column='1'/>
      <parameter type-id='type-id-16' name='sh' filepath='src/bitmap_draw.c' line='157' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='157' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='157' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='157' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_tinted_scaled_bitmap' mangled-name='al_draw_tinted_scaled_bitmap' filepath='src/bitmap_draw.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_tinted_scaled_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='166' column='1'/>
      <parameter type-id='type-id-45' name='tint' filepath='src/bitmap_draw.c' line='167' column='1'/>
      <parameter type-id='type-id-16' name='sx' filepath='src/bitmap_draw.c' line='168' column='1'/>
      <parameter type-id='type-id-16' name='sy' filepath='src/bitmap_draw.c' line='168' column='1'/>
      <parameter type-id='type-id-16' name='sw' filepath='src/bitmap_draw.c' line='168' column='1'/>
      <parameter type-id='type-id-16' name='sh' filepath='src/bitmap_draw.c' line='168' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='169' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='169' column='1'/>
      <parameter type-id='type-id-16' name='dw' filepath='src/bitmap_draw.c' line='169' column='1'/>
      <parameter type-id='type-id-16' name='dh' filepath='src/bitmap_draw.c' line='169' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='169' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_scaled_bitmap' mangled-name='al_draw_scaled_bitmap' filepath='src/bitmap_draw.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_scaled_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='180' column='1'/>
      <parameter type-id='type-id-16' name='sx' filepath='src/bitmap_draw.c' line='181' column='1'/>
      <parameter type-id='type-id-16' name='sy' filepath='src/bitmap_draw.c' line='181' column='1'/>
      <parameter type-id='type-id-16' name='sw' filepath='src/bitmap_draw.c' line='181' column='1'/>
      <parameter type-id='type-id-16' name='sh' filepath='src/bitmap_draw.c' line='181' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='182' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='182' column='1'/>
      <parameter type-id='type-id-16' name='dw' filepath='src/bitmap_draw.c' line='182' column='1'/>
      <parameter type-id='type-id-16' name='dh' filepath='src/bitmap_draw.c' line='182' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='182' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_tinted_rotated_bitmap' mangled-name='al_draw_tinted_rotated_bitmap' filepath='src/bitmap_draw.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_tinted_rotated_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='194' column='1'/>
      <parameter type-id='type-id-45' name='tint' filepath='src/bitmap_draw.c' line='195' column='1'/>
      <parameter type-id='type-id-16' name='cx' filepath='src/bitmap_draw.c' line='196' column='1'/>
      <parameter type-id='type-id-16' name='cy' filepath='src/bitmap_draw.c' line='196' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='196' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='196' column='1'/>
      <parameter type-id='type-id-16' name='angle' filepath='src/bitmap_draw.c' line='196' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='196' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_rotated_bitmap' mangled-name='al_draw_rotated_bitmap' filepath='src/bitmap_draw.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_rotated_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='205' column='1'/>
      <parameter type-id='type-id-16' name='cx' filepath='src/bitmap_draw.c' line='206' column='1'/>
      <parameter type-id='type-id-16' name='cy' filepath='src/bitmap_draw.c' line='206' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='206' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='206' column='1'/>
      <parameter type-id='type-id-16' name='angle' filepath='src/bitmap_draw.c' line='206' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='206' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_tinted_scaled_rotated_bitmap' mangled-name='al_draw_tinted_scaled_rotated_bitmap' filepath='src/bitmap_draw.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_tinted_scaled_rotated_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='215' column='1'/>
      <parameter type-id='type-id-45' name='tint' filepath='src/bitmap_draw.c' line='216' column='1'/>
      <parameter type-id='type-id-16' name='cx' filepath='src/bitmap_draw.c' line='217' column='1'/>
      <parameter type-id='type-id-16' name='cy' filepath='src/bitmap_draw.c' line='217' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='217' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='217' column='1'/>
      <parameter type-id='type-id-16' name='xscale' filepath='src/bitmap_draw.c' line='217' column='1'/>
      <parameter type-id='type-id-16' name='yscale' filepath='src/bitmap_draw.c' line='217' column='1'/>
      <parameter type-id='type-id-16' name='angle' filepath='src/bitmap_draw.c' line='218' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='218' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_tinted_scaled_rotated_bitmap_region' mangled-name='al_draw_tinted_scaled_rotated_bitmap_region' filepath='src/bitmap_draw.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_tinted_scaled_rotated_bitmap_region'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='229' column='1'/>
      <parameter type-id='type-id-16' name='sx' filepath='src/bitmap_draw.c' line='230' column='1'/>
      <parameter type-id='type-id-16' name='sy' filepath='src/bitmap_draw.c' line='230' column='1'/>
      <parameter type-id='type-id-16' name='sw' filepath='src/bitmap_draw.c' line='230' column='1'/>
      <parameter type-id='type-id-16' name='sh' filepath='src/bitmap_draw.c' line='230' column='1'/>
      <parameter type-id='type-id-45' name='tint' filepath='src/bitmap_draw.c' line='231' column='1'/>
      <parameter type-id='type-id-16' name='cx' filepath='src/bitmap_draw.c' line='232' column='1'/>
      <parameter type-id='type-id-16' name='cy' filepath='src/bitmap_draw.c' line='232' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='232' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='232' column='1'/>
      <parameter type-id='type-id-16' name='xscale' filepath='src/bitmap_draw.c' line='232' column='1'/>
      <parameter type-id='type-id-16' name='yscale' filepath='src/bitmap_draw.c' line='232' column='1'/>
      <parameter type-id='type-id-16' name='angle' filepath='src/bitmap_draw.c' line='233' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='233' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_scaled_rotated_bitmap' mangled-name='al_draw_scaled_rotated_bitmap' filepath='src/bitmap_draw.c' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_scaled_rotated_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_draw.c' line='244' column='1'/>
      <parameter type-id='type-id-16' name='cx' filepath='src/bitmap_draw.c' line='245' column='1'/>
      <parameter type-id='type-id-16' name='cy' filepath='src/bitmap_draw.c' line='245' column='1'/>
      <parameter type-id='type-id-16' name='dx' filepath='src/bitmap_draw.c' line='245' column='1'/>
      <parameter type-id='type-id-16' name='dy' filepath='src/bitmap_draw.c' line='245' column='1'/>
      <parameter type-id='type-id-16' name='xscale' filepath='src/bitmap_draw.c' line='245' column='1'/>
      <parameter type-id='type-id-16' name='yscale' filepath='src/bitmap_draw.c' line='245' column='1'/>
      <parameter type-id='type-id-16' name='angle' filepath='src/bitmap_draw.c' line='246' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_draw.c' line='246' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/bitmap_io.c' comp-dir-path='build' language='LANG_C11'>
    <typedef-decl name='ALLEGRO_FILE' type-id='type-id-195' filepath='include/allegro5/file.h' line='15' column='1' id='type-id-196'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <class-decl name='ALLEGRO_FILE' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='13' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-208' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='userdata' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ungetc' type-id='type-id-209' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ungetc_len' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='_al_init_iio_table' mangled-name='_al_init_iio_table' filepath='src/bitmap_io.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_iio_table'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_register_bitmap_loader' mangled-name='al_register_bitmap_loader' filepath='src/bitmap_io.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_bitmap_loader'>
      <parameter type-id='type-id-157' name='extension' filepath='src/bitmap_io.c' line='128' column='1'/>
      <parameter type-id='type-id-200' name='loader' filepath='src/bitmap_io.c' line='129' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_register_bitmap_saver' mangled-name='al_register_bitmap_saver' filepath='src/bitmap_io.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_bitmap_saver'>
      <parameter type-id='type-id-157' name='extension' filepath='src/bitmap_io.c' line='137' column='1'/>
      <parameter type-id='type-id-207' name='saver' filepath='src/bitmap_io.c' line='138' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_register_bitmap_loader_f' mangled-name='al_register_bitmap_loader_f' filepath='src/bitmap_io.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_bitmap_loader_f'>
      <parameter type-id='type-id-157' name='extension' filepath='src/bitmap_io.c' line='146' column='1'/>
      <parameter type-id='type-id-198' name='fs_loader' filepath='src/bitmap_io.c' line='147' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_register_bitmap_saver_f' mangled-name='al_register_bitmap_saver_f' filepath='src/bitmap_io.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_bitmap_saver_f'>
      <parameter type-id='type-id-157' name='extension' filepath='src/bitmap_io.c' line='155' column='1'/>
      <parameter type-id='type-id-205' name='fs_saver' filepath='src/bitmap_io.c' line='156' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_register_bitmap_identifier' mangled-name='al_register_bitmap_identifier' filepath='src/bitmap_io.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_bitmap_identifier'>
      <parameter type-id='type-id-157' name='extension' filepath='src/bitmap_io.c' line='164' column='1'/>
      <parameter type-id='type-id-203' name='identifier' filepath='src/bitmap_io.c' line='165' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_load_bitmap' mangled-name='al_load_bitmap' filepath='src/bitmap_io.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_bitmap'>
      <parameter type-id='type-id-157' name='filename' filepath='src/bitmap_io.c' line='173' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_load_bitmap_flags' mangled-name='al_load_bitmap_flags' filepath='src/bitmap_io.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_bitmap_flags'>
      <parameter type-id='type-id-157' name='filename' filepath='src/bitmap_io.c' line='190' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_io.c' line='190' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_save_bitmap' mangled-name='al_save_bitmap' filepath='src/bitmap_io.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_save_bitmap'>
      <parameter type-id='type-id-157' name='filename' filepath='src/bitmap_io.c' line='223' column='1'/>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_io.c' line='223' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_load_bitmap_f' mangled-name='al_load_bitmap_f' filepath='src/bitmap_io.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_bitmap_f'>
      <parameter type-id='type-id-201' name='fp' filepath='src/bitmap_io.c' line='246' column='1'/>
      <parameter type-id='type-id-157' name='ident' filepath='src/bitmap_io.c' line='246' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_load_bitmap_flags_f' mangled-name='al_load_bitmap_flags_f' filepath='src/bitmap_io.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_bitmap_flags_f'>
      <parameter type-id='type-id-201' name='fp' filepath='src/bitmap_io.c' line='263' column='1'/>
      <parameter type-id='type-id-157' name='ident' filepath='src/bitmap_io.c' line='264' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_io.c' line='264' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_save_bitmap_f' mangled-name='al_save_bitmap_f' filepath='src/bitmap_io.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_save_bitmap_f'>
      <parameter type-id='type-id-201' name='fp' filepath='src/bitmap_io.c' line='280' column='1'/>
      <parameter type-id='type-id-157' name='ident' filepath='src/bitmap_io.c' line='280' column='1'/>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_io.c' line='281' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_identify_bitmap_f' mangled-name='al_identify_bitmap_f' filepath='src/bitmap_io.c' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_identify_bitmap_f'>
      <parameter type-id='type-id-201' name='fp' filepath='src/bitmap_io.c' line='295' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_identify_bitmap' mangled-name='al_identify_bitmap' filepath='src/bitmap_io.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_identify_bitmap'>
      <parameter type-id='type-id-157' name='filename' filepath='src/bitmap_io.c' line='306' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-197'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-34'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-199'>
      <parameter type-id='type-id-157' name='filename'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-34'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-202'>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-206'>
      <parameter type-id='type-id-157' name='filename'/>
      <parameter type-id='type-id-34' name='bitmap'/>
      <return type-id='type-id-10'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/bitmap_lock.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='al_lock_bitmap_region' mangled-name='al_lock_bitmap_region' filepath='src/bitmap_lock.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_lock_bitmap_region'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_lock.c' line='25' column='1'/>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap_lock.c' line='26' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap_lock.c' line='26' column='1'/>
      <parameter type-id='type-id-2' name='width' filepath='src/bitmap_lock.c' line='26' column='1'/>
      <parameter type-id='type-id-2' name='height' filepath='src/bitmap_lock.c' line='26' column='1'/>
      <parameter type-id='type-id-2' name='format' filepath='src/bitmap_lock.c' line='26' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_lock.c' line='26' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='al_lock_bitmap' mangled-name='al_lock_bitmap' filepath='src/bitmap_lock.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_lock_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_lock.c' line='126' column='1'/>
      <parameter type-id='type-id-2' name='format' filepath='src/bitmap_lock.c' line='127' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_lock.c' line='127' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='al_unlock_bitmap' mangled-name='al_unlock_bitmap' filepath='src/bitmap_lock.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_unlock_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_lock.c' line='135' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_is_bitmap_locked' mangled-name='al_is_bitmap_locked' filepath='src/bitmap_lock.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_bitmap_locked'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_lock.c' line='167' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_lock_bitmap_blocked' mangled-name='al_lock_bitmap_blocked' filepath='src/bitmap_lock.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_lock_bitmap_blocked'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_lock.c' line='174' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_lock.c' line='175' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='al_lock_bitmap_region_blocked' mangled-name='al_lock_bitmap_region_blocked' filepath='src/bitmap_lock.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_lock_bitmap_region_blocked'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_lock.c' line='189' column='1'/>
      <parameter type-id='type-id-2' name='x_block' filepath='src/bitmap_lock.c' line='190' column='1'/>
      <parameter type-id='type-id-2' name='y_block' filepath='src/bitmap_lock.c' line='190' column='1'/>
      <parameter type-id='type-id-2' name='width_block' filepath='src/bitmap_lock.c' line='190' column='1'/>
      <parameter type-id='type-id-2' name='height_block' filepath='src/bitmap_lock.c' line='190' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='src/bitmap_lock.c' line='190' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/bitmap_pixel.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='al_get_pixel' mangled-name='al_get_pixel' filepath='src/bitmap_pixel.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_pixel'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_pixel.c' line='27' column='1'/>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap_pixel.c' line='27' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap_pixel.c' line='27' column='1'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='_al_put_pixel' mangled-name='_al_put_pixel' filepath='src/bitmap_pixel.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_put_pixel'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_pixel.c' line='80' column='1'/>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap_pixel.c' line='80' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap_pixel.c' line='80' column='1'/>
      <parameter type-id='type-id-45' name='color' filepath='src/bitmap_pixel.c' line='80' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_put_pixel' mangled-name='al_put_pixel' filepath='src/bitmap_pixel.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_put_pixel'>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap_pixel.c' line='131' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap_pixel.c' line='131' column='1'/>
      <parameter type-id='type-id-45' name='color' filepath='src/bitmap_pixel.c' line='131' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_put_blended_pixel' mangled-name='al_put_blended_pixel' filepath='src/bitmap_pixel.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_put_blended_pixel'>
      <parameter type-id='type-id-2' name='x' filepath='src/bitmap_pixel.c' line='139' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/bitmap_pixel.c' line='139' column='1'/>
      <parameter type-id='type-id-45' name='color' filepath='src/bitmap_pixel.c' line='139' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/bitmap_type.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='_al_init_convert_bitmap_list' mangled-name='_al_init_convert_bitmap_list' filepath='src/bitmap_type.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_convert_bitmap_list'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_register_convert_bitmap' mangled-name='_al_register_convert_bitmap' filepath='src/bitmap_type.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_register_convert_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_type.c' line='57' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_unregister_convert_bitmap' mangled-name='_al_unregister_convert_bitmap' filepath='src/bitmap_type.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_unregister_convert_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_type.c' line='72' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_convert_bitmap' mangled-name='al_convert_bitmap' filepath='src/bitmap_type.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_convert_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_type.c' line='154' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_convert_memory_bitmaps' mangled-name='al_convert_memory_bitmaps' filepath='src/bitmap_type.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_convert_memory_bitmaps'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_convert_to_display_bitmap' mangled-name='_al_convert_to_display_bitmap' filepath='src/bitmap_type.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_convert_to_display_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_type.c' line='279' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_convert_to_memory_bitmap' mangled-name='_al_convert_to_memory_bitmap' filepath='src/bitmap_type.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_convert_to_memory_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/bitmap_type.c' line='300' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/blenders.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='_al_blend_memory' mangled-name='_al_blend_memory' filepath='src/blenders.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_blend_memory'>
      <parameter type-id='type-id-127' name='scol' filepath='src/blenders.c' line='25' column='1'/>
      <parameter type-id='type-id-34' name='dest' filepath='src/blenders.c' line='26' column='1'/>
      <parameter type-id='type-id-2' name='dx' filepath='src/blenders.c' line='27' column='1'/>
      <parameter type-id='type-id-2' name='dy' filepath='src/blenders.c' line='27' column='1'/>
      <parameter type-id='type-id-127' name='result' filepath='src/blenders.c' line='27' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/clipboard.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='al_get_clipboard_text' mangled-name='al_get_clipboard_text' filepath='src/clipboard.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_clipboard_text'>
      <parameter type-id='type-id-27' name='display' filepath='src/clipboard.c' line='29' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='al_set_clipboard_text' mangled-name='al_set_clipboard_text' filepath='src/clipboard.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_clipboard_text'>
      <parameter type-id='type-id-27' name='display' filepath='src/clipboard.c' line='46' column='1'/>
      <parameter type-id='type-id-157' name='text' filepath='src/clipboard.c' line='46' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_clipboard_has_text' mangled-name='al_clipboard_has_text' filepath='src/clipboard.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_clipboard_has_text'>
      <parameter type-id='type-id-27' name='display' filepath='src/clipboard.c' line='64' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/config.c' comp-dir-path='build' language='LANG_C11'>
    <class-decl name='ALLEGRO_CONFIG' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='21' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-211' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last' type-id='type-id-211' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tree' type-id='type-id-212' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_CONFIG_ENTRY' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='6' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='is_comment' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='7' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prev' type-id='type-id-214' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='next' type-id='type-id-214' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='10' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_CONFIG_SECTION' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='13' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-214' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last' type-id='type-id-214' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tree' type-id='type-id-212' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='prev' type-id='type-id-211' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-211' visibility='default' filepath='include/allegro5/internal/aintern_config.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_AATREE' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_aatree.h' line='6' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='level' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_aatree.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='left' type-id='type-id-212' visibility='default' filepath='include/allegro5/internal/aintern_aatree.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='right' type-id='type-id-212' visibility='default' filepath='include/allegro5/internal/aintern_aatree.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_aatree.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='value' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_aatree.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_CONFIG' type-id='type-id-210' filepath='include/allegro5/config.h' line='12' column='1' id='type-id-217'/>
    <typedef-decl name='ALLEGRO_CONFIG_ENTRY' type-id='type-id-213' filepath='include/allegro5/config.h' line='20' column='1' id='type-id-218'/>
    <typedef-decl name='ALLEGRO_CONFIG_SECTION' type-id='type-id-215' filepath='include/allegro5/config.h' line='16' column='1' id='type-id-219'/>
    <typedef-decl name='_AL_AATREE' type-id='type-id-216' filepath='include/allegro5/internal/aintern_aatree.h' line='4' column='1' id='type-id-220'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-212'/>
    <qualified-type-def type-id='type-id-217' const='yes' id='type-id-224'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-225'/>
    <function-decl name='al_create_config' mangled-name='al_create_config' filepath='src/config.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_config'>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='al_add_config_section' mangled-name='al_add_config_section' filepath='src/config.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_add_config_section'>
      <parameter type-id='type-id-221' name='config' filepath='src/config.c' line='110' column='1'/>
      <parameter type-id='type-id-157' name='name' filepath='src/config.c' line='110' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_set_config_value' mangled-name='al_set_config_value' filepath='src/config.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_config_value'>
      <parameter type-id='type-id-221' name='config' filepath='src/config.c' line='164' column='1'/>
      <parameter type-id='type-id-157' name='section' filepath='src/config.c' line='165' column='1'/>
      <parameter type-id='type-id-157' name='key' filepath='src/config.c' line='165' column='1'/>
      <parameter type-id='type-id-157' name='value' filepath='src/config.c' line='165' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_add_config_comment' mangled-name='al_add_config_comment' filepath='src/config.c' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_add_config_comment'>
      <parameter type-id='type-id-221' name='config' filepath='src/config.c' line='225' column='1'/>
      <parameter type-id='type-id-157' name='section' filepath='src/config.c' line='226' column='1'/>
      <parameter type-id='type-id-157' name='comment' filepath='src/config.c' line='226' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_config_value' mangled-name='al_get_config_value' filepath='src/config.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_config_value'>
      <parameter type-id='type-id-225' name='config' filepath='src/config.c' line='268' column='1'/>
      <parameter type-id='type-id-157' name='section' filepath='src/config.c' line='269' column='1'/>
      <parameter type-id='type-id-157' name='key' filepath='src/config.c' line='269' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_load_config_file' mangled-name='al_load_config_file' filepath='src/config.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_config_file'>
      <parameter type-id='type-id-157' name='filename' filepath='src/config.c' line='311' column='1'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='al_load_config_file_f' mangled-name='al_load_config_file_f' filepath='src/config.c' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_config_file_f'>
      <parameter type-id='type-id-201' name='file' filepath='src/config.c' line='328' column='1'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='al_save_config_file' mangled-name='al_save_config_file' filepath='src/config.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_save_config_file'>
      <parameter type-id='type-id-157' name='filename' filepath='src/config.c' line='432' column='1'/>
      <parameter type-id='type-id-225' name='config' filepath='src/config.c' line='432' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_save_config_file_f' mangled-name='al_save_config_file_f' filepath='src/config.c' line='449' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_save_config_file_f'>
      <parameter type-id='type-id-201' name='file' filepath='src/config.c' line='449' column='1'/>
      <parameter type-id='type-id-225' name='config' filepath='src/config.c' line='449' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_merge_config_into' mangled-name='al_merge_config_into' filepath='src/config.c' line='515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_merge_config_into'>
      <parameter type-id='type-id-221' name='master' filepath='src/config.c' line='515' column='1'/>
      <parameter type-id='type-id-225' name='add' filepath='src/config.c' line='515' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_merge_config' mangled-name='al_merge_config' filepath='src/config.c' line='523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_merge_config'>
      <parameter type-id='type-id-225' name='cfg1' filepath='src/config.c' line='523' column='1'/>
      <parameter type-id='type-id-225' name='cfg2' filepath='src/config.c' line='524' column='1'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='al_destroy_config' mangled-name='al_destroy_config' filepath='src/config.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_destroy_config'>
      <parameter type-id='type-id-221' name='config' filepath='src/config.c' line='559' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_first_config_section' mangled-name='al_get_first_config_section' filepath='src/config.c' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_first_config_section'>
      <parameter type-id='type-id-225' name='config' filepath='src/config.c' line='581' column='1'/>
      <parameter type-id='type-id-223' name='iterator' filepath='src/config.c' line='582' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_get_next_config_section' mangled-name='al_get_next_config_section' filepath='src/config.c' line='596' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_next_config_section'>
      <parameter type-id='type-id-223' name='iterator' filepath='src/config.c' line='596' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_get_first_config_entry' mangled-name='al_get_first_config_entry' filepath='src/config.c' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_first_config_entry'>
      <parameter type-id='type-id-225' name='config' filepath='src/config.c' line='612' column='1'/>
      <parameter type-id='type-id-157' name='section' filepath='src/config.c' line='613' column='1'/>
      <parameter type-id='type-id-222' name='iterator' filepath='src/config.c' line='613' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_get_next_config_entry' mangled-name='al_get_next_config_entry' filepath='src/config.c' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_next_config_entry'>
      <parameter type-id='type-id-222' name='iterator' filepath='src/config.c' line='640' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_remove_config_section' mangled-name='al_remove_config_section' filepath='src/config.c' line='658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_remove_config_section'>
      <parameter type-id='type-id-221' name='config' filepath='src/config.c' line='658' column='1'/>
      <parameter type-id='type-id-157' name='section' filepath='src/config.c' line='658' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_remove_config_key' mangled-name='al_remove_config_key' filepath='src/config.c' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_remove_config_key'>
      <parameter type-id='type-id-221' name='config' filepath='src/config.c' line='700' column='1'/>
      <parameter type-id='type-id-157' name='section' filepath='src/config.c' line='700' column='1'/>
      <parameter type-id='type-id-157' name='key' filepath='src/config.c' line='701' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/convert.c' comp-dir-path='build' language='LANG_C11'>
    <array-type-def dimensions='2' type-id='type-id-226' size-in-bits='61504' id='type-id-227'>
      <subrange length='31' lower-bound='0' upper-bound='30' type-id='type-id-18' id='type-id-228'/>
      <subrange length='31' lower-bound='0' upper-bound='30' type-id='type-id-18' id='type-id-228'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-226'/>
    <var-decl name='_al_convert_funcs' type-id='type-id-227' mangled-name='_al_convert_funcs' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='156' column='1' elf-symbol-id='_al_convert_funcs'/>
    <function-type size-in-bits='64' id='type-id-229'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-194'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/cpu.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='al_get_cpu_count' mangled-name='al_get_cpu_count' filepath='src/cpu.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_cpu_count'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_ram_size' mangled-name='al_get_ram_size' filepath='src/cpu.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_ram_size'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/debug.c' comp-dir-path='build' language='LANG_C11'>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <var-decl name='_al_user_assert_handler' type-id='type-id-233' mangled-name='_al_user_assert_handler' visibility='default' filepath='include/allegro5/debug.h' line='58' column='1' elf-symbol-id='_al_user_assert_handler'/>
    <var-decl name='_al_user_trace_handler' type-id='type-id-231' mangled-name='_al_user_trace_handler' visibility='default' filepath='src/debug.c' line='73' column='1' elf-symbol-id='_al_user_trace_handler'/>
    <function-decl name='_al_configure_logging' mangled-name='_al_configure_logging' filepath='src/debug.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_configure_logging'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_trace_prefix' mangled-name='_al_trace_prefix' filepath='src/debug.c' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_trace_prefix'>
      <parameter type-id='type-id-157' name='channel' filepath='src/debug.c' line='218' column='1'/>
      <parameter type-id='type-id-2' name='level' filepath='src/debug.c' line='218' column='1'/>
      <parameter type-id='type-id-157' name='file' filepath='src/debug.c' line='219' column='1'/>
      <parameter type-id='type-id-2' name='line' filepath='src/debug.c' line='219' column='1'/>
      <parameter type-id='type-id-157' name='function' filepath='src/debug.c' line='219' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_al_trace_suffix' mangled-name='_al_trace_suffix' filepath='src/debug.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_trace_suffix'>
      <parameter type-id='type-id-157' name='msg' filepath='src/debug.c' line='301' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_shutdown_logging' mangled-name='_al_shutdown_logging' filepath='src/debug.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_shutdown_logging'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_register_assert_handler' mangled-name='al_register_assert_handler' filepath='src/debug.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_assert_handler'>
      <parameter type-id='type-id-233' name='handler' filepath='src/debug.c' line='367' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_register_trace_handler' mangled-name='al_register_trace_handler' filepath='src/debug.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_trace_handler'>
      <parameter type-id='type-id-231' name='handler' filepath='src/debug.c' line='376' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-234'/>
    <function-type size-in-bits='64' id='type-id-230'>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-232'>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-194'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/display.c' comp-dir-path='build' language='LANG_C11'>
    <enum-decl name='ALLEGRO_RENDER_STATE' filepath='include/allegro5/render_state.h' line='12' column='1' id='type-id-235'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='ALLEGRO_ALPHA_TEST' value='16'/>
      <enumerator name='ALLEGRO_WRITE_MASK' value='17'/>
      <enumerator name='ALLEGRO_DEPTH_TEST' value='18'/>
      <enumerator name='ALLEGRO_DEPTH_FUNCTION' value='19'/>
      <enumerator name='ALLEGRO_ALPHA_FUNCTION' value='20'/>
      <enumerator name='ALLEGRO_ALPHA_TEST_VALUE' value='21'/>
    </enum-decl>
    <typedef-decl name='ALLEGRO_RENDER_STATE' type-id='type-id-235' filepath='include/allegro5/render_state.h' line='22' column='1' id='type-id-236'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-237'/>
    <function-decl name='al_create_display' mangled-name='al_create_display' filepath='src/display.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_display'>
      <parameter type-id='type-id-2' name='w' filepath='src/display.c' line='38' column='1'/>
      <parameter type-id='type-id-2' name='h' filepath='src/display.c' line='38' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='al_destroy_display' mangled-name='al_destroy_display' filepath='src/display.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_destroy_display'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='142' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_backbuffer' mangled-name='al_get_backbuffer' filepath='src/display.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_backbuffer'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='176' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='al_flip_display' mangled-name='al_flip_display' filepath='src/display.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_flip_display'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_update_display_region' mangled-name='al_update_display_region' filepath='src/display.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_update_display_region'>
      <parameter type-id='type-id-2' name='x' filepath='src/display.c' line='203' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/display.c' line='203' column='1'/>
      <parameter type-id='type-id-2' name='width' filepath='src/display.c' line='203' column='1'/>
      <parameter type-id='type-id-2' name='height' filepath='src/display.c' line='203' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_acknowledge_resize' mangled-name='al_acknowledge_resize' filepath='src/display.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_acknowledge_resize'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='217' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_resize_display' mangled-name='al_resize_display' filepath='src/display.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_resize_display'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='234' column='1'/>
      <parameter type-id='type-id-2' name='width' filepath='src/display.c' line='234' column='1'/>
      <parameter type-id='type-id-2' name='height' filepath='src/display.c' line='234' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_is_compatible_bitmap' mangled-name='al_is_compatible_bitmap' filepath='src/display.c' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_compatible_bitmap'>
      <parameter type-id='type-id-34' name='bitmap' filepath='src/display.c' line='251' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_display_width' mangled-name='al_get_display_width' filepath='src/display.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_width'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='268' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_display_height' mangled-name='al_get_display_height' filepath='src/display.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_height'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='279' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_display_format' mangled-name='al_get_display_format' filepath='src/display.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_format'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='289' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_display_refresh_rate' mangled-name='al_get_display_refresh_rate' filepath='src/display.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_refresh_rate'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='299' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_display_flags' mangled-name='al_get_display_flags' filepath='src/display.c' line='310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_flags'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='310' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_display_orientation' mangled-name='al_get_display_orientation' filepath='src/display.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_orientation'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='320' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_wait_for_vsync' mangled-name='al_wait_for_vsync' filepath='src/display.c' line='331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_wait_for_vsync'>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_set_display_icon' mangled-name='al_set_display_icon' filepath='src/display.c' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_display_icon'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='346' column='1'/>
      <parameter type-id='type-id-34' name='icon' filepath='src/display.c' line='346' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_set_display_icons' mangled-name='al_set_display_icons' filepath='src/display.c' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_display_icons'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='357' column='1'/>
      <parameter type-id='type-id-2' name='num_icons' filepath='src/display.c' line='358' column='1'/>
      <parameter type-id='type-id-125' name='icons' filepath='src/display.c' line='358' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_set_window_position' mangled-name='al_set_window_position' filepath='src/display.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_window_position'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='376' column='1'/>
      <parameter type-id='type-id-2' name='x' filepath='src/display.c' line='376' column='1'/>
      <parameter type-id='type-id-2' name='y' filepath='src/display.c' line='376' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_window_position' mangled-name='al_get_window_position' filepath='src/display.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_window_position'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='392' column='1'/>
      <parameter type-id='type-id-163' name='x' filepath='src/display.c' line='392' column='1'/>
      <parameter type-id='type-id-163' name='y' filepath='src/display.c' line='392' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_window_borders' mangled-name='al_get_window_borders' filepath='src/display.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_window_borders'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='408' column='1'/>
      <parameter type-id='type-id-163' name='left' filepath='src/display.c' line='408' column='1'/>
      <parameter type-id='type-id-163' name='top' filepath='src/display.c' line='408' column='1'/>
      <parameter type-id='type-id-163' name='right' filepath='src/display.c' line='408' column='1'/>
      <parameter type-id='type-id-163' name='bottom' filepath='src/display.c' line='408' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_set_window_constraints' mangled-name='al_set_window_constraints' filepath='src/display.c' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_window_constraints'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='421' column='1'/>
      <parameter type-id='type-id-2' name='min_w' filepath='src/display.c' line='422' column='1'/>
      <parameter type-id='type-id-2' name='min_h' filepath='src/display.c' line='422' column='1'/>
      <parameter type-id='type-id-2' name='max_w' filepath='src/display.c' line='422' column='1'/>
      <parameter type-id='type-id-2' name='max_h' filepath='src/display.c' line='422' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_window_constraints' mangled-name='al_get_window_constraints' filepath='src/display.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_window_constraints'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='459' column='1'/>
      <parameter type-id='type-id-163' name='min_w' filepath='src/display.c' line='460' column='1'/>
      <parameter type-id='type-id-163' name='min_h' filepath='src/display.c' line='460' column='1'/>
      <parameter type-id='type-id-163' name='max_w' filepath='src/display.c' line='460' column='1'/>
      <parameter type-id='type-id-163' name='max_h' filepath='src/display.c' line='460' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_set_display_flag' mangled-name='al_set_display_flag' filepath='src/display.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_display_flag'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='480' column='1'/>
      <parameter type-id='type-id-2' name='flag' filepath='src/display.c' line='480' column='1'/>
      <parameter type-id='type-id-10' name='onoff' filepath='src/display.c' line='480' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_set_window_title' mangled-name='al_set_window_title' filepath='src/display.c' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_window_title'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='493' column='1'/>
      <parameter type-id='type-id-157' name='title' filepath='src/display.c' line='493' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_display_event_source' mangled-name='al_get_display_event_source' filepath='src/display.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_event_source'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='502' column='1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='al_hold_bitmap_drawing' mangled-name='al_hold_bitmap_drawing' filepath='src/display.c' line='509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_hold_bitmap_drawing'>
      <parameter type-id='type-id-10' name='hold' filepath='src/display.c' line='509' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_is_bitmap_drawing_held' mangled-name='al_is_bitmap_drawing_held' filepath='src/display.c' line='545' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_bitmap_drawing_held'>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_al_add_display_invalidated_callback' mangled-name='_al_add_display_invalidated_callback' filepath='src/display.c' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_add_display_invalidated_callback'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='555' column='1'/>
      <parameter type-id='type-id-57' name='display_invalidated' filepath='src/display.c' line='555' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_add_display_validated_callback' mangled-name='_al_add_display_validated_callback' filepath='src/display.c' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_add_display_validated_callback'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='566' column='1'/>
      <parameter type-id='type-id-57' name='display_validated' filepath='src/display.c' line='566' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_remove_display_invalidated_callback' mangled-name='_al_remove_display_invalidated_callback' filepath='src/display.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_remove_display_invalidated_callback'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='577' column='1'/>
      <parameter type-id='type-id-57' name='callback' filepath='src/display.c' line='577' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_remove_display_validated_callback' mangled-name='_al_remove_display_validated_callback' filepath='src/display.c' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_remove_display_validated_callback'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='582' column='1'/>
      <parameter type-id='type-id-57' name='callback' filepath='src/display.c' line='582' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_acknowledge_drawing_halt' mangled-name='al_acknowledge_drawing_halt' filepath='src/display.c' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_acknowledge_drawing_halt'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='589' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_acknowledge_drawing_resume' mangled-name='al_acknowledge_drawing_resume' filepath='src/display.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_acknowledge_drawing_resume'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='598' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_render_state' mangled-name='al_get_render_state' filepath='src/display.c' line='607' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_render_state'>
      <parameter type-id='type-id-236' name='state' filepath='src/display.c' line='607' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_set_render_state' mangled-name='al_set_render_state' filepath='src/display.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_render_state'>
      <parameter type-id='type-id-236' name='state' filepath='src/display.c' line='642' column='1'/>
      <parameter type-id='type-id-2' name='value' filepath='src/display.c' line='642' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_backup_dirty_bitmaps' mangled-name='al_backup_dirty_bitmaps' filepath='src/display.c' line='680' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_backup_dirty_bitmaps'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='680' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_apply_window_constraints' mangled-name='al_apply_window_constraints' filepath='src/display.c' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_apply_window_constraints'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='697' column='1'/>
      <parameter type-id='type-id-10' name='onoff' filepath='src/display.c' line='697' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_display_adapter' mangled-name='al_get_display_adapter' filepath='src/display.c' line='707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_adapter'>
      <parameter type-id='type-id-27' name='display' filepath='src/display.c' line='707' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/display_settings.c' comp-dir-path='build' language='LANG_C11'>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-238'/>
    <function-decl name='al_set_new_display_option' mangled-name='al_set_new_display_option' filepath='src/display_settings.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_new_display_option'>
      <parameter type-id='type-id-2' name='option' filepath='src/display_settings.c' line='29' column='1'/>
      <parameter type-id='type-id-2' name='value' filepath='src/display_settings.c' line='29' column='1'/>
      <parameter type-id='type-id-2' name='importance' filepath='src/display_settings.c' line='29' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_get_suggested_display_option' mangled-name='_al_get_suggested_display_option' filepath='src/display_settings.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_get_suggested_display_option'>
      <parameter type-id='type-id-27' name='d' filepath='src/display_settings.c' line='51' column='1'/>
      <parameter type-id='type-id-2' name='option' filepath='src/display_settings.c' line='52' column='1'/>
      <parameter type-id='type-id-2' name='default_value' filepath='src/display_settings.c' line='52' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_get_new_display_option' mangled-name='al_get_new_display_option' filepath='src/display_settings.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_new_display_option'>
      <parameter type-id='type-id-2' name='option' filepath='src/display_settings.c' line='64' column='1'/>
      <parameter type-id='type-id-163' name='importance' filepath='src/display_settings.c' line='64' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_set_display_option' mangled-name='al_set_display_option' filepath='src/display_settings.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_display_option'>
      <parameter type-id='type-id-27' name='display' filepath='src/display_settings.c' line='82' column='1'/>
      <parameter type-id='type-id-2' name='option' filepath='src/display_settings.c' line='82' column='1'/>
      <parameter type-id='type-id-2' name='value' filepath='src/display_settings.c' line='82' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_display_option' mangled-name='al_get_display_option' filepath='src/display_settings.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_display_option'>
      <parameter type-id='type-id-27' name='display' filepath='src/display_settings.c' line='94' column='1'/>
      <parameter type-id='type-id-2' name='option' filepath='src/display_settings.c' line='94' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_reset_new_display_options' mangled-name='al_reset_new_display_options' filepath='src/display_settings.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_reset_new_display_options'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_fill_display_settings' mangled-name='_al_fill_display_settings' filepath='src/display_settings.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_fill_display_settings'>
      <parameter type-id='type-id-238' name='ref' filepath='src/display_settings.c' line='119' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_score_display_settings' mangled-name='_al_score_display_settings' filepath='src/display_settings.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_score_display_settings'>
      <parameter type-id='type-id-238' name='eds' filepath='src/display_settings.c' line='231' column='1'/>
      <parameter type-id='type-id-238' name='ref' filepath='src/display_settings.c' line='232' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_display_settings_sorter' mangled-name='_al_display_settings_sorter' filepath='src/display_settings.c' line='538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_display_settings_sorter'>
      <parameter type-id='type-id-29' name='p0' filepath='src/display_settings.c' line='538' column='1'/>
      <parameter type-id='type-id-29' name='p1' filepath='src/display_settings.c' line='538' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_deduce_color_format' mangled-name='_al_deduce_color_format' filepath='src/display_settings.c' line='556' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_deduce_color_format'>
      <parameter type-id='type-id-238' name='eds' filepath='src/display_settings.c' line='556' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_set_color_components' mangled-name='_al_set_color_components' filepath='src/display_settings.c' line='688' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_set_color_components'>
      <parameter type-id='type-id-2' name='format' filepath='src/display_settings.c' line='688' column='1'/>
      <parameter type-id='type-id-238' name='eds' filepath='src/display_settings.c' line='688' column='1'/>
      <parameter type-id='type-id-2' name='importance' filepath='src/display_settings.c' line='689' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/drawing.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='al_clear_to_color' mangled-name='al_clear_to_color' filepath='src/drawing.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_clear_to_color'>
      <parameter type-id='type-id-45' name='color' filepath='src/drawing.c' line='26' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_clear_depth_buffer' mangled-name='al_clear_depth_buffer' filepath='src/drawing.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_clear_depth_buffer'>
      <parameter type-id='type-id-16' name='z' filepath='src/drawing.c' line='46' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_draw_pixel' mangled-name='al_draw_pixel' filepath='src/drawing.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_pixel'>
      <parameter type-id='type-id-16' name='x' filepath='src/drawing.c' line='64' column='1'/>
      <parameter type-id='type-id-16' name='y' filepath='src/drawing.c' line='64' column='1'/>
      <parameter type-id='type-id-45' name='color' filepath='src/drawing.c' line='64' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/dtor.c' comp-dir-path='build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-239'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-18' id='type-id-240'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-241'/>
    <class-decl name='_AL_DTOR_LIST' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/dtor.c' line='41' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-243' visibility='default' filepath='src/dtor.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dtors' type-id='type-id-192' visibility='default' filepath='src/dtor.c' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_MUTEX' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/platform/aintuthr.h' line='26' column='1' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inited' type-id='type-id-10' visibility='default' filepath='include/allegro5/platform/aintuthr.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mutex' type-id='type-id-245' visibility='default' filepath='include/allegro5/platform/aintuthr.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-247' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-247' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-241' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-241' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-249' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_AL_DTOR_LIST' type-id='type-id-242' filepath='include/allegro5/internal/aintern_dtor.h' line='11' column='1' id='type-id-250'/>
    <typedef-decl name='_AL_LIST' type-id='type-id-251' filepath='include/allegro5/internal/aintern_list.h' line='8' column='1' id='type-id-252'/>
    <typedef-decl name='_AL_MUTEX' type-id='type-id-244' filepath='include/allegro5/internal/aintern_thread.h' line='12' column='1' id='type-id-243'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-246' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='55' column='1' id='type-id-249'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-253' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-245'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-245' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-253'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-248' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-24' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <class-decl name='_AL_LIST' size-in-bits='512' is-struct='yes' visibility='default' filepath='src/misc/list.c' line='35' column='1' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-36' visibility='default' filepath='src/misc/list.c' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-108' visibility='default' filepath='src/misc/list.c' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='capacity' type-id='type-id-108' visibility='default' filepath='src/misc/list.c' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='item_size' type-id='type-id-108' visibility='default' filepath='src/misc/list.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='item_size_with_extra' type-id='type-id-108' visibility='default' filepath='src/misc/list.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_free' type-id='type-id-36' visibility='default' filepath='src/misc/list.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='user_data' type-id='type-id-29' visibility='default' filepath='src/misc/list.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dtor' type-id='type-id-259' visibility='default' filepath='src/misc/list.c' line='46' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='_al_init_destructors' mangled-name='_al_init_destructors' filepath='src/dtor.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_destructors'>
      <return type-id='type-id-254'/>
    </function-decl>
    <function-decl name='_al_push_destructor_owner' mangled-name='_al_push_destructor_owner' filepath='src/dtor.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_push_destructor_owner'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_pop_destructor_owner' mangled-name='_al_pop_destructor_owner' filepath='src/dtor.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_pop_destructor_owner'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_run_destructors' mangled-name='_al_run_destructors' filepath='src/dtor.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_run_destructors'>
      <parameter type-id='type-id-254' name='dtors' filepath='src/dtor.c' line='101' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_shutdown_destructors' mangled-name='_al_shutdown_destructors' filepath='src/dtor.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_shutdown_destructors'>
      <parameter type-id='type-id-254' name='dtors' filepath='src/dtor.c' line='136' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_register_destructor' mangled-name='_al_register_destructor' filepath='src/dtor.c' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_register_destructor'>
      <parameter type-id='type-id-254' name='dtors' filepath='src/dtor.c' line='162' column='1'/>
      <parameter type-id='type-id-157' name='name' filepath='src/dtor.c' line='162' column='1'/>
      <parameter type-id='type-id-29' name='object' filepath='src/dtor.c' line='163' column='1'/>
      <parameter type-id='type-id-256' name='func' filepath='src/dtor.c' line='163' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='_al_unregister_destructor' mangled-name='_al_unregister_destructor' filepath='src/dtor.c' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_unregister_destructor'>
      <parameter type-id='type-id-254' name='dtors' filepath='src/dtor.c' line='218' column='1'/>
      <parameter type-id='type-id-36' name='dtor_item' filepath='src/dtor.c' line='218' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_foreach_destructor' mangled-name='_al_foreach_destructor' filepath='src/dtor.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_foreach_destructor'>
      <parameter type-id='type-id-254' name='dtors' filepath='src/dtor.c' line='240' column='1'/>
      <parameter type-id='type-id-258' name='callback' filepath='src/dtor.c' line='241' column='1'/>
      <parameter type-id='type-id-29' name='userdata' filepath='src/dtor.c' line='242' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-255'>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-257'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-256'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-194'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/events.c' comp-dir-path='build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-260' size-in-bits='192' id='type-id-261'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-18' id='type-id-262'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-263' size-in-bits='2048' id='type-id-264'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-18' id='type-id-21'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-265' size-in-bits='5120' id='type-id-266'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-18' id='type-id-267'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='384' id='type-id-268'>
      <subrange length='48' lower-bound='0' upper-bound='47' type-id='type-id-18' id='type-id-269'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-270'/>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='96' id='type-id-271'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-18' id='type-id-262'/>
    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-272'/>
    <class-decl name='ALLEGRO_ANY_EVENT' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='103' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-237' visibility='default' filepath='include/allegro5/events.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY_EVENT' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='109' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-276' visibility='default' filepath='include/allegro5/events.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='y' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='height' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='orientation' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DROP_EVENT' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='202' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-276' visibility='default' filepath='include/allegro5/events.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='y' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='row' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='is_file' type-id='type-id-10' visibility='default' filepath='include/allegro5/events.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='text' type-id='type-id-6' visibility='default' filepath='include/allegro5/events.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='is_complete' type-id='type-id-10' visibility='default' filepath='include/allegro5/events.h' line='209' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EVENT_QUEUE' size-in-bits='1472' is-struct='yes' visibility='default' filepath='src/events.c' line='36' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sources' type-id='type-id-52' visibility='default' filepath='src/events.c' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='events' type-id='type-id-52' visibility='default' filepath='src/events.c' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='events_head' type-id='type-id-3' visibility='default' filepath='src/events.c' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='events_tail' type-id='type-id-3' visibility='default' filepath='src/events.c' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='paused' type-id='type-id-10' visibility='default' filepath='src/events.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mutex' type-id='type-id-243' visibility='default' filepath='src/events.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='cond' type-id='type-id-279' visibility='default' filepath='src/events.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='dtor_item' type-id='type-id-36' visibility='default' filepath='src/events.c' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_JOYSTICK' size-in-bits='7296' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='79' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='info' type-id='type-id-281' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='driver' type-id='type-id-282' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_JOYSTICK_DRIVER' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='12' column='1' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='joydrv_id' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='joydrv_name' type-id='type-id-157' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='joydrv_desc' type-id='type-id-157' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='joydrv_ascii_name' type-id='type-id-157' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='init_joystick' type-id='type-id-284' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='exit_joystick' type-id='type-id-79' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reconfigure_joysticks' type-id='type-id-284' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='num_joysticks' type-id='type-id-285' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_joystick' type-id='type-id-286' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='release_joystick' type-id='type-id-287' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_joystick_state' type-id='type-id-288' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='get_name' type-id='type-id-289' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_active' type-id='type-id-290' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_JOYSTICK_EVENT' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='118' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-292' visibility='default' filepath='include/allegro5/events.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-292' visibility='default' filepath='include/allegro5/events.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stick' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='axis' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pos' type-id='type-id-16' visibility='default' filepath='include/allegro5/events.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='button' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_JOYSTICK_STATE' size-in-bits='2560' is-struct='yes' visibility='default' filepath='include/allegro5/joystick.h' line='47' column='1' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stick' type-id='type-id-294' visibility='default' filepath='include/allegro5/joystick.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='button' type-id='type-id-20' visibility='default' filepath='include/allegro5/joystick.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_KEYBOARD' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_keyboard.h' line='34' column='1' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_keyboard.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_KEYBOARD_EVENT' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='130' column='1' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-297' visibility='default' filepath='include/allegro5/events.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='display' type-id='type-id-276' visibility='default' filepath='include/allegro5/events.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='keycode' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='unichar' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='modifiers' type-id='type-id-3' visibility='default' filepath='include/allegro5/events.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='repeat' type-id='type-id-10' visibility='default' filepath='include/allegro5/events.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_MOUSE' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_mouse.h' line='32' column='1' id='type-id-298'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_mouse.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_MOUSE_EVENT' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='142' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-300' visibility='default' filepath='include/allegro5/events.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='display' type-id='type-id-276' visibility='default' filepath='include/allegro5/events.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='y' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='z' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='w' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dx' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='dy' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dz' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='dw' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='button' type-id='type-id-3' visibility='default' filepath='include/allegro5/events.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='pressure' type-id='type-id-16' visibility='default' filepath='include/allegro5/events.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TIMEOUT' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/altime.h' line='13' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pad1__' type-id='type-id-302' visibility='default' filepath='include/allegro5/altime.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__pad2__' type-id='type-id-302' visibility='default' filepath='include/allegro5/altime.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TIMER_EVENT' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='160' column='1' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-304' visibility='default' filepath='include/allegro5/events.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='count' type-id='type-id-86' visibility='default' filepath='include/allegro5/events.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='error' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TOUCH_EVENT' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='169' column='1' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-306' visibility='default' filepath='include/allegro5/events.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='display' type-id='type-id-276' visibility='default' filepath='include/allegro5/events.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='include/allegro5/events.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='x' type-id='type-id-16' visibility='default' filepath='include/allegro5/events.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='y' type-id='type-id-16' visibility='default' filepath='include/allegro5/events.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='dx' type-id='type-id-16' visibility='default' filepath='include/allegro5/events.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dy' type-id='type-id-16' visibility='default' filepath='include/allegro5/events.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='primary' type-id='type-id-10' visibility='default' filepath='include/allegro5/events.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TOUCH_INPUT' size-in-bits='2080' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_touch_input.h' line='24' column='1' id='type-id-307'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_touch_input.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='mouse_emulation_es' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_touch_input.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='mouse_emulation_mode' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_touch_input.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_USER_EVENT' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='190' column='1' id='type-id-308'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='source' type-id='type-id-309' visibility='default' filepath='include/allegro5/events.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='type-id-270' visibility='default' filepath='include/allegro5/events.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__internal__descr' type-id='type-id-310' visibility='default' filepath='include/allegro5/events.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data1' type-id='type-id-311' visibility='default' filepath='include/allegro5/events.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data2' type-id='type-id-311' visibility='default' filepath='include/allegro5/events.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='data3' type-id='type-id-311' visibility='default' filepath='include/allegro5/events.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='data4' type-id='type-id-311' visibility='default' filepath='include/allegro5/events.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_USER_EVENT_DESCRIPTOR' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_events.h' line='21' column='1' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dtor' type-id='type-id-313' visibility='default' filepath='include/allegro5/internal/aintern_events.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='refcount' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_events.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_COND' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/platform/aintuthr.h' line='36' column='1' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cond' type-id='type-id-315' visibility='default' filepath='include/allegro5/platform/aintuthr.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_JOYSTICK_AXIS_INFO' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='44' column='1' id='type-id-316'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-6' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_JOYSTICK_BUTTON_INFO' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='61' column='1' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-157' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_JOYSTICK_INFO' size-in-bits='7232' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='68' column='1' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_sticks' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_buttons' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stick' type-id='type-id-266' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='button' type-id='type-id-264' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_JOYSTICK_STICK_INFO' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='51' column='1' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_axes' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='axis' type-id='type-id-261' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name' type-id='type-id-6' visibility='default' filepath='include/allegro5/internal/aintern_joystick.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='type-id-321' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='type-id-321' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-322' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-322' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-322' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/allegro5/joystick.h' line='49' column='1' id='type-id-323'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='axis' type-id='type-id-271' visibility='default' filepath='include/allegro5/joystick.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-323' size-in-bits='1536' id='type-id-294'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-18' id='type-id-267'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='28' column='1' id='type-id-324'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_ANY_EVENT' type-id='type-id-273' filepath='include/allegro5/events.h' line='106' column='1' id='type-id-325'/>
    <typedef-decl name='ALLEGRO_DISPLAY_EVENT' type-id='type-id-275' filepath='include/allegro5/events.h' line='115' column='1' id='type-id-326'/>
    <typedef-decl name='ALLEGRO_DROP_EVENT' type-id='type-id-277' filepath='include/allegro5/events.h' line='210' column='1' id='type-id-327'/>
    <typedef-decl name='ALLEGRO_EVENT' type-id='type-id-328' filepath='include/allegro5/events.h' line='216' column='1' id='type-id-329'/>
    <typedef-decl name='ALLEGRO_EVENT_QUEUE' type-id='type-id-278' filepath='include/allegro5/events.h' line='258' column='1' id='type-id-330'/>
    <typedef-decl name='ALLEGRO_EVENT_TYPE' type-id='type-id-3' filepath='include/allegro5/events.h' line='13' column='1' id='type-id-274'/>
    <typedef-decl name='ALLEGRO_JOYSTICK' type-id='type-id-280' filepath='include/allegro5/joystick.h' line='39' column='1' id='type-id-331'/>
    <typedef-decl name='ALLEGRO_JOYSTICK_DRIVER' type-id='type-id-283' filepath='include/allegro5/internal/aintern_joystick.h' line='27' column='1' id='type-id-332'/>
    <typedef-decl name='ALLEGRO_JOYSTICK_EVENT' type-id='type-id-291' filepath='include/allegro5/events.h' line='126' column='1' id='type-id-333'/>
    <typedef-decl name='ALLEGRO_JOYSTICK_STATE' type-id='type-id-293' filepath='include/allegro5/joystick.h' line='45' column='1' id='type-id-334'/>
    <typedef-decl name='ALLEGRO_KEYBOARD_EVENT' type-id='type-id-296' filepath='include/allegro5/events.h' line='138' column='1' id='type-id-335'/>
    <typedef-decl name='ALLEGRO_MOUSE_EVENT' type-id='type-id-299' filepath='include/allegro5/events.h' line='156' column='1' id='type-id-336'/>
    <typedef-decl name='ALLEGRO_TIMEOUT' type-id='type-id-301' filepath='include/allegro5/altime.h' line='12' column='1' id='type-id-337'/>
    <typedef-decl name='ALLEGRO_TIMER_EVENT' type-id='type-id-303' filepath='include/allegro5/events.h' line='165' column='1' id='type-id-338'/>
    <typedef-decl name='ALLEGRO_TOUCH_EVENT' type-id='type-id-305' filepath='include/allegro5/events.h' line='182' column='1' id='type-id-339'/>
    <typedef-decl name='ALLEGRO_USER_EVENT' type-id='type-id-308' filepath='include/allegro5/events.h' line='188' column='1' id='type-id-340'/>
    <typedef-decl name='_AL_COND' type-id='type-id-314' filepath='include/allegro5/internal/aintern_thread.h' line='13' column='1' id='type-id-279'/>
    <typedef-decl name='_AL_JOYSTICK_AXIS_INFO' type-id='type-id-316' filepath='include/allegro5/internal/aintern_joystick.h' line='47' column='1' id='type-id-260'/>
    <typedef-decl name='_AL_JOYSTICK_BUTTON_INFO' type-id='type-id-317' filepath='include/allegro5/internal/aintern_joystick.h' line='64' column='1' id='type-id-263'/>
    <typedef-decl name='_AL_JOYSTICK_INFO' type-id='type-id-318' filepath='include/allegro5/internal/aintern_joystick.h' line='74' column='1' id='type-id-281'/>
    <typedef-decl name='_AL_JOYSTICK_STICK_INFO' type-id='type-id-319' filepath='include/allegro5/internal/aintern_joystick.h' line='57' column='1' id='type-id-265'/>
    <typedef-decl name='__atomic_wide_counter' type-id='type-id-341' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='33' column='1' id='type-id-321'/>
    <typedef-decl name='__intptr_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='207' column='1' id='type-id-342'/>
    <typedef-decl name='__uint64_t' type-id='type-id-18' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-343'/>
    <typedef-decl name='intptr_t' type-id='type-id-342' filepath='/usr/include/unistd.h' line='267' column='1' id='type-id-311'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-344' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-315'/>
    <typedef-decl name='uint64_t' type-id='type-id-343' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-302'/>
    <union-decl name='ALLEGRO_EVENT' size-in-bits='576' visibility='default' filepath='include/allegro5/events.h' line='218' column='1' id='type-id-328'>
      <data-member access='public'>
        <var-decl name='type' type-id='type-id-274' visibility='default' filepath='include/allegro5/events.h' line='221' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='any' type-id='type-id-325' visibility='default' filepath='include/allegro5/events.h' line='226' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='display' type-id='type-id-326' visibility='default' filepath='include/allegro5/events.h' line='227' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='joystick' type-id='type-id-333' visibility='default' filepath='include/allegro5/events.h' line='228' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyboard' type-id='type-id-335' visibility='default' filepath='include/allegro5/events.h' line='229' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mouse' type-id='type-id-336' visibility='default' filepath='include/allegro5/events.h' line='230' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='timer' type-id='type-id-338' visibility='default' filepath='include/allegro5/events.h' line='231' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='touch' type-id='type-id-339' visibility='default' filepath='include/allegro5/events.h' line='232' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='user' type-id='type-id-340' visibility='default' filepath='include/allegro5/events.h' line='233' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drop' type-id='type-id-327' visibility='default' filepath='include/allegro5/events.h' line='234' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__atomic_wide_counter' size-in-bits='64' naming-typedef-id='type-id-321' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='25' column='1' id='type-id-341'>
      <data-member access='public'>
        <var-decl name='__value64' type-id='type-id-345' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='27' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__value32' type-id='type-id-324' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='32' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_cond_t' size-in-bits='384' naming-typedef-id='type-id-315' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-344'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-320' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-268' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-272' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='64' id='type-id-322'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-18' id='type-id-346'/>
    </array-type-def>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-290'/>
    <qualified-type-def type-id='type-id-329' const='yes' id='type-id-357'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-359'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-313'/>
    <class-decl name='ALLEGRO_TIMER' size-in-bits='1344' is-struct='yes' visibility='default' filepath='src/timernu.c' line='40' column='1' id='type-id-353'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-48' visibility='default' filepath='src/timernu.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='started' type-id='type-id-10' visibility='default' filepath='src/timernu.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='speed_secs' type-id='type-id-270' visibility='default' filepath='src/timernu.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='count' type-id='type-id-86' visibility='default' filepath='src/timernu.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='counter' type-id='type-id-270' visibility='default' filepath='src/timernu.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='dtor_item' type-id='type-id-36' visibility='default' filepath='src/timernu.c' line='47' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='_al_init_events' mangled-name='_al_init_events' filepath='src/events.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_events'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_create_event_queue' mangled-name='al_create_event_queue' filepath='src/events.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_event_queue'>
      <return type-id='type-id-348'/>
    </function-decl>
    <function-decl name='al_destroy_event_queue' mangled-name='al_destroy_event_queue' filepath='src/events.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_destroy_event_queue'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='120' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_is_event_source_registered' mangled-name='al_is_event_source_registered' filepath='src/events.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_event_source_registered'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='147' column='1'/>
      <parameter type-id='type-id-237' name='source' filepath='src/events.c' line='148' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_register_event_source' mangled-name='al_register_event_source' filepath='src/events.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_register_event_source'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='161' column='1'/>
      <parameter type-id='type-id-237' name='source' filepath='src/events.c' line='162' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_unregister_event_source' mangled-name='al_unregister_event_source' filepath='src/events.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_unregister_event_source'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='181' column='1'/>
      <parameter type-id='type-id-237' name='source' filepath='src/events.c' line='182' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_pause_event_queue' mangled-name='al_pause_event_queue' filepath='src/events.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_pause_event_queue'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='208' column='1'/>
      <parameter type-id='type-id-10' name='pause' filepath='src/events.c' line='208' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_is_event_queue_paused' mangled-name='al_is_event_queue_paused' filepath='src/events.c' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_event_queue_paused'>
      <parameter type-id='type-id-360' name='queue' filepath='src/events.c' line='221' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_is_event_queue_empty' mangled-name='al_is_event_queue_empty' filepath='src/events.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_event_queue_empty'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='248' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_next_event' mangled-name='al_get_next_event' filepath='src/events.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_next_event'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='299' column='1'/>
      <parameter type-id='type-id-347' name='ret_event' filepath='src/events.c' line='299' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_peek_next_event' mangled-name='al_peek_next_event' filepath='src/events.c' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_peek_next_event'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='324' column='1'/>
      <parameter type-id='type-id-347' name='ret_event' filepath='src/events.c' line='324' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_drop_next_event' mangled-name='al_drop_next_event' filepath='src/events.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_drop_next_event'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='349' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_flush_event_queue' mangled-name='al_flush_event_queue' filepath='src/events.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_flush_event_queue'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='372' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_wait_for_event' mangled-name='al_wait_for_event' filepath='src/events.c' line='398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_wait_for_event'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='398' column='1'/>
      <parameter type-id='type-id-347' name='ret_event' filepath='src/events.c' line='398' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_wait_for_event_timed' mangled-name='al_wait_for_event_timed' filepath='src/events.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_wait_for_event_timed'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='430' column='1'/>
      <parameter type-id='type-id-347' name='ret_event' filepath='src/events.c' line='431' column='1'/>
      <parameter type-id='type-id-16' name='secs' filepath='src/events.c' line='431' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_wait_for_event_until' mangled-name='al_wait_for_event_until' filepath='src/events.c' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_wait_for_event_until'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='452' column='1'/>
      <parameter type-id='type-id-347' name='ret_event' filepath='src/events.c' line='453' column='1'/>
      <parameter type-id='type-id-352' name='timeout' filepath='src/events.c' line='453' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_al_event_queue_push_event' mangled-name='_al_event_queue_push_event' filepath='src/events.c' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_queue_push_event'>
      <parameter type-id='type-id-348' name='queue' filepath='src/events.c' line='599' column='1'/>
      <parameter type-id='type-id-358' name='orig_event' filepath='src/events.c' line='600' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_unref_user_event' mangled-name='al_unref_user_event' filepath='src/events.c' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_unref_user_event'>
      <parameter type-id='type-id-354' name='event' filepath='src/events.c' line='711' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-350'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-349'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-356'>
      <parameter type-id='type-id-349'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-361'>
      <parameter type-id='type-id-349'/>
      <return type-id='type-id-157'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-363'>
      <parameter type-id='type-id-349'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-364'>
      <parameter type-id='type-id-349'/>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-365'>
      <parameter type-id='type-id-354'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-355'>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-362'>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/evtsrc.c' comp-dir-path='build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-366'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-367'/>
    <function-decl name='_al_event_source_init' mangled-name='_al_event_source_init' filepath='src/evtsrc.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_init'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='37' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_event_source_free' mangled-name='_al_event_source_free' filepath='src/evtsrc.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_free'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='55' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_event_source_lock' mangled-name='_al_event_source_lock' filepath='src/evtsrc.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_lock'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='75' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_event_source_unlock' mangled-name='_al_event_source_unlock' filepath='src/evtsrc.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_unlock'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='87' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_event_source_on_registration_to_queue' mangled-name='_al_event_source_on_registration_to_queue' filepath='src/evtsrc.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_on_registration_to_queue'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='102' column='1'/>
      <parameter type-id='type-id-348' name='queue' filepath='src/evtsrc.c' line='103' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_event_source_on_unregistration_from_queue' mangled-name='_al_event_source_on_unregistration_from_queue' filepath='src/evtsrc.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_on_unregistration_from_queue'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='122' column='1'/>
      <parameter type-id='type-id-348' name='queue' filepath='src/evtsrc.c' line='123' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_event_source_needs_to_generate_event' mangled-name='_al_event_source_needs_to_generate_event' filepath='src/evtsrc.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_needs_to_generate_event'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='148' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_al_event_source_emit_event' mangled-name='_al_event_source_emit_event' filepath='src/evtsrc.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_event_source_emit_event'>
      <parameter type-id='type-id-237' name='es' filepath='src/evtsrc.c' line='170' column='1'/>
      <parameter type-id='type-id-347' name='event' filepath='src/evtsrc.c' line='170' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_init_user_event_source' mangled-name='al_init_user_event_source' filepath='src/evtsrc.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_init_user_event_source'>
      <parameter type-id='type-id-237' name='src' filepath='src/evtsrc.c' line='195' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_destroy_user_event_source' mangled-name='al_destroy_user_event_source' filepath='src/evtsrc.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_destroy_user_event_source'>
      <parameter type-id='type-id-237' name='src' filepath='src/evtsrc.c' line='206' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_emit_user_event' mangled-name='al_emit_user_event' filepath='src/evtsrc.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_emit_user_event'>
      <parameter type-id='type-id-237' name='src' filepath='src/evtsrc.c' line='217' column='1'/>
      <parameter type-id='type-id-347' name='event' filepath='src/evtsrc.c' line='218' column='1'/>
      <parameter type-id='type-id-313' name='dtor' filepath='src/evtsrc.c' line='218' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_set_event_source_data' mangled-name='al_set_event_source_data' filepath='src/evtsrc.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_event_source_data'>
      <parameter type-id='type-id-237' name='source' filepath='src/evtsrc.c' line='264' column='1'/>
      <parameter type-id='type-id-311' name='data' filepath='src/evtsrc.c' line='264' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_event_source_data' mangled-name='al_get_event_source_data' filepath='src/evtsrc.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_event_source_data'>
      <parameter type-id='type-id-367' name='source' filepath='src/evtsrc.c' line='274' column='1'/>
      <return type-id='type-id-311'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/exitfunc.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='_al_add_exit_func' mangled-name='_al_add_exit_func' filepath='src/exitfunc.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_add_exit_func'>
      <parameter type-id='type-id-79' name='func' filepath='src/exitfunc.c' line='39' column='1'/>
      <parameter type-id='type-id-157' name='desc' filepath='src/exitfunc.c' line='39' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_remove_exit_func' mangled-name='_al_remove_exit_func' filepath='src/exitfunc.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_remove_exit_func'>
      <parameter type-id='type-id-79' name='func' filepath='src/exitfunc.c' line='63' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='_al_run_exit_funcs' mangled-name='_al_run_exit_funcs' filepath='src/exitfunc.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_run_exit_funcs'>
      <return type-id='type-id-194'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/file.c' comp-dir-path='build' language='LANG_C11'>
    <class-decl name='ALLEGRO_FILE' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='13' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-208' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='userdata' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ungetc' type-id='type-id-209' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ungetc_len' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_FILE_INTERFACE' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/allegro5/file.h' line='20' column='1' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_fopen' type-id='type-id-369' visibility='default' filepath='include/allegro5/file.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_fclose' type-id='type-id-203' visibility='default' filepath='include/allegro5/file.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_fread' type-id='type-id-370' visibility='default' filepath='include/allegro5/file.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fi_fwrite' type-id='type-id-370' visibility='default' filepath='include/allegro5/file.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fi_fflush' type-id='type-id-203' visibility='default' filepath='include/allegro5/file.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fi_ftell' type-id='type-id-371' visibility='default' filepath='include/allegro5/file.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fi_fseek' type-id='type-id-372' visibility='default' filepath='include/allegro5/file.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fi_feof' type-id='type-id-203' visibility='default' filepath='include/allegro5/file.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fi_ferror' type-id='type-id-373' visibility='default' filepath='include/allegro5/file.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fi_ferrmsg' type-id='type-id-374' visibility='default' filepath='include/allegro5/file.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fi_fclearerr' type-id='type-id-375' visibility='default' filepath='include/allegro5/file.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fi_fungetc' type-id='type-id-376' visibility='default' filepath='include/allegro5/file.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='fi_fsize' type-id='type-id-371' visibility='default' filepath='include/allegro5/file.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-377'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-29' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_FILE_INTERFACE' type-id='type-id-368' filepath='include/allegro5/file.h' line='35' column='1' id='type-id-378'/>
    <typedef-decl name='__int16_t' type-id='type-id-241' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='39' column='1' id='type-id-379'/>
    <typedef-decl name='__int32_t' type-id='type-id-2' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-380'/>
    <typedef-decl name='__off_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-381'/>
    <typedef-decl name='int16_t' type-id='type-id-379' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-382'/>
    <typedef-decl name='int32_t' type-id='type-id-380' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-383'/>
    <typedef-decl name='off_t' type-id='type-id-381' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='85' column='1' id='type-id-384'/>
    <array-type-def dimensions='1' type-id='type-id-122' size-in-bits='128' id='type-id-209'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-18' id='type-id-267'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-387'/>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-388'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-369'/>
    <function-decl name='al_fopen' mangled-name='al_fopen' filepath='src/file.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fopen'>
      <parameter type-id='type-id-157' name='path' filepath='src/file.c' line='24' column='1'/>
      <parameter type-id='type-id-157' name='mode' filepath='src/file.c' line='24' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='al_fopen_interface' mangled-name='al_fopen_interface' filepath='src/file.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fopen_interface'>
      <parameter type-id='type-id-208' name='drv' filepath='src/file.c' line='32' column='1'/>
      <parameter type-id='type-id-157' name='path' filepath='src/file.c' line='33' column='1'/>
      <parameter type-id='type-id-157' name='mode' filepath='src/file.c' line='33' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='al_create_file_handle' mangled-name='al_create_file_handle' filepath='src/file.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_file_handle'>
      <parameter type-id='type-id-208' name='drv' filepath='src/file.c' line='63' column='1'/>
      <parameter type-id='type-id-29' name='userdata' filepath='src/file.c' line='64' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='al_fclose' mangled-name='al_fclose' filepath='src/file.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fclose'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='86' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_fread' mangled-name='al_fread' filepath='src/file.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fread'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='101' column='1'/>
      <parameter type-id='type-id-29' name='ptr' filepath='src/file.c' line='101' column='1'/>
      <parameter type-id='type-id-108' name='size' filepath='src/file.c' line='101' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='al_fwrite' mangled-name='al_fwrite' filepath='src/file.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fwrite'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='126' column='1'/>
      <parameter type-id='type-id-29' name='ptr' filepath='src/file.c' line='126' column='1'/>
      <parameter type-id='type-id-108' name='size' filepath='src/file.c' line='126' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='al_fflush' mangled-name='al_fflush' filepath='src/file.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fflush'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='138' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_ftell' mangled-name='al_ftell' filepath='src/file.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_ftell'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='148' column='1'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='al_fseek' mangled-name='al_fseek' filepath='src/file.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fseek'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='158' column='1'/>
      <parameter type-id='type-id-86' name='offset' filepath='src/file.c' line='158' column='1'/>
      <parameter type-id='type-id-2' name='whence' filepath='src/file.c' line='158' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_feof' mangled-name='al_feof' filepath='src/file.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_feof'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='181' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_ferror' mangled-name='al_ferror' filepath='src/file.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_ferror'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='191' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_ferrmsg' mangled-name='al_ferrmsg' filepath='src/file.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_ferrmsg'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='201' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_fclearerr' mangled-name='al_fclearerr' filepath='src/file.c' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fclearerr'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='214' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_fgetc' mangled-name='al_fgetc' filepath='src/file.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fgetc'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='224' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_fputc' mangled-name='al_fputc' filepath='src/file.c' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fputc'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='239' column='1'/>
      <parameter type-id='type-id-2' name='c' filepath='src/file.c' line='239' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_fread16le' mangled-name='al_fread16le' filepath='src/file.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fread16le'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='254' column='1'/>
      <return type-id='type-id-382'/>
    </function-decl>
    <function-decl name='al_fread32le' mangled-name='al_fread32le' filepath='src/file.c' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fread32le'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='269' column='1'/>
      <return type-id='type-id-383'/>
    </function-decl>
    <function-decl name='al_fwrite16le' mangled-name='al_fwrite16le' filepath='src/file.c' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fwrite16le'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='285' column='1'/>
      <parameter type-id='type-id-382' name='w' filepath='src/file.c' line='285' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='al_fwrite32le' mangled-name='al_fwrite32le' filepath='src/file.c' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fwrite32le'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='305' column='1'/>
      <parameter type-id='type-id-383' name='l' filepath='src/file.c' line='305' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='al_fread16be' mangled-name='al_fread16be' filepath='src/file.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fread16be'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='333' column='1'/>
      <return type-id='type-id-382'/>
    </function-decl>
    <function-decl name='al_fread32be' mangled-name='al_fread32be' filepath='src/file.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fread32be'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='348' column='1'/>
      <return type-id='type-id-383'/>
    </function-decl>
    <function-decl name='al_fwrite16be' mangled-name='al_fwrite16be' filepath='src/file.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fwrite16be'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='364' column='1'/>
      <parameter type-id='type-id-382' name='w' filepath='src/file.c' line='364' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='al_fwrite32be' mangled-name='al_fwrite32be' filepath='src/file.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fwrite32be'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='384' column='1'/>
      <parameter type-id='type-id-383' name='l' filepath='src/file.c' line='384' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='al_fgets' mangled-name='al_fgets' filepath='src/file.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fgets'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='412' column='1'/>
      <parameter type-id='type-id-387' name='buf' filepath='src/file.c' line='412' column='1'/>
      <parameter type-id='type-id-108' name='max' filepath='src/file.c' line='412' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='al_fget_ustr' mangled-name='al_fget_ustr' filepath='src/file.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fget_ustr'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='457' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='al_fputs' mangled-name='al_fputs' filepath='src/file.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fputs'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='480' column='1'/>
      <parameter type-id='type-id-157' name='p' filepath='src/file.c' line='480' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_fungetc' mangled-name='al_fungetc' filepath='src/file.c' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fungetc'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='497' column='1'/>
      <parameter type-id='type-id-2' name='c' filepath='src/file.c' line='497' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_fsize' mangled-name='al_fsize' filepath='src/file.c' line='523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fsize'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='523' column='1'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='al_get_file_userdata' mangled-name='al_get_file_userdata' filepath='src/file.c' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_file_userdata'>
      <parameter type-id='type-id-201' name='f' filepath='src/file.c' line='533' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='al_vfprintf' mangled-name='al_vfprintf' filepath='src/file.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_vfprintf'>
      <parameter type-id='type-id-201' name='pfile' filepath='src/file.c' line='543' column='1'/>
      <parameter type-id='type-id-157' name='format' filepath='src/file.c' line='543' column='1'/>
      <parameter type-id='type-id-385' name='args' filepath='src/file.c' line='543' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='al_fprintf' mangled-name='al_fprintf' filepath='src/file.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fprintf'>
      <parameter type-id='type-id-201' name='pfile' filepath='src/file.c' line='576' column='1'/>
      <parameter type-id='type-id-157' name='format' filepath='src/file.c' line='576' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-386'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-390'>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-392'>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-86'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-391'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-393'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-108'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-394'>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-194'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-395'>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-29'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-389'>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-157'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/file_slice.c' comp-dir-path='build' language='LANG_C11'>
    <function-decl name='al_fopen_slice' mangled-name='al_fopen_slice' filepath='src/file_slice.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fopen_slice'>
      <parameter type-id='type-id-201' name='fp' filepath='src/file_slice.c' line='209' column='1'/>
      <parameter type-id='type-id-108' name='initial_size' filepath='src/file_slice.c' line='209' column='1'/>
      <parameter type-id='type-id-157' name='mode' filepath='src/file_slice.c' line='209' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/file_stdio.c' comp-dir-path='build' language='LANG_C11'>
    <typedef-decl name='ALLEGRO_PATH' type-id='type-id-396' filepath='include/allegro5/path.h' line='20' column='1' id='type-id-397'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <class-decl name='ALLEGRO_PATH' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_path.h' line='4' column='1' id='type-id-396'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drive' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_path.h' line='5' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='filename' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_path.h' line='6' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='segments' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_path.h' line='7' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='basename' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_path.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='full_string' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_path.h' line='9' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='_al_file_interface_stdio' type-id='type-id-388' mangled-name='_al_file_interface_stdio' visibility='default' filepath='include/allegro5/internal/aintern_file.h' line='9' column='1' elf-symbol-id='_al_file_interface_stdio'/>
    <function-decl name='al_fopen_fd' mangled-name='al_fopen_fd' filepath='src/file_stdio.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fopen_fd'>
      <parameter type-id='type-id-2' name='fd' filepath='src/file_stdio.c' line='68' column='1'/>
      <parameter type-id='type-id-157' name='mode' filepath='src/file_stdio.c' line='68' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='al_set_standard_file_interface' mangled-name='al_set_standard_file_interface' filepath='src/file_stdio.c' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_set_standard_file_interface'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_make_temp_file' mangled-name='al_make_temp_file' filepath='src/file_stdio.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_make_temp_file'>
      <parameter type-id='type-id-157' name='template' filepath='src/file_stdio.c' line='460' column='1'/>
      <parameter type-id='type-id-399' name='ret_path' filepath='src/file_stdio.c' line='460' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/fshook.c' comp-dir-path='build' language='LANG_C11'>
    <class-decl name='ALLEGRO_FS_ENTRY' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/allegro5/fshook.h' line='39' column='1' id='type-id-400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-401' visibility='default' filepath='include/allegro5/fshook.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_FS_INTERFACE' size-in-bits='1280' is-struct='yes' visibility='default' filepath='include/allegro5/fshook.h' line='66' column='1' id='type-id-402'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fs_create_entry' type-id='type-id-403' visibility='default' filepath='include/allegro5/fshook.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fs_destroy_entry' type-id='type-id-404' visibility='default' filepath='include/allegro5/fshook.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fs_entry_name' type-id='type-id-405' visibility='default' filepath='include/allegro5/fshook.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fs_update_entry' type-id='type-id-406' visibility='default' filepath='include/allegro5/fshook.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fs_entry_mode' type-id='type-id-407' visibility='default' filepath='include/allegro5/fshook.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fs_entry_atime' type-id='type-id-408' visibility='default' filepath='include/allegro5/fshook.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fs_entry_mtime' type-id='type-id-408' visibility='default' filepath='include/allegro5/fshook.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fs_entry_ctime' type-id='type-id-408' visibility='default' filepath='include/allegro5/fshook.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fs_entry_size' type-id='type-id-408' visibility='default' filepath='include/allegro5/fshook.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fs_entry_exists' type-id='type-id-406' visibility='default' filepath='include/allegro5/fshook.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fs_remove_entry' type-id='type-id-406' visibility='default' filepath='include/allegro5/fshook.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fs_open_directory' type-id='type-id-406' visibility='default' filepath='include/allegro5/fshook.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='fs_read_directory' type-id='type-id-409' visibility='default' filepath='include/allegro5/fshook.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='fs_close_directory' type-id='type-id-406' visibility='default' filepath='include/allegro5/fshook.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fs_filename_exists' type-id='type-id-410' visibility='default' filepath='include/allegro5/fshook.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='fs_remove_filename' type-id='type-id-410' visibility='default' filepath='include/allegro5/fshook.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='fs_get_current_directory' type-id='type-id-411' visibility='default' filepath='include/allegro5/fshook.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='fs_change_directory' type-id='type-id-410' visibility='default' filepath='include/allegro5/fshook.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fs_make_directory' type-id='type-id-410' visibility='default' filepath='include/allegro5/fshook.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='fs_open_file' type-id='type-id-412' visibility='default' filepath='include/allegro5/fshook.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_FS_ENTRY' type-id='type-id-400' filepath='include/allegro5/fshook.h' line='37' column='1' id='type-id-413'/>
    <typedef-decl name='__time_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-414'/>
    <typedef-decl name='time_t' type-id='type-id-414' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='10' column='1' id='type-id-415'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-412'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-417'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-409'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-403'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-406'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-410'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-411'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-423'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-401'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-408'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-404'/>
    <function-decl name='al_create_fs_entry' mangled-name='al_create_fs_entry' filepath='src/fshook.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_fs_entry'>
      <parameter type-id='type-id-157' name='path' filepath='src/fshook.c' line='28' column='1'/>
      <return type-id='type-id-417'/>
    </function-decl>
    <function-decl name='al_destroy_fs_entry' mangled-name='al_destroy_fs_entry' filepath='src/fshook.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_destroy_fs_entry'>
      <parameter type-id='type-id-417' name='fh' filepath='src/fshook.c' line='38' column='1'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='al_get_fs_entry_name' mangled-name='al_get_fs_entry_name' filepath='src/fshook.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_fs_entry_name'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='48' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='al_update_fs_entry' mangled-name='al_update_fs_entry' filepath='src/fshook.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_update_fs_entry'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='58' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_fs_entry_mode' mangled-name='al_get_fs_entry_mode' filepath='src/fshook.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_fs_entry_mode'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='68' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='al_get_fs_entry_atime' mangled-name='al_get_fs_entry_atime' filepath='src/fshook.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_fs_entry_atime'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='78' column='1'/>
      <return type-id='type-id-415'/>
    </function-decl>
    <function-decl name='al_get_fs_entry_mtime' mangled-name='al_get_fs_entry_mtime' filepath='src/fshook.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_fs_entry_mtime'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='88' column='1'/>
      <return type-id='type-id-415'/>
    </function-decl>
    <function-decl name='al_get_fs_entry_ctime' mangled-name='al_get_fs_entry_ctime' filepath='src/fshook.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_fs_entry_ctime'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='98' column='1'/>
      <return type-id='type-id-415'/>
    </function-decl>
    <function-decl name='al_get_fs_entry_size' mangled-name='al_get_fs_entry_size' filepath='src/fshook.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_fs_entry_size'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='108' column='1'/>
      <return type-id='type-id-384'/>
    </function-decl>
    <function-decl name='al_remove_fs_entry' mangled-name='al_remove_fs_entry' filepath='src/fshook.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_remove_fs_entry'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='118' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_fs_entry_exists' mangled-name='al_fs_entry_exists' filepath='src/fshook.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_fs_entry_exists'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='128' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_open_directory' mangled-name='al_open_directory' filepath='src/fshook.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_open_directory'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='138' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_close_directory' mangled-name='al_close_directory' filepath='src/fshook.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_close_directory'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='148' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_read_directory' mangled-name='al_read_directory' filepath='src/fshook.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_read_directory'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='158' column='1'/>
      <return type-id='type-id-417'/>
    </function-decl>
    <function-decl name='al_get_current_directory' mangled-name='al_get_current_directory' filepath='src/fshook.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_current_directory'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='al_change_directory' mangled-name='al_change_directory' filepath='src/fshook.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_change_directory'>
      <parameter type-id='type-id-157' name='path' filepath='src/fshook.c' line='178' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_make_directory' mangled-name='al_make_directory' filepath='src/fshook.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_make_directory'>
      <parameter type-id='type-id-157' name='path' filepath='src/fshook.c' line='190' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_filename_exists' mangled-name='al_filename_exists' filepath='src/fshook.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_filename_exists'>
      <parameter type-id='type-id-157' name='path' filepath='src/fshook.c' line='202' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_remove_filename' mangled-name='al_remove_filename' filepath='src/fshook.c' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_remove_filename'>
      <parameter type-id='type-id-157' name='path' filepath='src/fshook.c' line='214' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_open_fs_entry' mangled-name='al_open_fs_entry' filepath='src/fshook.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_open_fs_entry'>
      <parameter type-id='type-id-417' name='e' filepath='src/fshook.c' line='226' column='1'/>
      <parameter type-id='type-id-157' name='mode' filepath='src/fshook.c' line='226' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='al_for_each_fs_entry' mangled-name='al_for_each_fs_entry' filepath='src/fshook.c' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_for_each_fs_entry'>
      <parameter type-id='type-id-417' name='dir' filepath='src/fshook.c' line='242' column='1'/>
      <parameter type-id='type-id-426' name='callback' filepath='src/fshook.c' line='243' column='1'/>
      <parameter type-id='type-id-29' name='extra' filepath='src/fshook.c' line='244' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-416'>
      <parameter type-id='type-id-417'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-201'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-418'>
      <parameter type-id='type-id-417'/>
      <return type-id='type-id-417'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-419'>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-417'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-420'>
      <parameter type-id='type-id-417'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-421'>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-422'>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-424'>
      <parameter type-id='type-id-417'/>
      <return type-id='type-id-157'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-427'>
      <parameter type-id='type-id-417'/>
      <return type-id='type-id-415'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-425'>
      <parameter type-id='type-id-417'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-428'>
      <parameter type-id='type-id-417'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-429'>
      <parameter type-id='type-id-417'/>
      <return type-id='type-id-194'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/fshook_stdio.c' comp-dir-path='build' language='LANG_C11'>
    <var-decl name='_al_fs_interface_stdio' type-id='type-id-402' mangled-name='_al_fs_interface_stdio' visibility='default' filepath='include/allegro5/internal/aintern_fshook.h' line='26' column='1' elf-symbol-id='_al_fs_interface_stdio'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/fullscreen_mode.c' comp-dir-path='build' language='LANG_C11'>
