<abi-corpus version='2.2' path='build/lib/liballegro_primitives.so' architecture='elf-amd-x86_64' soname='liballegro_primitives.so.5.2'>
  <elf-needed>
    <dependency name='liballegro.so.5.2'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_al_prim_are_points_equal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_prim_cache_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_prim_cache_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_prim_cache_init_ex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_prim_cache_push_point' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_prim_cache_push_triangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_prim_cache_term' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_prim_get_scale' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='al_destroy_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_destroy_vertex_decl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_arc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_circle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_ellipse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_elliptical_arc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_circle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_ellipse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_pieslice' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_polygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_polygon_with_holes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_rounded_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_triangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_indexed_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_indexed_prim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_line' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_pieslice' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_polygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_polyline' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_prim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_ribbon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_rounded_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_soft_line' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_soft_triangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_spline' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_triangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_allegro_primitives_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_index_buffer_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_vertex_buffer_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_init_primitives_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_primitives_addon_initialized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_lock_index_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_lock_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_shutdown_primitives_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_triangulate_polygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_unlock_index_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_unlock_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='addons/primitives/high_primitives.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <type-decl name='float' size-in-bits='32' id='type-id-1'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <class-decl name='ALLEGRO_COLOR' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/color.h' line='15' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='g' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='a' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_COLOR' type-id='type-id-3' filepath='include/allegro5/color.h' line='13' column='1' id='type-id-4'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-7'/>
    <function-decl name='al_draw_line' mangled-name='al_draw_line' filepath='addons/primitives/high_primitives.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_line'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='82' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='82' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_triangle' mangled-name='al_draw_triangle' filepath='addons/primitives/high_primitives.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_triangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='x3' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <parameter type-id='type-id-1' name='y3' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_triangle' mangled-name='al_draw_filled_triangle' filepath='addons/primitives/high_primitives.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_triangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='327' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='327' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='327' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='327' column='1'/>
      <parameter type-id='type-id-1' name='x3' filepath='addons/primitives/high_primitives.c' line='328' column='1'/>
      <parameter type-id='type-id-1' name='y3' filepath='addons/primitives/high_primitives.c' line='328' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='328' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_rectangle' mangled-name='al_draw_rectangle' filepath='addons/primitives/high_primitives.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='352' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='352' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='352' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='352' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='353' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='353' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_rectangle' mangled-name='al_draw_filled_rectangle' filepath='addons/primitives/high_primitives.c' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='399' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='399' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='399' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='399' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='400' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_calculate_arc' mangled-name='al_calculate_arc' filepath='addons/primitives/high_primitives.c' line='538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_calculate_arc'>
      <parameter type-id='type-id-7' name='dest' filepath='addons/primitives/high_primitives.c' line='538' column='1'/>
      <parameter type-id='type-id-2' name='stride' filepath='addons/primitives/high_primitives.c' line='538' column='1'/>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='538' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='538' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='539' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='539' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='539' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='539' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='539' column='1'/>
      <parameter type-id='type-id-2' name='num_points' filepath='addons/primitives/high_primitives.c' line='540' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_pieslice' mangled-name='al_draw_pieslice' filepath='addons/primitives/high_primitives.c' line='548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_pieslice'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='548' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='548' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='548' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='548' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='549' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='549' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='549' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_pieslice' mangled-name='al_draw_filled_pieslice' filepath='addons/primitives/high_primitives.c' line='733' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_pieslice'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='733' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='733' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='733' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='733' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='734' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='734' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_ellipse' mangled-name='al_draw_ellipse' filepath='addons/primitives/high_primitives.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_ellipse'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='766' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='766' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='766' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='766' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='767' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='767' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_ellipse' mangled-name='al_draw_filled_ellipse' filepath='addons/primitives/high_primitives.c' line='822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_ellipse'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='822' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='822' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='822' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='822' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='823' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_circle' mangled-name='al_draw_circle' filepath='addons/primitives/high_primitives.c' line='859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_circle'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='859' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='859' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='859' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='859' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='860' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_circle' mangled-name='al_draw_filled_circle' filepath='addons/primitives/high_primitives.c' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_circle'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='867' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='867' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='867' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='867' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_elliptical_arc' mangled-name='al_draw_elliptical_arc' filepath='addons/primitives/high_primitives.c' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_elliptical_arc'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='874' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='874' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='874' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='874' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='874' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='875' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='875' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='875' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_arc' mangled-name='al_draw_arc' filepath='addons/primitives/high_primitives.c' line='925' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_arc'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='925' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='925' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='925' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='925' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='926' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='926' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='926' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_rounded_rectangle' mangled-name='al_draw_rounded_rectangle' filepath='addons/primitives/high_primitives.c' line='933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_rounded_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='933' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='933' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='933' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='933' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='934' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='934' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='934' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='934' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_calculate_ribbon' mangled-name='al_calculate_ribbon' filepath='addons/primitives/high_primitives.c' line='1186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_calculate_ribbon'>
      <parameter type-id='type-id-7' name='dest' filepath='addons/primitives/high_primitives.c' line='1186' column='1'/>
      <parameter type-id='type-id-2' name='dest_stride' filepath='addons/primitives/high_primitives.c' line='1186' column='1'/>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1186' column='1'/>
      <parameter type-id='type-id-2' name='points_stride' filepath='addons/primitives/high_primitives.c' line='1187' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1187' column='1'/>
      <parameter type-id='type-id-2' name='num_segments' filepath='addons/primitives/high_primitives.c' line='1187' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_rounded_rectangle' mangled-name='al_draw_filled_rounded_rectangle' filepath='addons/primitives/high_primitives.c' line='1195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_rounded_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='1195' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='1195' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='1195' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='1195' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='1196' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='1196' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='1196' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_calculate_spline' mangled-name='al_calculate_spline' filepath='addons/primitives/high_primitives.c' line='1325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_calculate_spline'>
      <parameter type-id='type-id-7' name='dest' filepath='addons/primitives/high_primitives.c' line='1325' column='1'/>
      <parameter type-id='type-id-2' name='stride' filepath='addons/primitives/high_primitives.c' line='1325' column='1'/>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1325' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1326' column='1'/>
      <parameter type-id='type-id-2' name='num_segments' filepath='addons/primitives/high_primitives.c' line='1326' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_spline' mangled-name='al_draw_spline' filepath='addons/primitives/high_primitives.c' line='1333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_spline'>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1333' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='1333' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1333' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_ribbon' mangled-name='al_draw_ribbon' filepath='addons/primitives/high_primitives.c' line='1377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_ribbon'>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1377' column='1'/>
      <parameter type-id='type-id-2' name='points_stride' filepath='addons/primitives/high_primitives.c' line='1377' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='1377' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1378' column='1'/>
      <parameter type-id='type-id-2' name='num_segments' filepath='addons/primitives/high_primitives.c' line='1378' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <type-decl name='void' id='type-id-8'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/polygon.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-10'/>
    <function-decl name='al_draw_polygon' mangled-name='al_draw_polygon' filepath='addons/primitives/polygon.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_polygon'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polygon.c' line='45' column='1'/>
      <parameter type-id='type-id-2' name='vertex_count' filepath='addons/primitives/polygon.c' line='45' column='1'/>
      <parameter type-id='type-id-2' name='join_style' filepath='addons/primitives/polygon.c' line='46' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polygon.c' line='46' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/polygon.c' line='46' column='1'/>
      <parameter type-id='type-id-1' name='miter_limit' filepath='addons/primitives/polygon.c' line='46' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_polygon' mangled-name='al_draw_filled_polygon' filepath='addons/primitives/polygon.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_polygon'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polygon.c' line='54' column='1'/>
      <parameter type-id='type-id-2' name='vertex_count' filepath='addons/primitives/polygon.c' line='54' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polygon.c' line='55' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_polygon_with_holes' mangled-name='al_draw_filled_polygon_with_holes' filepath='addons/primitives/polygon.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_polygon_with_holes'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polygon.c' line='72' column='1'/>
      <parameter type-id='type-id-10' name='vertex_counts' filepath='addons/primitives/polygon.c' line='73' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polygon.c' line='73' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/polyline.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <function-decl name='al_draw_polyline' mangled-name='al_draw_polyline' filepath='addons/primitives/polyline.c' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_polyline'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polyline.c' line='535' column='1'/>
      <parameter type-id='type-id-2' name='vertex_stride' filepath='addons/primitives/polyline.c' line='535' column='1'/>
      <parameter type-id='type-id-2' name='vertex_count' filepath='addons/primitives/polyline.c' line='536' column='1'/>
      <parameter type-id='type-id-2' name='join_style' filepath='addons/primitives/polyline.c' line='536' column='1'/>
      <parameter type-id='type-id-2' name='cap_style' filepath='addons/primitives/polyline.c' line='536' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polyline.c' line='537' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/polyline.c' line='537' column='1'/>
      <parameter type-id='type-id-1' name='miter_limit' filepath='addons/primitives/polyline.c' line='537' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/prim_soft.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <class-decl name='ALLEGRO_VERTEX' size-in-bits='288' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='87' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='v' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='color' type-id='type-id-4' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_VERTEX' type-id='type-id-11' filepath='include/allegro5/internal/aintern_primitives_types.h' line='85' column='1' id='type-id-12'/>
    <typedef-decl name='uintptr_t' type-id='type-id-13' filepath='/usr/include/stdint.h' line='79' column='1' id='type-id-14'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <function-decl name='al_draw_soft_triangle' mangled-name='al_draw_soft_triangle' filepath='addons/primitives/prim_soft.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_soft_triangle'>
      <parameter type-id='type-id-15' name='v1' filepath='addons/primitives/prim_soft.c' line='33' column='1'/>
      <parameter type-id='type-id-15' name='v2' filepath='addons/primitives/prim_soft.c' line='33' column='1'/>
      <parameter type-id='type-id-15' name='v3' filepath='addons/primitives/prim_soft.c' line='33' column='1'/>
      <parameter type-id='type-id-14' name='state' filepath='addons/primitives/prim_soft.c' line='33' column='1'/>
      <parameter type-id='type-id-17' name='init' filepath='addons/primitives/prim_soft.c' line='34' column='1'/>
      <parameter type-id='type-id-27' name='first' filepath='addons/primitives/prim_soft.c' line='35' column='1'/>
      <parameter type-id='type-id-19' name='step' filepath='addons/primitives/prim_soft.c' line='36' column='1'/>
      <parameter type-id='type-id-25' name='draw' filepath='addons/primitives/prim_soft.c' line='37' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_soft_line' mangled-name='al_draw_soft_line' filepath='addons/primitives/prim_soft.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_soft_line'>
      <parameter type-id='type-id-15' name='v1' filepath='addons/primitives/prim_soft.c' line='44' column='1'/>
      <parameter type-id='type-id-15' name='v2' filepath='addons/primitives/prim_soft.c' line='44' column='1'/>
      <parameter type-id='type-id-14' name='state' filepath='addons/primitives/prim_soft.c' line='44' column='1'/>
      <parameter type-id='type-id-23' name='first' filepath='addons/primitives/prim_soft.c' line='45' column='1'/>
      <parameter type-id='type-id-19' name='step' filepath='addons/primitives/prim_soft.c' line='46' column='1'/>
      <parameter type-id='type-id-21' name='draw' filepath='addons/primitives/prim_soft.c' line='47' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-16'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-18'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-20'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-22'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-24'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-26'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/prim_util.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='73728' id='type-id-28'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-13' id='type-id-29'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='type-id-30'/>
    <class-decl name='ALLEGRO_PRIM_VERTEX_CACHE' size-in-bits='74112' is-struct='yes' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='16' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-28' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='73728'>
        <var-decl name='current' type-id='type-id-15' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='73792'>
        <var-decl name='size' type-id='type-id-32' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='73856'>
        <var-decl name='color' type-id='type-id-4' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='73984'>
        <var-decl name='prim_type' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='74048'>
        <var-decl name='user_data' type-id='type-id-33' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_PRIM_VERTEX_CACHE' type-id='type-id-31' filepath='addons/primitives/allegro5/internal/aintern_prim_addon.h' line='23' column='1' id='type-id-34'/>
    <typedef-decl name='size_t' type-id='type-id-13' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-32'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <function-decl name='_al_prim_get_scale' mangled-name='_al_prim_get_scale' filepath='addons/primitives/prim_util.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_get_scale'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_prim_normalize' mangled-name='_al_prim_normalize' filepath='addons/primitives/prim_util.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_normalize'>
      <parameter type-id='type-id-7' name='vector' filepath='addons/primitives/prim_util.c' line='47' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_prim_test_line_side' mangled-name='_al_prim_test_line_side' filepath='addons/primitives/prim_util.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_test_line_side'>
      <parameter type-id='type-id-6' name='origin' filepath='addons/primitives/prim_util.c' line='69' column='1'/>
      <parameter type-id='type-id-6' name='normal' filepath='addons/primitives/prim_util.c' line='69' column='1'/>
      <parameter type-id='type-id-6' name='point' filepath='addons/primitives/prim_util.c' line='69' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_prim_is_point_in_triangle' mangled-name='_al_prim_is_point_in_triangle' filepath='addons/primitives/prim_util.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_is_point_in_triangle'>
      <parameter type-id='type-id-6' name='point' filepath='addons/primitives/prim_util.c' line='87' column='1'/>
      <parameter type-id='type-id-6' name='v0' filepath='addons/primitives/prim_util.c' line='87' column='1'/>
      <parameter type-id='type-id-6' name='v1' filepath='addons/primitives/prim_util.c' line='87' column='1'/>
      <parameter type-id='type-id-6' name='v2' filepath='addons/primitives/prim_util.c' line='87' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='_al_prim_intersect_segment' mangled-name='_al_prim_intersect_segment' filepath='addons/primitives/prim_util.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_intersect_segment'>
      <parameter type-id='type-id-6' name='v0' filepath='addons/primitives/prim_util.c' line='119' column='1'/>
      <parameter type-id='type-id-6' name='v1' filepath='addons/primitives/prim_util.c' line='119' column='1'/>
      <parameter type-id='type-id-6' name='p0' filepath='addons/primitives/prim_util.c' line='119' column='1'/>
      <parameter type-id='type-id-6' name='p1' filepath='addons/primitives/prim_util.c' line='119' column='1'/>
      <parameter type-id='type-id-7' name='point' filepath='addons/primitives/prim_util.c' line='119' column='1'/>
      <parameter type-id='type-id-7' name='t0' filepath='addons/primitives/prim_util.c' line='119' column='1'/>
      <parameter type-id='type-id-7' name='t1' filepath='addons/primitives/prim_util.c' line='119' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='_al_prim_are_points_equal' mangled-name='_al_prim_are_points_equal' filepath='addons/primitives/prim_util.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_are_points_equal'>
      <parameter type-id='type-id-6' name='point_a' filepath='addons/primitives/prim_util.c' line='157' column='1'/>
      <parameter type-id='type-id-6' name='point_b' filepath='addons/primitives/prim_util.c' line='157' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='_al_prim_cache_init' mangled-name='_al_prim_cache_init' filepath='addons/primitives/prim_util.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_cache_init'>
      <parameter type-id='type-id-35' name='cache' filepath='addons/primitives/prim_util.c' line='167' column='1'/>
      <parameter type-id='type-id-2' name='prim_type' filepath='addons/primitives/prim_util.c' line='167' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/prim_util.c' line='167' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_prim_cache_init_ex' mangled-name='_al_prim_cache_init_ex' filepath='addons/primitives/prim_util.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_cache_init_ex'>
      <parameter type-id='type-id-35' name='cache' filepath='addons/primitives/prim_util.c' line='172' column='1'/>
      <parameter type-id='type-id-2' name='prim_type' filepath='addons/primitives/prim_util.c' line='172' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/prim_util.c' line='172' column='1'/>
      <parameter type-id='type-id-33' name='user_data' filepath='addons/primitives/prim_util.c' line='172' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_prim_cache_term' mangled-name='_al_prim_cache_term' filepath='addons/primitives/prim_util.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_cache_term'>
      <parameter type-id='type-id-35' name='cache' filepath='addons/primitives/prim_util.c' line='181' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_prim_cache_flush' mangled-name='_al_prim_cache_flush' filepath='addons/primitives/prim_util.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_cache_flush'>
      <parameter type-id='type-id-35' name='cache' filepath='addons/primitives/prim_util.c' line='186' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_prim_cache_push_triangle' mangled-name='_al_prim_cache_push_triangle' filepath='addons/primitives/prim_util.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_cache_push_triangle'>
      <parameter type-id='type-id-35' name='cache' filepath='addons/primitives/prim_util.c' line='209' column='1'/>
      <parameter type-id='type-id-6' name='v0' filepath='addons/primitives/prim_util.c' line='209' column='1'/>
      <parameter type-id='type-id-6' name='v1' filepath='addons/primitives/prim_util.c' line='209' column='1'/>
      <parameter type-id='type-id-6' name='v2' filepath='addons/primitives/prim_util.c' line='209' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_prim_cache_push_point' mangled-name='_al_prim_cache_push_point' filepath='addons/primitives/prim_util.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_prim_cache_push_point'>
      <parameter type-id='type-id-35' name='cache' filepath='addons/primitives/prim_util.c' line='240' column='1'/>
      <parameter type-id='type-id-6' name='v' filepath='addons/primitives/prim_util.c' line='240' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-8' id='type-id-33'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/primitives.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <enum-decl name='ALLEGRO_BITMAP_WRAP' filepath='include/allegro5/bitmap.h' line='17' column='1' id='type-id-36'>
      <underlying-type type-id='type-id-37'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_DEFAULT' value='0'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_REPEAT' value='1'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_CLAMP' value='2'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_MIRROR' value='3'/>
    </enum-decl>
    <array-type-def dimensions='2' type-id='type-id-1' size-in-bits='512' id='type-id-38'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-13' id='type-id-39'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-13' id='type-id-39'/>
    </array-type-def>
    <class-decl name='ALLEGRO_BITMAP' size-in-bits='3456' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='28' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vt' type-id='type-id-41' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_depth' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_samples' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_display' type-id='type-id-42' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_wrap_u' type-id='type-id-43' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_wrap_v' type-id='type-id-43' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_memory_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pitch' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cr_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ct' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cb_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='locked' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lock_x' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lock_y' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='lock_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lock_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lock_data' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lock_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='locked_region' type-id='type-id-44' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='transform' type-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='inverse_transform' type-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='inverse_transform_dirty' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='proj_transform' type-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='use_bitmap_blender' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='blender' type-id='type-id-46' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='shader' type-id='type-id-47' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='parent' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='xofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='yofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='memory' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='extra' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dtor_item' type-id='type-id-50' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dirty' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BITMAP_INTERFACE' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='124' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='draw_bitmap_region' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='upload_bitmap' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='update_clipping_rectangle' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='destroy_bitmap' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_region' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unlock_region' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lock_compressed_region' type-id='type-id-56' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlock_compressed_region' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bitmap_pointer_changed' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backup_dirty_bitmap' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BLENDER' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='15' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blend_op' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='blend_source' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blend_dest' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blend_alpha_op' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blend_alpha_source' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='blend_alpha_dest' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='blend_color' type-id='type-id-4' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_INDEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='40' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index_size' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-60' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_LOCKED_REGION' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='24' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-33' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pitch' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pixel_size' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TRANSFORM' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/allegro5/transformations.h' line='14' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-38' visibility='default' filepath='include/allegro5/transformations.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='35' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decl' type-id='type-id-64' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-60' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_DECL' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='13' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elements' type-id='type-id-66' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stride' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d3d_decl' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d3d_dummy_shader' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_ELEMENT' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='73' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attribute' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='storage' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_BUFFER_COMMON' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='20' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-14' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_only' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_locked' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='lock_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locked_memory' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='local_buffer_length' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='lock_offset' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_length' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-40' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-69'/>
    <typedef-decl name='ALLEGRO_BITMAP_INTERFACE' type-id='type-id-51' filepath='include/allegro5/internal/aintern_bitmap.h' line='26' column='1' id='type-id-70'/>
    <typedef-decl name='ALLEGRO_BITMAP_WRAP' type-id='type-id-36' filepath='include/allegro5/bitmap.h' line='22' column='1' id='type-id-43'/>
    <typedef-decl name='ALLEGRO_BLENDER' type-id='type-id-58' filepath='include/allegro5/internal/aintern_bitmap.h' line='24' column='1' id='type-id-46'/>
    <typedef-decl name='ALLEGRO_INDEX_BUFFER' type-id='type-id-59' filepath='include/allegro5/internal/aintern_primitives_types.h' line='99' column='1' id='type-id-71'/>
    <typedef-decl name='ALLEGRO_LOCKED_REGION' type-id='type-id-61' filepath='include/allegro5/bitmap_lock.h' line='23' column='1' id='type-id-44'/>
    <typedef-decl name='ALLEGRO_TRANSFORM' type-id='type-id-62' filepath='include/allegro5/transformations.h' line='12' column='1' id='type-id-45'/>
    <typedef-decl name='ALLEGRO_VERTEX_BUFFER' type-id='type-id-63' filepath='include/allegro5/internal/aintern_primitives_types.h' line='95' column='1' id='type-id-72'/>
    <typedef-decl name='ALLEGRO_VERTEX_DECL' type-id='type-id-65' filepath='include/allegro5/internal/aintern_primitives_types.h' line='81' column='1' id='type-id-73'/>
    <typedef-decl name='ALLEGRO_VERTEX_ELEMENT' type-id='type-id-67' filepath='include/allegro5/internal/aintern_primitives_types.h' line='71' column='1' id='type-id-74'/>
    <typedef-decl name='_AL_BUFFER_COMMON' type-id='type-id-68' filepath='include/allegro5/internal/aintern_primitives.h' line='33' column='1' id='type-id-60'/>
    <typedef-decl name='__uint32_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-76'/>
    <typedef-decl name='uint32_t' type-id='type-id-76' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-77'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-37'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-78'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-75'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-53'/>
    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-85'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-87'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-52'/>
