<abi-corpus version='2.2' path='build/lib/liballegro_primitives.so' architecture='elf-amd-x86_64' soname='liballegro_primitives.so.5.2'>
  <elf-needed>
    <dependency name='liballegro.so.5.2'/>
    <dependency name='libOpenGL.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_al_bitmap_region_is_locked' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_create_index_buffer_directx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_create_index_buffer_opengl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_create_vertex_buffer_directx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_create_vertex_buffer_opengl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_destroy_index_buffer_directx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_destroy_index_buffer_opengl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='al_destroy_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_destroy_vertex_decl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_arc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_circle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_ellipse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_elliptical_arc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_circle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_ellipse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_pieslice' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_polygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_polygon_with_holes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_rounded_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_filled_triangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_indexed_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_indexed_prim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_line' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_pieslice' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_polygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_polyline' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_prim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_ribbon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_rounded_rectangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_soft_line' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_soft_triangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_spline' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_triangle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_draw_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_allegro_primitives_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_index_buffer_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_vertex_buffer_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_init_primitives_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_primitives_addon_initialized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_lock_index_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_lock_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_shutdown_primitives_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_triangulate_polygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_unlock_index_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_unlock_vertex_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='addons/primitives/high_primitives.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <type-decl name='float' size-in-bits='32' id='type-id-1'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <class-decl name='ALLEGRO_COLOR' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/color.h' line='15' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='g' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='a' type-id='type-id-1' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_COLOR' type-id='type-id-3' filepath='include/allegro5/color.h' line='13' column='1' id='type-id-4'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-7'/>
    <function-decl name='al_draw_line' mangled-name='al_draw_line' filepath='addons/primitives/high_primitives.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_line'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='81' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='82' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='82' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_triangle' mangled-name='al_draw_triangle' filepath='addons/primitives/high_primitives.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_triangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='126' column='1'/>
      <parameter type-id='type-id-1' name='x3' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <parameter type-id='type-id-1' name='y3' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='127' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_triangle' mangled-name='al_draw_filled_triangle' filepath='addons/primitives/high_primitives.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_triangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='339' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='339' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='339' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='339' column='1'/>
      <parameter type-id='type-id-1' name='x3' filepath='addons/primitives/high_primitives.c' line='340' column='1'/>
      <parameter type-id='type-id-1' name='y3' filepath='addons/primitives/high_primitives.c' line='340' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='340' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_rectangle' mangled-name='al_draw_rectangle' filepath='addons/primitives/high_primitives.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='361' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='361' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='361' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='361' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='362' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='362' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_rectangle' mangled-name='al_draw_filled_rectangle' filepath='addons/primitives/high_primitives.c' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='406' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='406' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='406' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='406' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='407' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_calculate_arc' mangled-name='al_calculate_arc' filepath='addons/primitives/high_primitives.c' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_calculate_arc'>
      <parameter type-id='type-id-7' name='dest' filepath='addons/primitives/high_primitives.c' line='427' column='1'/>
      <parameter type-id='type-id-2' name='stride' filepath='addons/primitives/high_primitives.c' line='427' column='1'/>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='427' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='427' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='428' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='428' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='428' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='428' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='428' column='1'/>
      <parameter type-id='type-id-2' name='num_points' filepath='addons/primitives/high_primitives.c' line='429' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_pieslice' mangled-name='al_draw_pieslice' filepath='addons/primitives/high_primitives.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_pieslice'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='508' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='508' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='508' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='508' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='509' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='509' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='509' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_pieslice' mangled-name='al_draw_filled_pieslice' filepath='addons/primitives/high_primitives.c' line='664' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_pieslice'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='664' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='664' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='664' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='664' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='665' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='665' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_ellipse' mangled-name='al_draw_ellipse' filepath='addons/primitives/high_primitives.c' line='695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_ellipse'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='695' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='695' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='695' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='695' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='696' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='696' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_ellipse' mangled-name='al_draw_filled_ellipse' filepath='addons/primitives/high_primitives.c' line='747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_ellipse'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='747' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='747' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='747' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='747' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='748' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_circle' mangled-name='al_draw_circle' filepath='addons/primitives/high_primitives.c' line='782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_circle'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='782' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='782' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='782' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='782' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='783' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_circle' mangled-name='al_draw_filled_circle' filepath='addons/primitives/high_primitives.c' line='790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_circle'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='790' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='790' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='790' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='790' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_elliptical_arc' mangled-name='al_draw_elliptical_arc' filepath='addons/primitives/high_primitives.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_elliptical_arc'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='797' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='797' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='797' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='797' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='797' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='798' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='798' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='798' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_arc' mangled-name='al_draw_arc' filepath='addons/primitives/high_primitives.c' line='847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_arc'>
      <parameter type-id='type-id-1' name='cx' filepath='addons/primitives/high_primitives.c' line='847' column='1'/>
      <parameter type-id='type-id-1' name='cy' filepath='addons/primitives/high_primitives.c' line='847' column='1'/>
      <parameter type-id='type-id-1' name='r' filepath='addons/primitives/high_primitives.c' line='847' column='1'/>
      <parameter type-id='type-id-1' name='start_theta' filepath='addons/primitives/high_primitives.c' line='847' column='1'/>
      <parameter type-id='type-id-1' name='delta_theta' filepath='addons/primitives/high_primitives.c' line='848' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='848' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='848' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_rounded_rectangle' mangled-name='al_draw_rounded_rectangle' filepath='addons/primitives/high_primitives.c' line='855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_rounded_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='855' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='855' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='855' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='855' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='856' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='856' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='856' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='856' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_rounded_rectangle' mangled-name='al_draw_filled_rounded_rectangle' filepath='addons/primitives/high_primitives.c' line='953' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_rounded_rectangle'>
      <parameter type-id='type-id-1' name='x1' filepath='addons/primitives/high_primitives.c' line='953' column='1'/>
      <parameter type-id='type-id-1' name='y1' filepath='addons/primitives/high_primitives.c' line='953' column='1'/>
      <parameter type-id='type-id-1' name='x2' filepath='addons/primitives/high_primitives.c' line='953' column='1'/>
      <parameter type-id='type-id-1' name='y2' filepath='addons/primitives/high_primitives.c' line='953' column='1'/>
      <parameter type-id='type-id-1' name='rx' filepath='addons/primitives/high_primitives.c' line='954' column='1'/>
      <parameter type-id='type-id-1' name='ry' filepath='addons/primitives/high_primitives.c' line='954' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='954' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_calculate_spline' mangled-name='al_calculate_spline' filepath='addons/primitives/high_primitives.c' line='1004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_calculate_spline'>
      <parameter type-id='type-id-7' name='dest' filepath='addons/primitives/high_primitives.c' line='1004' column='1'/>
      <parameter type-id='type-id-2' name='stride' filepath='addons/primitives/high_primitives.c' line='1004' column='1'/>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1004' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1005' column='1'/>
      <parameter type-id='type-id-2' name='num_segments' filepath='addons/primitives/high_primitives.c' line='1005' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_spline' mangled-name='al_draw_spline' filepath='addons/primitives/high_primitives.c' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_spline'>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1083' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='1083' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1083' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_calculate_ribbon' mangled-name='al_calculate_ribbon' filepath='addons/primitives/high_primitives.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_calculate_ribbon'>
      <parameter type-id='type-id-7' name='dest' filepath='addons/primitives/high_primitives.c' line='1127' column='1'/>
      <parameter type-id='type-id-2' name='dest_stride' filepath='addons/primitives/high_primitives.c' line='1127' column='1'/>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1127' column='1'/>
      <parameter type-id='type-id-2' name='points_stride' filepath='addons/primitives/high_primitives.c' line='1128' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1128' column='1'/>
      <parameter type-id='type-id-2' name='num_segments' filepath='addons/primitives/high_primitives.c' line='1128' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_ribbon' mangled-name='al_draw_ribbon' filepath='addons/primitives/high_primitives.c' line='1249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_ribbon'>
      <parameter type-id='type-id-6' name='points' filepath='addons/primitives/high_primitives.c' line='1249' column='1'/>
      <parameter type-id='type-id-2' name='points_stride' filepath='addons/primitives/high_primitives.c' line='1249' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/high_primitives.c' line='1249' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/high_primitives.c' line='1250' column='1'/>
      <parameter type-id='type-id-2' name='num_segments' filepath='addons/primitives/high_primitives.c' line='1250' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <type-decl name='void' id='type-id-8'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/line_soft.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='type-id-9'/>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <enum-decl name='ALLEGRO_BITMAP_WRAP' filepath='include/allegro5/bitmap.h' line='17' column='1' id='type-id-11'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_DEFAULT' value='0'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_REPEAT' value='1'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_CLAMP' value='2'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_MIRROR' value='3'/>
    </enum-decl>
    <enum-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' filepath='include/allegro5/mouse_cursor.h' line='12' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_NONE' value='0'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_DEFAULT' value='1'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ARROW' value='2'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_BUSY' value='3'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_QUESTION' value='4'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_EDIT' value='5'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_MOVE' value='6'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_N' value='7'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_W' value='8'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_S' value='9'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_E' value='10'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NW' value='11'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SW' value='12'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SE' value='13'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NE' value='14'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PROGRESS' value='15'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PRECISION' value='16'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_LINK' value='17'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ALT_SELECT' value='18'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_UNAVAILABLE' value='19'/>
      <enumerator name='ALLEGRO_NUM_SYSTEM_MOUSE_CURSORS' value='20'/>
    </enum-decl>
    <array-type-def dimensions='2' type-id='type-id-1' size-in-bits='512' id='type-id-14'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-15' id='type-id-16'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-15' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='1024' id='type-id-17'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-15' id='type-id-18'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='1152' id='type-id-19'>
      <subrange length='36' lower-bound='0' upper-bound='35' type-id='type-id-15' id='type-id-20'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <class-decl name='ALLEGRO_BITMAP' size-in-bits='3456' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='18' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vt' type-id='type-id-23' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_depth' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_samples' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_display' type-id='type-id-24' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_wrap_u' type-id='type-id-25' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_wrap_v' type-id='type-id-25' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_memory_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pitch' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cr_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ct' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cb_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='locked' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lock_x' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lock_y' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='lock_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lock_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lock_data' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lock_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='locked_region' type-id='type-id-27' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='inverse_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='inverse_transform_dirty' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='proj_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='use_bitmap_blender' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='blender' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='shader' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='parent' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='xofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='yofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='memory' type-id='type-id-32' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='extra' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dtor_item' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dirty' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BITMAP_INTERFACE' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='114' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='draw_bitmap_region' type-id='type-id-35' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='upload_bitmap' type-id='type-id-36' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='update_clipping_rectangle' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='destroy_bitmap' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_region' type-id='type-id-38' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unlock_region' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lock_compressed_region' type-id='type-id-39' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlock_compressed_region' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bitmap_pointer_changed' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backup_dirty_bitmap' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BLENDER' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='92' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blend_op' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='blend_source' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blend_dest' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blend_alpha_op' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blend_alpha_source' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='blend_alpha_dest' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='blend_color' type-id='type-id-4' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY' size-in-bits='5056' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='124' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-43' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='vt' type-id='type-id-44' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='refresh_rate' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='min_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='min_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='max_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='backbuffer_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='extra_settings' type-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ogl_extras' type-id='type-id-46' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='bitmaps' type-id='type-id-47' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='num_cache_vertices' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='cache_enabled' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='vertex_cache_size' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='vertex_cache' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='cache_texture' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='cur_blender' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='default_shader' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='projview_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='render_state' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='display_invalidated_callbacks' type-id='type-id-47' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='display_validated_callbacks' type-id='type-id-47' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='use_constraints' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY_INTERFACE' size-in-bits='2944' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='16' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='create_display' type-id='type-id-51' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy_display' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_current_display' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unset_current_display' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='draw_pixel' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flip_display' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='update_display_region' type-id='type-id-56' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='acknowledge_resize' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='resize_display' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='quick_size' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_orientation' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='create_bitmap' type-id='type-id-59' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_target_bitmap' type-id='type-id-60' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get_backbuffer' type-id='type-id-61' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_compatible_bitmap' type-id='type-id-62' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='switch_out' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='switch_in' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='draw_memory_bitmap_region' type-id='type-id-63' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='wait_for_vsync' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='set_mouse_cursor' type-id='type-id-64' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='set_system_mouse_cursor' type-id='type-id-65' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='show_mouse_cursor' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='hide_mouse_cursor' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='set_icons' type-id='type-id-66' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='set_window_position' type-id='type-id-67' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='get_window_position' type-id='type-id-68' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='get_window_borders' type-id='type-id-69' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='set_window_constraints' type-id='type-id-70' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='get_window_constraints' type-id='type-id-69' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='set_display_flag' type-id='type-id-71' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='set_window_title' type-id='type-id-72' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='flush_vertex_cache' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='prepare_vertex_cache' type-id='type-id-73' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='update_transformation' type-id='type-id-60' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='shutdown' type-id='type-id-74' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='acknowledge_drawing_halt' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='acknowledge_drawing_resume' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='set_display_option' type-id='type-id-67' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='clear_depth_buffer' type-id='type-id-75' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='update_render_state' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='get_clipboard_text' type-id='type-id-76' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='set_clipboard_text' type-id='type-id-77' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='has_clipboard_text' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='apply_window_constraints' type-id='type-id-78' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EVENT_SOURCE' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='76' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pad' type-id='type-id-17' visibility='default' filepath='include/allegro5/events.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' size-in-bits='1408' is-struct='yes' naming-typedef-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='114' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='required' type-id='type-id-81' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suggested' type-id='type-id-81' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='settings' type-id='type-id-19' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='info' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='index' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='score' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_LOCKED_REGION' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='24' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pitch' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pixel_size' type-id='type-id-2' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TRANSFORM' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/allegro5/transformations.h' line='14' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-14' visibility='default' filepath='include/allegro5/transformations.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX' size-in-bits='288' is-struct='yes' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='147' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-1' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-1' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z' type-id='type-id-1' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u' type-id='type-id-1' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='v' type-id='type-id-1' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='color' type-id='type-id-4' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ALLEGRO_RENDER_STATE' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='103' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_mask' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='depth_test' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depth_function' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alpha_test' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alpha_function' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='alpha_test_value' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_VECTOR' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='9' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_itemsize' type-id='type-id-87' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_items' type-id='type-id-88' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_size' type-id='type-id-87' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_unused' type-id='type-id-87' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-22' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-89'/>
    <typedef-decl name='ALLEGRO_BITMAP_INTERFACE' type-id='type-id-34' filepath='include/allegro5/internal/aintern_bitmap.h' line='16' column='1' id='type-id-90'/>
    <typedef-decl name='ALLEGRO_BITMAP_WRAP' type-id='type-id-11' filepath='include/allegro5/bitmap.h' line='22' column='1' id='type-id-25'/>
    <typedef-decl name='ALLEGRO_BLENDER' type-id='type-id-41' filepath='include/allegro5/internal/aintern_display.h' line='101' column='1' id='type-id-29'/>
    <typedef-decl name='ALLEGRO_DISPLAY' type-id='type-id-42' filepath='include/allegro5/display.h' line='113' column='1' id='type-id-91'/>
    <typedef-decl name='ALLEGRO_DISPLAY_INTERFACE' type-id='type-id-50' filepath='include/allegro5/internal/aintern_display.h' line='14' column='1' id='type-id-92'/>
    <typedef-decl name='ALLEGRO_EVENT_SOURCE' type-id='type-id-79' filepath='include/allegro5/events.h' line='74' column='1' id='type-id-43'/>
    <typedef-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' type-id='type-id-80' filepath='include/allegro5/internal/aintern_display.h' line='122' column='1' id='type-id-45'/>
    <typedef-decl name='ALLEGRO_LOCKED_REGION' type-id='type-id-82' filepath='include/allegro5/bitmap_lock.h' line='23' column='1' id='type-id-27'/>
    <typedef-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' type-id='type-id-13' filepath='include/allegro5/mouse_cursor.h' line='35' column='1' id='type-id-93'/>
    <typedef-decl name='ALLEGRO_TRANSFORM' type-id='type-id-83' filepath='include/allegro5/transformations.h' line='12' column='1' id='type-id-28'/>
    <typedef-decl name='ALLEGRO_VERTEX' type-id='type-id-84' filepath='addons/primitives/allegro5/allegro_primitives.h' line='145' column='1' id='type-id-94'/>
    <typedef-decl name='_ALLEGRO_RENDER_STATE' type-id='type-id-85' filepath='include/allegro5/internal/aintern_display.h' line='107' column='1' id='type-id-49'/>
    <typedef-decl name='_AL_VECTOR' type-id='type-id-86' filepath='include/allegro5/internal/aintern_vector.h' line='16' column='1' id='type-id-47'/>
    <typedef-decl name='__int64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-95'/>
    <typedef-decl name='int64_t' type-id='type-id-95' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-81'/>
    <typedef-decl name='size_t' type-id='type-id-15' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-87'/>
    <typedef-decl name='uintptr_t' type-id='type-id-15' filepath='/usr/include/stdint.h' line='79' column='1' id='type-id-48'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-12'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-96'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-76'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-118'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-33'/>
    <class-decl name='ALLEGRO_MOUSE_CURSOR' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-149'/>
    <class-decl name='ALLEGRO_OGL_EXTRAS' size-in-bits='4992' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='128' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extension_list' type-id='type-id-150' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='extension_api' type-id='type-id-151' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ogl_info' type-id='type-id-152' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opengl_target' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='backbuffer' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='is_shared' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fbos' type-id='type-id-153' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='program_object' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='varlocs' type-id='type-id-155' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='vao' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='vbo' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_SHADER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-156'/>
    <class-decl name='_AL_LIST_ITEM' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-157'/>
    <function-decl name='_al_line_2d' mangled-name='_al_line_2d' filepath='addons/primitives/line_soft.c' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_line_2d'>
      <parameter type-id='type-id-31' name='texture' filepath='addons/primitives/line_soft.c' line='498' column='1'/>
      <parameter type-id='type-id-106' name='v1' filepath='addons/primitives/line_soft.c' line='498' column='1'/>
      <parameter type-id='type-id-106' name='v2' filepath='addons/primitives/line_soft.c' line='498' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_soft_line' mangled-name='al_draw_soft_line' filepath='addons/primitives/line_soft.c' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_soft_line'>
      <parameter type-id='type-id-106' name='v1' filepath='addons/primitives/line_soft.c' line='571' column='1'/>
      <parameter type-id='type-id-106' name='v2' filepath='addons/primitives/line_soft.c' line='571' column='1'/>
      <parameter type-id='type-id-48' name='state' filepath='addons/primitives/line_soft.c' line='571' column='1'/>
      <parameter type-id='type-id-143' name='first' filepath='addons/primitives/line_soft.c' line='572' column='1'/>
      <parameter type-id='type-id-139' name='step' filepath='addons/primitives/line_soft.c' line='573' column='1'/>
      <parameter type-id='type-id-141' name='draw' filepath='addons/primitives/line_soft.c' line='574' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <typedef-decl name='_AL_LIST_ITEM' type-id='type-id-157' filepath='include/allegro5/internal/aintern_list.h' line='9' column='1' id='type-id-148'/>
    <typedef-decl name='ALLEGRO_MOUSE_CURSOR' type-id='type-id-149' filepath='include/allegro5/mouse_cursor.h' line='10' column='1' id='type-id-145'/>
    <typedef-decl name='ALLEGRO_SHADER' type-id='type-id-156' filepath='include/allegro5/shader.h' line='14' column='1' id='type-id-147'/>
    <pointer-type-def type-id='type-id-8' id='type-id-26'/>
    <function-type size-in-bits='64' id='type-id-97'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-98'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-101'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-103'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-102'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-104'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-102'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-107'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-111'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-116'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-112'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-113'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-117'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-88'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-120'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-122'>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-123'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-124'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-126'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-134'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-140'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-142'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-144'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-26'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/point_soft.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <function-decl name='_al_fix_texcoord' mangled-name='_al_fix_texcoord' filepath='addons/primitives/point_soft.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_fix_texcoord'>
      <parameter type-id='type-id-1' name='var' filepath='addons/primitives/point_soft.c' line='31' column='1'/>
      <parameter type-id='type-id-2' name='max_var' filepath='addons/primitives/point_soft.c' line='31' column='1'/>
      <parameter type-id='type-id-25' name='wrap' filepath='addons/primitives/point_soft.c' line='31' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_point_2d' mangled-name='_al_point_2d' filepath='addons/primitives/point_soft.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_point_2d'>
      <parameter type-id='type-id-31' name='texture' filepath='addons/primitives/point_soft.c' line='61' column='1'/>
      <parameter type-id='type-id-106' name='v' filepath='addons/primitives/point_soft.c' line='61' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/polygon.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <function-decl name='al_draw_polygon' mangled-name='al_draw_polygon' filepath='addons/primitives/polygon.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_polygon'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polygon.c' line='44' column='1'/>
      <parameter type-id='type-id-2' name='vertex_count' filepath='addons/primitives/polygon.c' line='44' column='1'/>
      <parameter type-id='type-id-2' name='join_style' filepath='addons/primitives/polygon.c' line='45' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polygon.c' line='45' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/polygon.c' line='45' column='1'/>
      <parameter type-id='type-id-1' name='miter_limit' filepath='addons/primitives/polygon.c' line='45' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_polygon' mangled-name='al_draw_filled_polygon' filepath='addons/primitives/polygon.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_polygon'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polygon.c' line='53' column='1'/>
      <parameter type-id='type-id-2' name='vertex_count' filepath='addons/primitives/polygon.c' line='53' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polygon.c' line='54' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_draw_filled_polygon_with_holes' mangled-name='al_draw_filled_polygon_with_holes' filepath='addons/primitives/polygon.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_filled_polygon_with_holes'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polygon.c' line='71' column='1'/>
      <parameter type-id='type-id-159' name='vertex_counts' filepath='addons/primitives/polygon.c' line='72' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polygon.c' line='72' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/polyline.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <function-decl name='al_draw_polyline' mangled-name='al_draw_polyline' filepath='addons/primitives/polyline.c' line='534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_draw_polyline'>
      <parameter type-id='type-id-6' name='vertices' filepath='addons/primitives/polyline.c' line='534' column='1'/>
      <parameter type-id='type-id-2' name='vertex_stride' filepath='addons/primitives/polyline.c' line='534' column='1'/>
      <parameter type-id='type-id-2' name='vertex_count' filepath='addons/primitives/polyline.c' line='535' column='1'/>
      <parameter type-id='type-id-2' name='join_style' filepath='addons/primitives/polyline.c' line='535' column='1'/>
      <parameter type-id='type-id-2' name='cap_style' filepath='addons/primitives/polyline.c' line='535' column='1'/>
      <parameter type-id='type-id-4' name='color' filepath='addons/primitives/polyline.c' line='536' column='1'/>
      <parameter type-id='type-id-1' name='thickness' filepath='addons/primitives/polyline.c' line='536' column='1'/>
      <parameter type-id='type-id-1' name='miter_limit' filepath='addons/primitives/polyline.c' line='536' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/prim_directx.cpp' comp-dir-path='build/addons/primitives' language='LANG_C_plus_plus_14'>
    <class-decl name='ALLEGRO_BITMAP' size-in-bits='3456' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='18' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vt' type-id='type-id-23' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_depth' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_samples' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_display' type-id='type-id-24' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_wrap_u' type-id='type-id-25' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_wrap_v' type-id='type-id-25' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_memory_format' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pitch' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cr_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ct' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cb_excl' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='locked' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lock_x' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lock_y' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='lock_w' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lock_h' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lock_data' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lock_flags' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='locked_region' type-id='type-id-27' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='inverse_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='inverse_transform_dirty' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='proj_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='use_bitmap_blender' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='blender' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='shader' type-id='type-id-161' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='parent' type-id='type-id-162' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='xofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='yofs' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='memory' type-id='type-id-32' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='extra' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dtor_item' type-id='type-id-163' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dirty' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BUFFER_COMMON' size-in-bits='384' is-struct='yes' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='30' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-48' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_only' type-id='type-id-9' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_locked' type-id='type-id-9' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='lock_flags' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locked_memory' type-id='type-id-26' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='local_buffer_length' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='lock_offset' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_length' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='45' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decl' type-id='type-id-166' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-167' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_DECL' size-in-bits='256' is-struct='yes' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='14' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elements' type-id='type-id-169' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stride' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d3d_decl' type-id='type-id-26' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d3d_dummy_shader' type-id='type-id-26' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_ELEMENT' size-in-bits='96' is-struct='yes' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='129' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attribute' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='storage' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/allegro_primitives.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-160' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-171'/>
    <typedef-decl name='ALLEGRO_BUFFER_COMMON' type-id='type-id-164' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='43' column='1' id='type-id-167'/>
    <typedef-decl name='ALLEGRO_VERTEX_BUFFER' type-id='type-id-165' filepath='addons/primitives/allegro5/allegro_primitives.h' line='156' column='1' id='type-id-172'/>
    <typedef-decl name='ALLEGRO_VERTEX_DECL' type-id='type-id-168' filepath='addons/primitives/allegro5/allegro_primitives.h' line='137' column='1' id='type-id-173'/>
    <typedef-decl name='ALLEGRO_VERTEX_ELEMENT' type-id='type-id-170' filepath='addons/primitives/allegro5/allegro_primitives.h' line='127' column='1' id='type-id-174'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-177'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-163'/>
    <class-decl name='ALLEGRO_SHADER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-181'/>
    <class-decl name='_AL_LIST_ITEM' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-182'/>
    <function-decl name='_al_init_d3d_driver' mangled-name='_al_init_d3d_driver' filepath='addons/primitives/prim_directx.cpp' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_d3d_driver'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_al_shutdown_d3d_driver' mangled-name='_al_shutdown_d3d_driver' filepath='addons/primitives/prim_directx.cpp' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_shutdown_d3d_driver'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_draw_prim_directx' mangled-name='_al_draw_prim_directx' filepath='addons/primitives/prim_directx.cpp' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_draw_prim_directx'>
      <parameter type-id='type-id-175' name='target' filepath='addons/primitives/prim_directx.cpp' line='652' column='1'/>
      <parameter type-id='type-id-175' name='texture' filepath='addons/primitives/prim_directx.cpp' line='652' column='1'/>
      <parameter type-id='type-id-26' name='vtxs' filepath='addons/primitives/prim_directx.cpp' line='652' column='1'/>
      <parameter type-id='type-id-178' name='decl' filepath='addons/primitives/prim_directx.cpp' line='652' column='1'/>
      <parameter type-id='type-id-2' name='start' filepath='addons/primitives/prim_directx.cpp' line='652' column='1'/>
      <parameter type-id='type-id-2' name='end' filepath='addons/primitives/prim_directx.cpp' line='652' column='1'/>
      <parameter type-id='type-id-2' name='type' filepath='addons/primitives/prim_directx.cpp' line='652' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_draw_prim_indexed_directx' mangled-name='_al_draw_prim_indexed_directx' filepath='addons/primitives/prim_directx.cpp' line='670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_draw_prim_indexed_directx'>
      <parameter type-id='type-id-175' name='target' filepath='addons/primitives/prim_directx.cpp' line='670' column='1'/>
      <parameter type-id='type-id-175' name='texture' filepath='addons/primitives/prim_directx.cpp' line='670' column='1'/>
      <parameter type-id='type-id-26' name='vtxs' filepath='addons/primitives/prim_directx.cpp' line='670' column='1'/>
      <parameter type-id='type-id-178' name='decl' filepath='addons/primitives/prim_directx.cpp' line='670' column='1'/>
      <parameter type-id='type-id-159' name='indices' filepath='addons/primitives/prim_directx.cpp' line='670' column='1'/>
      <parameter type-id='type-id-2' name='num_vtx' filepath='addons/primitives/prim_directx.cpp' line='670' column='1'/>
      <parameter type-id='type-id-2' name='type' filepath='addons/primitives/prim_directx.cpp' line='670' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_draw_vertex_buffer_directx' mangled-name='_al_draw_vertex_buffer_directx' filepath='addons/primitives/prim_directx.cpp' line='842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_draw_vertex_buffer_directx'>
      <parameter type-id='type-id-175' name='target' filepath='addons/primitives/prim_directx.cpp' line='842' column='1'/>
      <parameter type-id='type-id-175' name='texture' filepath='addons/primitives/prim_directx.cpp' line='842' column='1'/>
      <parameter type-id='type-id-176' name='vertex_buffer' filepath='addons/primitives/prim_directx.cpp' line='842' column='1'/>
      <parameter type-id='type-id-2' name='start' filepath='addons/primitives/prim_directx.cpp' line='842' column='1'/>
      <parameter type-id='type-id-2' name='end' filepath='addons/primitives/prim_directx.cpp' line='842' column='1'/>
      <parameter type-id='type-id-2' name='type' filepath='addons/primitives/prim_directx.cpp' line='842' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_al_set_d3d_decl' mangled-name='_al_set_d3d_decl' filepath='addons/primitives/prim_directx.cpp' line='928' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_set_d3d_decl'>
      <parameter type-id='type-id-24' name='display' filepath='addons/primitives/prim_directx.cpp' line='928' column='1'/>
      <parameter type-id='type-id-166' name='ret' filepath='addons/primitives/prim_directx.cpp' line='928' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_create_vertex_buffer_directx' mangled-name='_al_create_vertex_buffer_directx' filepath='addons/primitives/prim_directx.cpp' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_create_vertex_buffer_directx'>
      <parameter type-id='type-id-176' name='buf' filepath='addons/primitives/prim_directx.cpp' line='1011' column='1'/>
      <parameter type-id='type-id-26' name='initial_data' filepath='addons/primitives/prim_directx.cpp' line='1011' column='1'/>
      <parameter type-id='type-id-87' name='num_vertices' filepath='addons/primitives/prim_directx.cpp' line='1011' column='1'/>
      <parameter type-id='type-id-2' name='flags' filepath='addons/primitives/prim_directx.cpp' line='1011' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_al_destroy_vertex_buffer_directx' mangled-name='_al_destroy_vertex_buffer_directx' filepath='addons/primitives/prim_directx.cpp' line='1102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_destroy_vertex_buffer_directx'>
      <parameter type-id='type-id-176' name='buf' filepath='addons/primitives/prim_directx.cpp' line='1102' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_al_lock_vertex_buffer_directx' mangled-name='_al_lock_vertex_buffer_directx' filepath='addons/primitives/prim_directx.cpp' line='1120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_lock_vertex_buffer_directx'>
      <parameter type-id='type-id-176' name='buf' filepath='addons/primitives/prim_directx.cpp' line='1120' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <typedef-decl name='_AL_LIST_ITEM' type-id='type-id-182' filepath='include/allegro5/internal/aintern_list.h' line='9' column='1' id='type-id-180'/>
    <typedef-decl name='ALLEGRO_SHADER' type-id='type-id-181' filepath='include/allegro5/shader.h' line='14' column='1' id='type-id-179'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/primitives/prim_opengl.c' comp-dir-path='build/addons/primitives' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-183' size-in-bits='3584' id='type-id-153'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-15' id='type-id-184'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-185' size-in-bits='320' id='type-id-186'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-15' id='type-id-187'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='640' id='type-id-188'>
      <subrange length='80' lower-bound='0' upper-bound='79' type-id='type-id-15' id='type-id-189'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-190'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-191'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-192'/>
    <class-decl name='ALLEGRO_FBO_BUFFERS' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='39' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='depth_buffer' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dw' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dh' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='depth' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='multisample_buffer' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mw' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mh' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='samples' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_FBO_INFO' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='61' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fbo_state' type-id='type-id-2' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fbo' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buffers' type-id='type-id-195' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='owner' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_use_time' type-id='type-id-190' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_INDEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='50' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index_size' type-id='type-id-2' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-167' visibility='default' filepath='addons/primitives/allegro5/internal/aintern_prim.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_OGL_EXTRAS' size-in-bits='4992' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='128' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extension_list' type-id='type-id-150' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='extension_api' type-id='type-id-151' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ogl_info' type-id='type-id-152' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opengl_target' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='backbuffer' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='is_shared' type-id='type-id-9' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fbos' type-id='type-id-153' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='program_object' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='varlocs' type-id='type-id-155' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='vao' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='vbo' type-id='type-id-154' visibility='default' filepath='include/allegro5/internal/aintern_opengl.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_OGL_EXT_API' size-in-bits='117184' is-struct='yes' visibility='default' filepath='include/allegro5/opengl/gl_ext.h' line='123' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='BlendFuncSeparate' type-id='type-id-198' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='FogCoordf' type-id='type-id-199' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='FogCoordfv' type-id='type-id-200' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='FogCoordd' type-id='type-id-201' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='FogCoorddv' type-id='type-id-202' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='FogCoordPointer' type-id='type-id-203' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='MultiDrawArrays' type-id='type-id-204' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='MultiDrawElements' type-id='type-id-205' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='PointParameterf' type-id='type-id-206' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='PointParameterfv' type-id='type-id-207' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PointParameteri' type-id='type-id-208' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='PointParameteriv' type-id='type-id-209' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='SecondaryColor3b' type-id='type-id-210' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='SecondaryColor3bv' type-id='type-id-211' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='SecondaryColor3d' type-id='type-id-212' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='SecondaryColor3dv' type-id='type-id-213' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='SecondaryColor3f' type-id='type-id-214' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='SecondaryColor3fv' type-id='type-id-215' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='SecondaryColor3i' type-id='type-id-216' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='SecondaryColor3iv' type-id='type-id-217' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='SecondaryColor3s' type-id='type-id-218' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='SecondaryColor3sv' type-id='type-id-219' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='SecondaryColor3ub' type-id='type-id-220' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='SecondaryColor3ubv' type-id='type-id-221' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='SecondaryColor3ui' type-id='type-id-222' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='SecondaryColor3uiv' type-id='type-id-223' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='SecondaryColor3us' type-id='type-id-224' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='SecondaryColor3usv' type-id='type-id-225' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='SecondaryColorPointer' type-id='type-id-226' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='WindowPos2d' type-id='type-id-227' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='WindowPos2dv' type-id='type-id-228' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='WindowPos2f' type-id='type-id-229' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='WindowPos2fv' type-id='type-id-230' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='WindowPos2i' type-id='type-id-231' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='WindowPos2iv' type-id='type-id-232' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='WindowPos2s' type-id='type-id-233' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='WindowPos2sv' type-id='type-id-234' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='WindowPos3d' type-id='type-id-235' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='WindowPos3dv' type-id='type-id-236' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='WindowPos3f' type-id='type-id-237' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='WindowPos3fv' type-id='type-id-238' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='WindowPos3i' type-id='type-id-239' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='WindowPos3iv' type-id='type-id-240' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='WindowPos3s' type-id='type-id-241' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='WindowPos3sv' type-id='type-id-242' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='BindBuffer' type-id='type-id-243' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='DeleteBuffers' type-id='type-id-244' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='GenBuffers' type-id='type-id-245' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='IsBuffer' type-id='type-id-246' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='BufferData' type-id='type-id-247' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='BufferSubData' type-id='type-id-248' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GetBufferSubData' type-id='type-id-249' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='MapBuffer' type-id='type-id-250' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='UnmapBuffer' type-id='type-id-251' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='GetBufferParameteriv' type-id='type-id-252' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='GetBufferPointerv' type-id='type-id-253' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='GenQueries' type-id='type-id-254' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='DeleteQueries' type-id='type-id-255' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='IsQuery' type-id='type-id-256' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='BeginQuery' type-id='type-id-257' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='EndQuery' type-id='type-id-258' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='GetQueryiv' type-id='type-id-259' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='GetQueryObjectiv' type-id='type-id-260' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='GetQueryObjectuiv' type-id='type-id-261' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='BlendEquationSeparate' type-id='type-id-262' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='CreateProgram' type-id='type-id-263' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='CreateShader' type-id='type-id-264' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='DeleteProgram' type-id='type-id-265' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='DeleteShader' type-id='type-id-266' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='AttachShader' type-id='type-id-267' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='DetachShader' type-id='type-id-268' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='ShaderSource' type-id='type-id-269' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='CompileShader' type-id='type-id-270' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='IsProgram' type-id='type-id-271' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='IsShader' type-id='type-id-272' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='LinkProgram' type-id='type-id-273' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='UseProgram' type-id='type-id-274' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='ValidateProgram' type-id='type-id-275' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='Uniform1f' type-id='type-id-276' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='Uniform2f' type-id='type-id-277' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='Uniform3f' type-id='type-id-278' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='Uniform4f' type-id='type-id-279' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='Uniform1i' type-id='type-id-280' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='Uniform2i' type-id='type-id-281' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='Uniform3i' type-id='type-id-282' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='Uniform4i' type-id='type-id-283' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='Uniform1fv' type-id='type-id-284' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='Uniform2fv' type-id='type-id-285' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='Uniform3fv' type-id='type-id-286' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='Uniform4fv' type-id='type-id-287' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='Uniform1iv' type-id='type-id-288' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='Uniform2iv' type-id='type-id-289' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='Uniform3iv' type-id='type-id-290' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='Uniform4iv' type-id='type-id-291' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='UniformMatrix2fv' type-id='type-id-292' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='UniformMatrix3fv' type-id='type-id-293' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='UniformMatrix4fv' type-id='type-id-294' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='GetShaderfv' type-id='type-id-295' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='GetShaderiv' type-id='type-id-296' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='GetProgramfv' type-id='type-id-297' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='GetProgramiv' type-id='type-id-298' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='GetShaderInfoLog' type-id='type-id-299' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='GetProgramInfoLog' type-id='type-id-300' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='GetAttachedShaders' type-id='type-id-301' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='GetUniformLocation' type-id='type-id-302' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='GetActiveUniform' type-id='type-id-303' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='GetUniformfv' type-id='type-id-304' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='GetUniformiv' type-id='type-id-305' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='GetShaderSource' type-id='type-id-306' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='VertexAttrib1f' type-id='type-id-307' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='VertexAttrib1s' type-id='type-id-308' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='VertexAttrib1d' type-id='type-id-309' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='VertexAttrib2f' type-id='type-id-310' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='VertexAttrib2s' type-id='type-id-311' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='VertexAttrib2d' type-id='type-id-312' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='VertexAttrib3f' type-id='type-id-313' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='VertexAttrib3s' type-id='type-id-314' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='VertexAttrib3d' type-id='type-id-315' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='VertexAttrib4f' type-id='type-id-316' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7616'>
        <var-decl name='VertexAttrib4s' type-id='type-id-317' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='VertexAttrib4d' type-id='type-id-318' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='VertexAttrib4Nub' type-id='type-id-319' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='VertexAttrib1fv' type-id='type-id-320' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='VertexAttrib1sv' type-id='type-id-321' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='VertexAttrib1dv' type-id='type-id-322' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='VertexAttrib2fv' type-id='type-id-323' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='VertexAttrib2sv' type-id='type-id-324' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='VertexAttrib2dv' type-id='type-id-325' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='VertexAttrib3fv' type-id='type-id-326' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='VertexAttrib3sv' type-id='type-id-327' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='VertexAttrib3dv' type-id='type-id-328' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='VertexAttrib4fv' type-id='type-id-329' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='VertexAttrib4sv' type-id='type-id-330' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='VertexAttrib4dv' type-id='type-id-331' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='VertexAttrib4iv' type-id='type-id-332' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='VertexAttrib4bv' type-id='type-id-333' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='VertexAttrib4ubv' type-id='type-id-334' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='VertexAttrib4usv' type-id='type-id-335' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='VertexAttrib4uiv' type-id='type-id-336' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='VertexAttrib4Nbv' type-id='type-id-337' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='VertexAttrib4Nsv' type-id='type-id-338' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9024'>
        <var-decl name='VertexAttrib4Niv' type-id='type-id-339' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='VertexAttrib4Nubv' type-id='type-id-340' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='VertexAttrib4Nusv' type-id='type-id-341' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='VertexAttrib4Nuiv' type-id='type-id-342' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='VertexAttribPointer' type-id='type-id-343' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='EnableVertexAttribArray' type-id='type-id-344' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='DisableVertexAttribArray' type-id='type-id-345' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='BindAttribLocation' type-id='type-id-346' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='GetActiveAttrib' type-id='type-id-347' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='GetAttribLocation' type-id='type-id-348' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='GetVertexAttribdv' type-id='type-id-349' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='GetVertexAttribfv' type-id='type-id-350' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='GetVertexAttribiv' type-id='type-id-351' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9856'>
        <var-decl name='GetVertexAttribPointerv' type-id='type-id-352' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='DrawBuffers' type-id='type-id-353' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='StencilOpSeparate' type-id='type-id-354' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='StencilFuncSeparate' type-id='type-id-355' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='StencilMaskSeparate' type-id='type-id-356' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='UniformMatrix2x3fv' type-id='type-id-357' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='UniformMatrix3x2fv' type-id='type-id-358' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='UniformMatrix2x4fv' type-id='type-id-359' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='UniformMatrix4x2fv' type-id='type-id-360' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10432'>
        <var-decl name='UniformMatrix3x4fv' type-id='type-id-361' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10496'>
        <var-decl name='UniformMatrix4x3fv' type-id='type-id-362' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='ColorMaski' type-id='type-id-363' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='GetBooleani_v' type-id='type-id-364' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='GetIntegeri_v' type-id='type-id-365' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='Enablei' type-id='type-id-366' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='Disablei' type-id='type-id-367' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='IsEnabledi' type-id='type-id-368' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='BeginTransformFeedback' type-id='type-id-369' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='EndTransformFeedback' type-id='type-id-370' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='BindBufferRange' type-id='type-id-371' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='BindBufferBase' type-id='type-id-372' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='TransformFeedbackVaryings' type-id='type-id-373' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='GetTransformFeedbackVarying' type-id='type-id-374' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='ClampColor' type-id='type-id-375' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11392'>
        <var-decl name='BeginConditionalRender' type-id='type-id-376' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11456'>
        <var-decl name='EndConditionalRender' type-id='type-id-377' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='VertexAttribI1i' type-id='type-id-378' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11584'>
        <var-decl name='VertexAttribI2i' type-id='type-id-379' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11648'>
        <var-decl name='VertexAttribI3i' type-id='type-id-380' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11712'>
        <var-decl name='VertexAttribI4i' type-id='type-id-381' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11776'>
        <var-decl name='VertexAttribI1ui' type-id='type-id-382' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11840'>
        <var-decl name='VertexAttribI2ui' type-id='type-id-383' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11904'>
        <var-decl name='VertexAttribI3ui' type-id='type-id-384' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11968'>
        <var-decl name='VertexAttribI4ui' type-id='type-id-385' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12032'>
        <var-decl name='VertexAttribI1iv' type-id='type-id-386' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12096'>
        <var-decl name='VertexAttribI2iv' type-id='type-id-387' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12160'>
        <var-decl name='VertexAttribI3iv' type-id='type-id-388' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12224'>
        <var-decl name='VertexAttribI4iv' type-id='type-id-389' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12288'>
        <var-decl name='VertexAttribI1uiv' type-id='type-id-390' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12352'>
        <var-decl name='VertexAttribI2uiv' type-id='type-id-391' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12416'>
        <var-decl name='VertexAttribI3uiv' type-id='type-id-392' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='VertexAttribI4uiv' type-id='type-id-393' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12544'>
        <var-decl name='VertexAttribI4bv' type-id='type-id-394' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='VertexAttribI4sv' type-id='type-id-395' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12672'>
        <var-decl name='VertexAttribI4ubv' type-id='type-id-396' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12736'>
        <var-decl name='VertexAttribI4usv' type-id='type-id-397' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12800'>
        <var-decl name='VertexAttribIPointer' type-id='type-id-398' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12864'>
        <var-decl name='GetVertexAttribIiv' type-id='type-id-399' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12928'>
        <var-decl name='GetVertexAttribIuiv' type-id='type-id-400' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12992'>
        <var-decl name='GetUniformuiv' type-id='type-id-401' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13056'>
        <var-decl name='BindFragDataLocation' type-id='type-id-402' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13120'>
        <var-decl name='GetFragDataLocation' type-id='type-id-403' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13184'>
        <var-decl name='Uniform1ui' type-id='type-id-404' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13248'>
        <var-decl name='Uniform2ui' type-id='type-id-405' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13312'>
        <var-decl name='Uniform3ui' type-id='type-id-406' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13376'>
        <var-decl name='Uniform4ui' type-id='type-id-407' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13440'>
        <var-decl name='Uniform1uiv' type-id='type-id-408' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13504'>
        <var-decl name='Uniform2uiv' type-id='type-id-409' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13568'>
        <var-decl name='Uniform3uiv' type-id='type-id-410' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13632'>
        <var-decl name='Uniform4uiv' type-id='type-id-411' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13696'>
        <var-decl name='TexParameterIiv' type-id='type-id-412' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13760'>
        <var-decl name='TexParameterIuiv' type-id='type-id-413' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13824'>
        <var-decl name='GetTexParameterIiv' type-id='type-id-414' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13888'>
        <var-decl name='GetTexParameterIuiv' type-id='type-id-415' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13952'>
        <var-decl name='ClearBufferiv' type-id='type-id-416' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14016'>
        <var-decl name='ClearBufferuiv' type-id='type-id-417' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14080'>
        <var-decl name='ClearBufferfv' type-id='type-id-418' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14144'>
        <var-decl name='ClearBufferfi' type-id='type-id-419' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14208'>
        <var-decl name='GetStringi' type-id='type-id-420' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14272'>
        <var-decl name='DrawArraysInstanced' type-id='type-id-421' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='DrawElementsInstanced' type-id='type-id-422' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14400'>
        <var-decl name='TexBuffer' type-id='type-id-423' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14464'>
        <var-decl name='PrimitiveRestartIndex' type-id='type-id-424' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14528'>
        <var-decl name='GetInteger64i_v' type-id='type-id-425' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14592'>
        <var-decl name='GetBufferParameteri64v' type-id='type-id-426' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14656'>
        <var-decl name='ProgramParameteri' type-id='type-id-427' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14720'>
        <var-decl name='FramebufferTexture' type-id='type-id-428' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14784'>
        <var-decl name='ClearBufferData' type-id='type-id-429' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14848'>
        <var-decl name='ClearBufferSubData' type-id='type-id-430' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14912'>
        <var-decl name='DispatchCompute' type-id='type-id-431' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14976'>
        <var-decl name='DispatchComputeIndirect' type-id='type-id-432' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15040'>
        <var-decl name='CopyImageSubData' type-id='type-id-433' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15104'>
        <var-decl name='FramebufferParameteri' type-id='type-id-434' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15168'>
        <var-decl name='GetFramebufferParameteriv' type-id='type-id-435' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15232'>
        <var-decl name='GetInternalformati64v' type-id='type-id-436' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15296'>
        <var-decl name='InvalidateTexSubImage' type-id='type-id-437' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15360'>
        <var-decl name='InvalidateTexImage' type-id='type-id-438' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15424'>
        <var-decl name='InvalidateBufferSubData' type-id='type-id-439' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15488'>
        <var-decl name='InvalidateBufferData' type-id='type-id-440' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15552'>
        <var-decl name='InvalidateFramebuffer' type-id='type-id-441' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15616'>
        <var-decl name='InvalidateSubFramebuffer' type-id='type-id-442' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15680'>
        <var-decl name='MultiDrawArraysIndirect' type-id='type-id-443' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15744'>
        <var-decl name='MultiDrawElementsIndirect' type-id='type-id-444' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15808'>
        <var-decl name='GetProgramInterfaceiv' type-id='type-id-445' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15872'>
        <var-decl name='GetProgramResourceIndex' type-id='type-id-446' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15936'>
        <var-decl name='GetProgramResourceName' type-id='type-id-447' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16000'>
        <var-decl name='GetProgramResourceiv' type-id='type-id-448' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16064'>
        <var-decl name='GetProgramResourceLocation' type-id='type-id-449' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16128'>
        <var-decl name='GetProgramResourceLocationIndex' type-id='type-id-450' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16192'>
        <var-decl name='ShaderStorageBlockBinding' type-id='type-id-451' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16256'>
        <var-decl name='TexBufferRange' type-id='type-id-452' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16320'>
        <var-decl name='TexStorage2DMultisample' type-id='type-id-453' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='TexStorage3DMultisample' type-id='type-id-454' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16448'>
        <var-decl name='TextureView' type-id='type-id-455' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16512'>
        <var-decl name='BindVertexBuffer' type-id='type-id-456' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='VertexAttribFormat' type-id='type-id-457' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16640'>
        <var-decl name='VertexAttribIFormat' type-id='type-id-458' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16704'>
        <var-decl name='VertexAttribLFormat' type-id='type-id-459' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='VertexAttribBinding' type-id='type-id-460' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='VertexBindingDivisor' type-id='type-id-461' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='DebugMessageControl' type-id='type-id-462' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16960'>
        <var-decl name='DebugMessageInsert' type-id='type-id-463' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17024'>
        <var-decl name='DebugMessageCallback' type-id='type-id-464' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17088'>
        <var-decl name='GetDebugMessageLog' type-id='type-id-465' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='PushDebugGroup' type-id='type-id-466' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17216'>
        <var-decl name='PopDebugGroup' type-id='type-id-467' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17280'>
        <var-decl name='ObjectLabel' type-id='type-id-468' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17344'>
        <var-decl name='GetObjectLabel' type-id='type-id-469' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17408'>
        <var-decl name='ObjectPtrLabel' type-id='type-id-470' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='GetObjectPtrLabel' type-id='type-id-471' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='LoadTransposeMatrixfARB' type-id='type-id-472' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17600'>
        <var-decl name='LoadTransposeMatrixdARB' type-id='type-id-473' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17664'>
        <var-decl name='MultTransposeMatrixfARB' type-id='type-id-474' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17728'>
        <var-decl name='MultTransposeMatrixdARB' type-id='type-id-475' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17792'>
        <var-decl name='SampleCoverageARB' type-id='type-id-476' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17856'>
        <var-decl name='CompressedTexImage3DARB' type-id='type-id-477' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17920'>
        <var-decl name='CompressedTexImage2DARB' type-id='type-id-478' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='CompressedTexImage1DARB' type-id='type-id-479' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='CompressedTexSubImage3DARB' type-id='type-id-480' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='CompressedTexSubImage2DARB' type-id='type-id-481' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='CompressedTexSubImage1DARB' type-id='type-id-482' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18240'>
        <var-decl name='GetCompressedTexImageARB' type-id='type-id-483' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18304'>
        <var-decl name='PointParameterfARB' type-id='type-id-484' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18368'>
        <var-decl name='PointParameterfvARB' type-id='type-id-485' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18432'>
        <var-decl name='WeightbvARB' type-id='type-id-486' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18496'>
        <var-decl name='WeightsvARB' type-id='type-id-487' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18560'>
        <var-decl name='WeightivARB' type-id='type-id-488' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18624'>
        <var-decl name='WeightfvARB' type-id='type-id-489' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18688'>
        <var-decl name='WeightdvARB' type-id='type-id-490' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18752'>
        <var-decl name='WeightubvARB' type-id='type-id-491' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18816'>
        <var-decl name='WeightusvARB' type-id='type-id-492' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18880'>
        <var-decl name='WeightuivARB' type-id='type-id-493' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18944'>
        <var-decl name='WeightPointerARB' type-id='type-id-494' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19008'>
        <var-decl name='VertexBlendARB' type-id='type-id-495' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19072'>
        <var-decl name='CurrentPaletteMatrixARB' type-id='type-id-496' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19136'>
        <var-decl name='MatrixIndexubvARB' type-id='type-id-497' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19200'>
        <var-decl name='MatrixIndexusvARB' type-id='type-id-498' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19264'>
        <var-decl name='MatrixIndexuivARB' type-id='type-id-499' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19328'>
        <var-decl name='MatrixIndexPointerARB' type-id='type-id-500' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19392'>
        <var-decl name='WindowPos2dARB' type-id='type-id-501' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19456'>
        <var-decl name='WindowPos2dvARB' type-id='type-id-502' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19520'>
        <var-decl name='WindowPos2fARB' type-id='type-id-503' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19584'>
        <var-decl name='WindowPos2fvARB' type-id='type-id-504' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19648'>
        <var-decl name='WindowPos2iARB' type-id='type-id-505' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19712'>
        <var-decl name='WindowPos2ivARB' type-id='type-id-506' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19776'>
        <var-decl name='WindowPos2sARB' type-id='type-id-507' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19840'>
        <var-decl name='WindowPos2svARB' type-id='type-id-508' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19904'>
        <var-decl name='WindowPos3dARB' type-id='type-id-509' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19968'>
        <var-decl name='WindowPos3dvARB' type-id='type-id-510' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20032'>
        <var-decl name='WindowPos3fARB' type-id='type-id-511' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20096'>
        <var-decl name='WindowPos3fvARB' type-id='type-id-512' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20160'>
        <var-decl name='WindowPos3iARB' type-id='type-id-513' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20224'>
        <var-decl name='WindowPos3ivARB' type-id='type-id-514' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20288'>
        <var-decl name='WindowPos3sARB' type-id='type-id-515' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20352'>
        <var-decl name='WindowPos3svARB' type-id='type-id-516' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20416'>
        <var-decl name='VertexAttrib1dARB' type-id='type-id-517' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20480'>
        <var-decl name='VertexAttrib1dvARB' type-id='type-id-518' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20544'>
        <var-decl name='VertexAttrib1fARB' type-id='type-id-519' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20608'>
        <var-decl name='VertexAttrib1fvARB' type-id='type-id-520' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20672'>
        <var-decl name='VertexAttrib1sARB' type-id='type-id-521' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20736'>
        <var-decl name='VertexAttrib1svARB' type-id='type-id-522' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20800'>
        <var-decl name='VertexAttrib2dARB' type-id='type-id-523' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20864'>
        <var-decl name='VertexAttrib2dvARB' type-id='type-id-524' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20928'>
        <var-decl name='VertexAttrib2fARB' type-id='type-id-525' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20992'>
        <var-decl name='VertexAttrib2fvARB' type-id='type-id-526' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21056'>
        <var-decl name='VertexAttrib2sARB' type-id='type-id-527' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21120'>
        <var-decl name='VertexAttrib2svARB' type-id='type-id-528' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21184'>
        <var-decl name='VertexAttrib3dARB' type-id='type-id-529' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21248'>
        <var-decl name='VertexAttrib3dvARB' type-id='type-id-530' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21312'>
        <var-decl name='VertexAttrib3fARB' type-id='type-id-531' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21376'>
        <var-decl name='VertexAttrib3fvARB' type-id='type-id-532' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21440'>
        <var-decl name='VertexAttrib3sARB' type-id='type-id-533' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21504'>
        <var-decl name='VertexAttrib3svARB' type-id='type-id-534' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21568'>
        <var-decl name='VertexAttrib4NbvARB' type-id='type-id-535' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21632'>
        <var-decl name='VertexAttrib4NivARB' type-id='type-id-536' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21696'>
        <var-decl name='VertexAttrib4NsvARB' type-id='type-id-537' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21760'>
        <var-decl name='VertexAttrib4NubARB' type-id='type-id-538' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21824'>
        <var-decl name='VertexAttrib4NubvARB' type-id='type-id-539' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21888'>
        <var-decl name='VertexAttrib4NuivARB' type-id='type-id-540' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21952'>
        <var-decl name='VertexAttrib4NusvARB' type-id='type-id-541' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22016'>
        <var-decl name='VertexAttrib4bvARB' type-id='type-id-542' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22080'>
        <var-decl name='VertexAttrib4dARB' type-id='type-id-543' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22144'>
        <var-decl name='VertexAttrib4dvARB' type-id='type-id-544' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22208'>
        <var-decl name='VertexAttrib4fARB' type-id='type-id-545' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22272'>
        <var-decl name='VertexAttrib4fvARB' type-id='type-id-546' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22336'>
        <var-decl name='VertexAttrib4ivARB' type-id='type-id-547' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22400'>
        <var-decl name='VertexAttrib4sARB' type-id='type-id-548' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22464'>
        <var-decl name='VertexAttrib4svARB' type-id='type-id-549' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22528'>
        <var-decl name='VertexAttrib4ubvARB' type-id='type-id-550' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22592'>
        <var-decl name='VertexAttrib4uivARB' type-id='type-id-551' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22656'>
        <var-decl name='VertexAttrib4usvARB' type-id='type-id-552' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22720'>
        <var-decl name='VertexAttribPointerARB' type-id='type-id-553' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22784'>
        <var-decl name='EnableVertexAttribArrayARB' type-id='type-id-554' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22848'>
        <var-decl name='DisableVertexAttribArrayARB' type-id='type-id-555' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22912'>
        <var-decl name='ProgramStringARB' type-id='type-id-556' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22976'>
        <var-decl name='BindProgramARB' type-id='type-id-557' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23040'>
        <var-decl name='DeleteProgramsARB' type-id='type-id-558' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23104'>
        <var-decl name='GenProgramsARB' type-id='type-id-559' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23168'>
        <var-decl name='ProgramEnvParameter4dARB' type-id='type-id-560' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23232'>
        <var-decl name='ProgramEnvParameter4dvARB' type-id='type-id-561' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23296'>
        <var-decl name='ProgramEnvParameter4fARB' type-id='type-id-562' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23360'>
        <var-decl name='ProgramEnvParameter4fvARB' type-id='type-id-563' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23424'>
        <var-decl name='ProgramLocalParameter4dARB' type-id='type-id-564' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23488'>
        <var-decl name='ProgramLocalParameter4dvARB' type-id='type-id-565' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23552'>
        <var-decl name='ProgramLocalParameter4fARB' type-id='type-id-566' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23616'>
        <var-decl name='ProgramLocalParameter4fvARB' type-id='type-id-567' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23680'>
        <var-decl name='GetProgramEnvParameterdvARB' type-id='type-id-568' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23744'>
        <var-decl name='GetProgramEnvParameterfvARB' type-id='type-id-569' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23808'>
        <var-decl name='GetProgramLocalParameterdvARB' type-id='type-id-570' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23872'>
        <var-decl name='GetProgramLocalParameterfvARB' type-id='type-id-571' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23936'>
        <var-decl name='GetProgramivARB' type-id='type-id-572' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24000'>
        <var-decl name='GetProgramStringARB' type-id='type-id-573' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24064'>
        <var-decl name='GetVertexAttribdvARB' type-id='type-id-574' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24128'>
        <var-decl name='GetVertexAttribfvARB' type-id='type-id-575' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24192'>
        <var-decl name='GetVertexAttribivARB' type-id='type-id-576' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24256'>
        <var-decl name='GetVertexAttribPointervARB' type-id='type-id-577' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24320'>
        <var-decl name='IsProgramARB' type-id='type-id-578' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24384'>
        <var-decl name='BindBufferARB' type-id='type-id-579' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24448'>
        <var-decl name='DeleteBuffersARB' type-id='type-id-580' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24512'>
        <var-decl name='GenBuffersARB' type-id='type-id-581' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='IsBufferARB' type-id='type-id-582' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24640'>
        <var-decl name='BufferDataARB' type-id='type-id-583' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24704'>
        <var-decl name='BufferSubDataARB' type-id='type-id-584' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24768'>
        <var-decl name='GetBufferSubDataARB' type-id='type-id-585' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24832'>
        <var-decl name='MapBufferARB' type-id='type-id-586' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24896'>
        <var-decl name='UnmapBufferARB' type-id='type-id-587' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24960'>
        <var-decl name='GetBufferParameterivARB' type-id='type-id-588' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25024'>
        <var-decl name='GetBufferPointervARB' type-id='type-id-589' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25088'>
        <var-decl name='GenQueriesARB' type-id='type-id-590' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25152'>
        <var-decl name='DeleteQueriesARB' type-id='type-id-591' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25216'>
        <var-decl name='IsQueryARB' type-id='type-id-592' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25280'>
        <var-decl name='BeginQueryARB' type-id='type-id-593' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25344'>
        <var-decl name='EndQueryARB' type-id='type-id-594' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25408'>
        <var-decl name='GetQueryivARB' type-id='type-id-595' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25472'>
        <var-decl name='GetQueryObjectivARB' type-id='type-id-596' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='GetQueryObjectuivARB' type-id='type-id-597' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='DeleteObjectARB' type-id='type-id-598' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25664'>
        <var-decl name='GetHandleARB' type-id='type-id-599' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25728'>
        <var-decl name='DetachObjectARB' type-id='type-id-600' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25792'>
        <var-decl name='CreateShaderObjectARB' type-id='type-id-601' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25856'>
        <var-decl name='ShaderSourceARB' type-id='type-id-602' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25920'>
        <var-decl name='CompileShaderARB' type-id='type-id-603' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25984'>
        <var-decl name='CreateProgramObjectARB' type-id='type-id-604' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26048'>
        <var-decl name='AttachObjectARB' type-id='type-id-605' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26112'>
        <var-decl name='LinkProgramARB' type-id='type-id-606' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26176'>
        <var-decl name='UseProgramObjectARB' type-id='type-id-607' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26240'>
        <var-decl name='ValidateProgramARB' type-id='type-id-608' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26304'>
        <var-decl name='Uniform1fARB' type-id='type-id-609' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26368'>
        <var-decl name='Uniform2fARB' type-id='type-id-610' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26432'>
        <var-decl name='Uniform3fARB' type-id='type-id-611' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26496'>
        <var-decl name='Uniform4fARB' type-id='type-id-612' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26560'>
        <var-decl name='Uniform1iARB' type-id='type-id-613' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26624'>
        <var-decl name='Uniform2iARB' type-id='type-id-614' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26688'>
        <var-decl name='Uniform3iARB' type-id='type-id-615' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26752'>
        <var-decl name='Uniform4iARB' type-id='type-id-616' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26816'>
        <var-decl name='Uniform1fvARB' type-id='type-id-617' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26880'>
        <var-decl name='Uniform2fvARB' type-id='type-id-618' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26944'>
        <var-decl name='Uniform3fvARB' type-id='type-id-619' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27008'>
        <var-decl name='Uniform4fvARB' type-id='type-id-620' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27072'>
        <var-decl name='Uniform1ivARB' type-id='type-id-621' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27136'>
        <var-decl name='Uniform2ivARB' type-id='type-id-622' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27200'>
        <var-decl name='Uniform3ivARB' type-id='type-id-623' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27264'>
        <var-decl name='Uniform4ivARB' type-id='type-id-624' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27328'>
        <var-decl name='UniformMatrix2fvARB' type-id='type-id-625' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27392'>
        <var-decl name='UniformMatrix3fvARB' type-id='type-id-626' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27456'>
        <var-decl name='UniformMatrix4fvARB' type-id='type-id-627' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27520'>
        <var-decl name='GetObjectParameterfvARB' type-id='type-id-628' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27584'>
        <var-decl name='GetObjectParameterivARB' type-id='type-id-629' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='GetInfoLogARB' type-id='type-id-630' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27712'>
        <var-decl name='GetAttachedObjectsARB' type-id='type-id-631' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27776'>
        <var-decl name='GetUniformLocationARB' type-id='type-id-632' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27840'>
        <var-decl name='GetActiveUniformARB' type-id='type-id-633' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27904'>
        <var-decl name='GetUniformfvARB' type-id='type-id-634' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27968'>
        <var-decl name='GetUniformivARB' type-id='type-id-635' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28032'>
        <var-decl name='GetShaderSourceARB' type-id='type-id-636' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28096'>
        <var-decl name='BindAttribLocationARB' type-id='type-id-637' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28160'>
        <var-decl name='GetActiveAttribARB' type-id='type-id-638' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28224'>
        <var-decl name='GetAttribLocationARB' type-id='type-id-639' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28288'>
        <var-decl name='DrawBuffersARB' type-id='type-id-640' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28352'>
        <var-decl name='ClampColorARB' type-id='type-id-641' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28416'>
        <var-decl name='DrawArraysInstancedARB' type-id='type-id-642' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28480'>
        <var-decl name='DrawElementsInstancedARB' type-id='type-id-643' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28544'>
        <var-decl name='IsRenderbuffer' type-id='type-id-644' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28608'>
        <var-decl name='BindRenderbuffer' type-id='type-id-645' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='734' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28672'>
        <var-decl name='DeleteRenderbuffers' type-id='type-id-646' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28736'>
        <var-decl name='GenRenderbuffers' type-id='type-id-647' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28800'>
        <var-decl name='RenderbufferStorage' type-id='type-id-648' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28864'>
        <var-decl name='GetRenderbufferParameteriv' type-id='type-id-649' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28928'>
        <var-decl name='IsFramebuffer' type-id='type-id-650' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28992'>
        <var-decl name='BindFramebuffer' type-id='type-id-651' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29056'>
        <var-decl name='DeleteFramebuffers' type-id='type-id-652' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29120'>
        <var-decl name='GenFramebuffers' type-id='type-id-653' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29184'>
        <var-decl name='CheckFramebufferStatus' type-id='type-id-654' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29248'>
        <var-decl name='FramebufferTexture1D' type-id='type-id-655' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29312'>
        <var-decl name='FramebufferTexture2D' type-id='type-id-656' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29376'>
        <var-decl name='FramebufferTexture3D' type-id='type-id-657' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29440'>
        <var-decl name='FramebufferRenderbuffer' type-id='type-id-658' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29504'>
        <var-decl name='GetFramebufferAttachmentParameteriv' type-id='type-id-659' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29568'>
        <var-decl name='GenerateMipmap' type-id='type-id-660' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29632'>
        <var-decl name='BlitFramebuffer' type-id='type-id-661' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29696'>
        <var-decl name='RenderbufferStorageMultisample' type-id='type-id-662' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29760'>
        <var-decl name='FramebufferTextureLayer' type-id='type-id-663' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29824'>
        <var-decl name='ProgramParameteriARB' type-id='type-id-664' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='756' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29888'>
        <var-decl name='FramebufferTextureARB' type-id='type-id-665' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29952'>
        <var-decl name='FramebufferTextureLayerARB' type-id='type-id-666' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30016'>
        <var-decl name='FramebufferTextureFaceARB' type-id='type-id-667' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30080'>
        <var-decl name='VertexAttribDivisor' type-id='type-id-668' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30144'>
        <var-decl name='MapBufferRange' type-id='type-id-669' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30208'>
        <var-decl name='FlushMappedBufferRange' type-id='type-id-670' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30272'>
        <var-decl name='TexBufferARB' type-id='type-id-671' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='772' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30336'>
        <var-decl name='BindVertexArray' type-id='type-id-672' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30400'>
        <var-decl name='DeleteVertexArrays' type-id='type-id-673' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30464'>
        <var-decl name='GenVertexArrays' type-id='type-id-674' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30528'>
        <var-decl name='IsVertexArray' type-id='type-id-675' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30592'>
        <var-decl name='GetUniformIndices' type-id='type-id-676' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30656'>
        <var-decl name='GetActiveUniformsiv' type-id='type-id-677' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='784' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30720'>
        <var-decl name='GetActiveUniformName' type-id='type-id-678' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30784'>
        <var-decl name='GetUniformBlockIndex' type-id='type-id-679' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30848'>
        <var-decl name='GetActiveUniformBlockiv' type-id='type-id-680' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30912'>
        <var-decl name='GetActiveUniformBlockName' type-id='type-id-681' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30976'>
        <var-decl name='UniformBlockBinding' type-id='type-id-682' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31040'>
        <var-decl name='CopyBufferSubData' type-id='type-id-683' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31104'>
        <var-decl name='DrawElementsBaseVertex' type-id='type-id-684' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31168'>
        <var-decl name='DrawRangeElementsBaseVertex' type-id='type-id-685' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31232'>
        <var-decl name='DrawElementsInstancedBaseVertex' type-id='type-id-686' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31296'>
        <var-decl name='MultiDrawElementsBaseVertex' type-id='type-id-687' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31360'>
        <var-decl name='ProvokingVertex' type-id='type-id-688' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31424'>
        <var-decl name='FenceSync' type-id='type-id-689' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31488'>
        <var-decl name='IsSync' type-id='type-id-690' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='810' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31552'>
        <var-decl name='DeleteSync' type-id='type-id-691' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31616'>
        <var-decl name='ClientWaitSync' type-id='type-id-692' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31680'>
        <var-decl name='WaitSync' type-id='type-id-693' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31744'>
        <var-decl name='GetInteger64v' type-id='type-id-694' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31808'>
        <var-decl name='GetSynciv' type-id='type-id-695' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31872'>
        <var-decl name='TexImage2DMultisample' type-id='type-id-696' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31936'>
        <var-decl name='TexImage3DMultisample' type-id='type-id-697' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32000'>
        <var-decl name='GetMultisamplefv' type-id='type-id-698' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32064'>
        <var-decl name='SampleMaski' type-id='type-id-699' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32128'>
        <var-decl name='BlendEquationi' type-id='type-id-700' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32192'>
        <var-decl name='BlendEquationSeparatei' type-id='type-id-701' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32256'>
        <var-decl name='BlendFunci' type-id='type-id-702' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32320'>
        <var-decl name='BlendFuncSeparatei' type-id='type-id-703' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='829' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32384'>
        <var-decl name='MinSampleShading' type-id='type-id-704' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32448'>
        <var-decl name='NamedStringARB' type-id='type-id-705' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32512'>
        <var-decl name='DeleteNamedStringARB' type-id='type-id-706' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32576'>
        <var-decl name='CompileShaderIncludeARB' type-id='type-id-707' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32640'>
        <var-decl name='IsNamedStringARB' type-id='type-id-708' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32704'>
        <var-decl name='GetNamedStringARB' type-id='type-id-709' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='GetNamedStringivARB' type-id='type-id-710' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='BindFragDataLocationIndexed' type-id='type-id-711' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='GetFragDataIndex' type-id='type-id-712' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='GenSamplers' type-id='type-id-713' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='DeleteSamplers' type-id='type-id-714' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='IsSampler' type-id='type-id-715' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='BindSampler' type-id='type-id-716' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33216'>
        <var-decl name='SamplerParameteri' type-id='type-id-717' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33280'>
        <var-decl name='SamplerParameteriv' type-id='type-id-718' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33344'>
        <var-decl name='SamplerParameterf' type-id='type-id-719' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33408'>
        <var-decl name='SamplerParameterfv' type-id='type-id-720' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33472'>
        <var-decl name='SamplerParameterIiv' type-id='type-id-721' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33536'>
        <var-decl name='SamplerParameterIuiv' type-id='type-id-722' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33600'>
        <var-decl name='GetSamplerParameteriv' type-id='type-id-723' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33664'>
        <var-decl name='GetSamplerParameterIiv' type-id='type-id-724' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33728'>
        <var-decl name='GetSamplerParameterfv' type-id='type-id-725' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33792'>
        <var-decl name='GetSamplerParameterIfv' type-id='type-id-726' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33856'>
        <var-decl name='QueryCounter' type-id='type-id-727' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='868' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33920'>
        <var-decl name='GetQueryObjecti64v' type-id='type-id-728' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33984'>
        <var-decl name='GetQueryObjectui64v' type-id='type-id-729' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34048'>
        <var-decl name='VertexP2ui' type-id='type-id-730' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='874' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34112'>
        <var-decl name='VertexP2uiv' type-id='type-id-731' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34176'>
        <var-decl name='VertexP3ui' type-id='type-id-732' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='876' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34240'>
        <var-decl name='VertexP3uiv' type-id='type-id-733' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='877' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34304'>
        <var-decl name='VertexP4ui' type-id='type-id-734' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='878' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34368'>
        <var-decl name='VertexP4uiv' type-id='type-id-735' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='879' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34432'>
        <var-decl name='TexCoordP1ui' type-id='type-id-736' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34496'>
        <var-decl name='TexCoordP1uiv' type-id='type-id-737' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='881' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34560'>
        <var-decl name='TexCoordP2ui' type-id='type-id-738' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34624'>
        <var-decl name='TexCoordP2uiv' type-id='type-id-739' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='883' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34688'>
        <var-decl name='TexCoordP3ui' type-id='type-id-740' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='884' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34752'>
        <var-decl name='TexCoordP3uiv' type-id='type-id-741' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34816'>
        <var-decl name='TexCoordP4ui' type-id='type-id-742' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34880'>
        <var-decl name='TexCoordP4uiv' type-id='type-id-743' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='887' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34944'>
        <var-decl name='MultiTexCoordP1ui' type-id='type-id-744' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35008'>
        <var-decl name='MultiTexCoordP1uiv' type-id='type-id-745' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35072'>
        <var-decl name='MultiTexCoordP2ui' type-id='type-id-746' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35136'>
        <var-decl name='MultiTexCoordP2uiv' type-id='type-id-747' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35200'>
        <var-decl name='MultiTexCoordP3ui' type-id='type-id-748' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='892' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35264'>
        <var-decl name='MultiTexCoordP3uiv' type-id='type-id-749' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='893' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35328'>
        <var-decl name='MultiTexCoordP4ui' type-id='type-id-750' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35392'>
        <var-decl name='MultiTexCoordP4uiv' type-id='type-id-751' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='895' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35456'>
        <var-decl name='NormalP3ui' type-id='type-id-752' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='896' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35520'>
        <var-decl name='NormalP3uiv' type-id='type-id-753' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='897' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35584'>
        <var-decl name='ColorP3ui' type-id='type-id-754' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='898' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35648'>
        <var-decl name='ColorP3uiv' type-id='type-id-755' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35712'>
        <var-decl name='ColorP4ui' type-id='type-id-756' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35776'>
        <var-decl name='ColorP4uiv' type-id='type-id-757' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='901' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35840'>
        <var-decl name='SecondaryColorP3ui' type-id='type-id-758' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='902' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35904'>
        <var-decl name='SecondaryColorP3uiv' type-id='type-id-759' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='903' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35968'>
        <var-decl name='VertexAttribP1ui' type-id='type-id-760' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='904' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36032'>
        <var-decl name='VertexAttribP1uiv' type-id='type-id-761' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='905' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36096'>
        <var-decl name='VertexAttribP2ui' type-id='type-id-762' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='906' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36160'>
        <var-decl name='VertexAttribP2uiv' type-id='type-id-763' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='907' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36224'>
        <var-decl name='VertexAttribP3ui' type-id='type-id-764' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='908' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36288'>
        <var-decl name='VertexAttribP3uiv' type-id='type-id-765' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='909' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36352'>
        <var-decl name='VertexAttribP4ui' type-id='type-id-766' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='910' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36416'>
        <var-decl name='VertexAttribP4uiv' type-id='type-id-767' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36480'>
        <var-decl name='DrawArraysIndirect' type-id='type-id-768' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='915' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36544'>
        <var-decl name='DrawElementsIndirect' type-id='type-id-769' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='916' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36608'>
        <var-decl name='Uniform1d' type-id='type-id-770' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='920' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36672'>
        <var-decl name='Uniform2d' type-id='type-id-771' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='921' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36736'>
        <var-decl name='Uniform3d' type-id='type-id-772' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='922' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36800'>
        <var-decl name='Uniform4d' type-id='type-id-773' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='923' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36864'>
        <var-decl name='Uniform1dv' type-id='type-id-774' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36928'>
        <var-decl name='Uniform2dv' type-id='type-id-775' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='925' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36992'>
        <var-decl name='Uniform3dv' type-id='type-id-776' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37056'>
        <var-decl name='Uniform4dv' type-id='type-id-777' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37120'>
        <var-decl name='UniformMatrix2dv' type-id='type-id-778' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37184'>
        <var-decl name='UniformMatrix3dv' type-id='type-id-779' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37248'>
        <var-decl name='UniformMatrix4dv' type-id='type-id-780' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37312'>
        <var-decl name='UniformMatrix2x3dv' type-id='type-id-781' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37376'>
        <var-decl name='UniformMatrix2x4dv' type-id='type-id-782' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37440'>
        <var-decl name='UniformMatrix3x2dv' type-id='type-id-783' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37504'>
        <var-decl name='UniformMatrix3x4dv' type-id='type-id-784' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37568'>
        <var-decl name='UniformMatrix4x2dv' type-id='type-id-785' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37632'>
        <var-decl name='UniformMatrix4x3dv' type-id='type-id-786' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37696'>
        <var-decl name='GetUniformdv' type-id='type-id-787' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37760'>
        <var-decl name='ProgramUniform1dEXT' type-id='type-id-788' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37824'>
        <var-decl name='ProgramUniform2dEXT' type-id='type-id-789' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37888'>
        <var-decl name='ProgramUniform3dEXT' type-id='type-id-790' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37952'>
        <var-decl name='ProgramUniform4dEXT' type-id='type-id-791' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38016'>
        <var-decl name='ProgramUniform1dvEXT' type-id='type-id-792' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38080'>
        <var-decl name='ProgramUniform2dvEXT' type-id='type-id-793' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38144'>
        <var-decl name='ProgramUniform3dvEXT' type-id='type-id-794' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38208'>
        <var-decl name='ProgramUniform4dvEXT' type-id='type-id-795' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38272'>
        <var-decl name='ProgramUniformMatrix2dvEXT' type-id='type-id-796' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38336'>
        <var-decl name='ProgramUniformMatrix3dvEXT' type-id='type-id-797' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38400'>
        <var-decl name='ProgramUniformMatrix4dvEXT' type-id='type-id-798' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38464'>
        <var-decl name='ProgramUniformMatrix2x3dvEXT' type-id='type-id-799' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38528'>
        <var-decl name='ProgramUniformMatrix2x4dvEXT' type-id='type-id-800' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38592'>
        <var-decl name='ProgramUniformMatrix3x2dvEXT' type-id='type-id-801' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38656'>
        <var-decl name='ProgramUniformMatrix3x4dvEXT' type-id='type-id-802' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38720'>
        <var-decl name='ProgramUniformMatrix4x2dvEXT' type-id='type-id-803' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='953' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38784'>
        <var-decl name='ProgramUniformMatrix4x3dvEXT' type-id='type-id-804' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='954' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38848'>
        <var-decl name='GetSubroutineUniformLocation' type-id='type-id-805' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38912'>
        <var-decl name='GetSubroutineIndex' type-id='type-id-806' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='959' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38976'>
        <var-decl name='GetActiveSubroutineUniformiv' type-id='type-id-807' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='960' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39040'>
        <var-decl name='GetActiveSubroutineUniformName' type-id='type-id-808' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39104'>
        <var-decl name='GetActiveSubroutineName' type-id='type-id-809' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='962' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39168'>
        <var-decl name='UniformSubroutinesuiv' type-id='type-id-810' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='963' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39232'>
        <var-decl name='GetUniformSubroutineuiv' type-id='type-id-811' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='964' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39296'>
        <var-decl name='GetProgramStageiv' type-id='type-id-812' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='965' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39360'>
        <var-decl name='PatchParameteri' type-id='type-id-813' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39424'>
        <var-decl name='PatchParameterfv' type-id='type-id-814' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='970' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39488'>
        <var-decl name='BindTransformFeedback' type-id='type-id-815' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39552'>
        <var-decl name='DeleteTransformFeedbacks' type-id='type-id-816' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39616'>
        <var-decl name='GenTransformFeedbacks' type-id='type-id-817' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='976' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39680'>
        <var-decl name='IsTransformFeedback' type-id='type-id-818' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39744'>
        <var-decl name='PauseTransformFeedback' type-id='type-id-819' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='978' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39808'>
        <var-decl name='ResumeTransformFeedback' type-id='type-id-820' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='979' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39872'>
        <var-decl name='DrawTransformFeedback' type-id='type-id-821' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39936'>
        <var-decl name='DrawTransformFeedbackStream' type-id='type-id-822' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40000'>
        <var-decl name='BeginQueryIndexed' type-id='type-id-823' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40064'>
        <var-decl name='EndQueryIndexed' type-id='type-id-824' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='986' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40128'>
        <var-decl name='GetQueryIndexediv' type-id='type-id-825' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='987' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40192'>
        <var-decl name='BlendColorEXT' type-id='type-id-826' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='995' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40256'>
        <var-decl name='PolygonOffsetEXT' type-id='type-id-827' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40320'>
        <var-decl name='TexImage3DEXT' type-id='type-id-828' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1003' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40384'>
        <var-decl name='TexSubImage3DEXT' type-id='type-id-829' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1004' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40448'>
        <var-decl name='GetTexFilterFuncSGIS' type-id='type-id-830' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40512'>
        <var-decl name='TexFilterFuncSGIS' type-id='type-id-831' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1009' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40576'>
        <var-decl name='TexSubImage1DEXT' type-id='type-id-832' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40640'>
        <var-decl name='TexSubImage2DEXT' type-id='type-id-833' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1014' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40704'>
        <var-decl name='CopyTexImage1DEXT' type-id='type-id-834' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1018' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40768'>
        <var-decl name='CopyTexImage2DEXT' type-id='type-id-835' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1019' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40832'>
        <var-decl name='CopyTexSubImage1DEXT' type-id='type-id-836' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1020' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40896'>
        <var-decl name='CopyTexSubImage2DEXT' type-id='type-id-837' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1021' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40960'>
        <var-decl name='CopyTexSubImage3DEXT' type-id='type-id-838' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1022' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41024'>
        <var-decl name='GetHistogramEXT' type-id='type-id-839' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1026' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41088'>
        <var-decl name='GetHistogramParameterfvEXT' type-id='type-id-840' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41152'>
        <var-decl name='GetHistogramParameterivEXT' type-id='type-id-841' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1028' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41216'>
        <var-decl name='GetMinmaxEXT' type-id='type-id-842' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1029' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41280'>
        <var-decl name='GetMinmaxParameterfvEXT' type-id='type-id-843' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1030' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41344'>
        <var-decl name='GetMinmaxParameterivEXT' type-id='type-id-844' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='HistogramEXT' type-id='type-id-845' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1032' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41472'>
        <var-decl name='MinmaxEXT' type-id='type-id-846' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41536'>
        <var-decl name='ResetHistogramEXT' type-id='type-id-847' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1034' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41600'>
        <var-decl name='ResetMinmaxEXT' type-id='type-id-848' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41664'>
        <var-decl name='ConvolutionFilter1DEXT' type-id='type-id-849' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1039' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41728'>
        <var-decl name='ConvolutionFilter2DEXT' type-id='type-id-850' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41792'>
        <var-decl name='ConvolutionParameterfEXT' type-id='type-id-851' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1041' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41856'>
        <var-decl name='ConvolutionParameterfvEXT' type-id='type-id-852' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1042' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41920'>
        <var-decl name='ConvolutionParameteriEXT' type-id='type-id-853' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41984'>
        <var-decl name='ConvolutionParameterivEXT' type-id='type-id-854' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1044' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42048'>
        <var-decl name='CopyConvolutionFilter1DEXT' type-id='type-id-855' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1045' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42112'>
        <var-decl name='CopyConvolutionFilter2DEXT' type-id='type-id-856' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42176'>
        <var-decl name='GetConvolutionFilterEXT' type-id='type-id-857' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42240'>
        <var-decl name='GetConvolutionParameterfvEXT' type-id='type-id-858' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1048' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42304'>
        <var-decl name='GetConvolutionParameterivEXT' type-id='type-id-859' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42368'>
        <var-decl name='GetSeparableFilterEXT' type-id='type-id-860' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42432'>
        <var-decl name='SeparableFilter2DEXT' type-id='type-id-861' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1051' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42496'>
        <var-decl name='ColorTableSGI' type-id='type-id-862' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42560'>
        <var-decl name='ColorTableParameterfvSGI' type-id='type-id-863' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42624'>
        <var-decl name='ColorTableParameterivSGI' type-id='type-id-864' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1057' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42688'>
        <var-decl name='CopyColorTableSGI' type-id='type-id-865' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1058' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42752'>
        <var-decl name='GetColorTableSGI' type-id='type-id-866' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42816'>
        <var-decl name='GetColorTableParameterfvSGI' type-id='type-id-867' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1060' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42880'>
        <var-decl name='GetColorTableParameterivSGI' type-id='type-id-868' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42944'>
        <var-decl name='PixelTexGenSGIX' type-id='type-id-869' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1065' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='43008'>
        <var-decl name='PixelTexGenParameteriSGIS' type-id='type-id-870' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='43072'>
        <var-decl name='PixelTexGenParameterivSGIS' type-id='type-id-871' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='43136'>
        <var-decl name='PixelTexGenParameterfSGIS' type-id='type-id-872' visibility='default' filepath='include/allegro5/opengl/GLext/gl_ext_api.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='43200'>
