<abi-corpus version='2.2' path='build/lib/liballegro_dialog.so' architecture='elf-amd-x86_64' soname='liballegro_dialog.so.5.2'>
  <elf-needed>
    <dependency name='libgtk-3.so.0'/>
    <dependency name='libgdk-3.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='liballegro.so.5.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_al_append_native_text_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_close_native_text_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_destroy_menu' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_destroy_menu_item_at' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_emit_menu_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_find_menu_item_unique' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_find_parent_menu_by_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='al_get_menu_item_caption' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_menu_item_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_menu_item_icon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_native_file_dialog_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_native_file_dialog_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_native_text_log_event_source' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_init_native_dialog_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_insert_menu_item' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_native_dialog_addon_initialized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_open_native_text_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_popup_menu' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_remove_display_menu' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_remove_menu_item' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_set_display_menu' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_set_menu_item_caption' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_set_menu_item_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_set_menu_item_icon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_show_native_file_dialog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_show_native_message_box' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_shutdown_native_dialog_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_toggle_menu_item_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='addons/native_dialog/dialog.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <enum-decl name='ALLEGRO_BITMAP_WRAP' filepath='include/allegro5/bitmap.h' line='17' column='1' id='type-id-3'>
      <underlying-type type-id='type-id-4'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_DEFAULT' value='0'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_REPEAT' value='1'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_CLAMP' value='2'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_MIRROR' value='3'/>
    </enum-decl>
    <enum-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' filepath='include/allegro5/mouse_cursor.h' line='12' column='1' id='type-id-5'>
      <underlying-type type-id='type-id-4'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_NONE' value='0'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_DEFAULT' value='1'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ARROW' value='2'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_BUSY' value='3'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_QUESTION' value='4'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_EDIT' value='5'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_MOVE' value='6'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_N' value='7'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_W' value='8'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_S' value='9'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_E' value='10'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NW' value='11'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SW' value='12'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SE' value='13'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NE' value='14'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PROGRESS' value='15'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PRECISION' value='16'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_LINK' value='17'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ALT_SELECT' value='18'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_UNAVAILABLE' value='19'/>
      <enumerator name='ALLEGRO_NUM_SYSTEM_MOUSE_CURSORS' value='20'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='type-id-6'/>
    <array-type-def dimensions='2' type-id='type-id-6' size-in-bits='512' id='type-id-7'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-8' id='type-id-9'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-8' id='type-id-9'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-10'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='1024' id='type-id-11'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-8' id='type-id-12'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='1152' id='type-id-13'>
      <subrange length='36' lower-bound='0' upper-bound='35' type-id='type-id-8' id='type-id-14'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-15'/>
    <class-decl name='ALLEGRO_BITMAP' size-in-bits='3456' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='28' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vt' type-id='type-id-17' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_format' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_flags' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_depth' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_samples' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_display' type-id='type-id-18' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_wrap_u' type-id='type-id-19' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_wrap_v' type-id='type-id-19' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_memory_format' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='w' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='h' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pitch' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cl' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cr_excl' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ct' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cb_excl' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='locked' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lock_x' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lock_y' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='lock_w' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lock_h' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lock_data' type-id='type-id-20' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lock_flags' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='locked_region' type-id='type-id-21' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='transform' type-id='type-id-22' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='inverse_transform' type-id='type-id-22' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='inverse_transform_dirty' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='proj_transform' type-id='type-id-22' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='use_bitmap_blender' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='blender' type-id='type-id-23' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='shader' type-id='type-id-24' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='parent' type-id='type-id-25' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='xofs' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='yofs' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='memory' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='extra' type-id='type-id-20' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dtor_item' type-id='type-id-27' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dirty' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BITMAP_INTERFACE' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='124' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='draw_bitmap_region' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='upload_bitmap' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='update_clipping_rectangle' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='destroy_bitmap' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_region' type-id='type-id-32' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unlock_region' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lock_compressed_region' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlock_compressed_region' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bitmap_pointer_changed' type-id='type-id-34' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backup_dirty_bitmap' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BLENDER' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='15' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blend_op' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='blend_source' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blend_dest' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blend_alpha_op' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blend_alpha_source' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='blend_alpha_dest' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='blend_color' type-id='type-id-36' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_COLOR' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/color.h' line='15' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r' type-id='type-id-6' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='g' type-id='type-id-6' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b' type-id='type-id-6' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='a' type-id='type-id-6' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY' size-in-bits='5056' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='133' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-39' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='vt' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='refresh_rate' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='flags' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='w' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='h' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='min_w' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='min_h' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_w' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='max_h' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='backbuffer_format' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='extra_settings' type-id='type-id-41' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ogl_extras' type-id='type-id-42' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='bitmaps' type-id='type-id-43' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='num_cache_vertices' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='cache_enabled' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='vertex_cache_size' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='vertex_cache' type-id='type-id-20' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='cache_texture' type-id='type-id-44' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='cur_blender' type-id='type-id-23' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='default_shader' type-id='type-id-24' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='projview_transform' type-id='type-id-22' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='render_state' type-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='display_invalidated_callbacks' type-id='type-id-43' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='display_validated_callbacks' type-id='type-id-43' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='use_constraints' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY_INTERFACE' size-in-bits='3776' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='17' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='create_display' type-id='type-id-47' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy_display' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_current_display' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unset_current_display' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear' type-id='type-id-50' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='draw_pixel' type-id='type-id-51' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flip_display' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='update_display_region' type-id='type-id-52' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='acknowledge_resize' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='resize_display' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='quick_size' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_orientation' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='create_bitmap' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_target_bitmap' type-id='type-id-56' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get_backbuffer' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_compatible_bitmap' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='switch_out' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='switch_in' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='draw_memory_bitmap_region' type-id='type-id-59' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='wait_for_vsync' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='set_mouse_cursor' type-id='type-id-60' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='set_system_mouse_cursor' type-id='type-id-61' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='show_mouse_cursor' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='hide_mouse_cursor' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='set_icons' type-id='type-id-62' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='set_window_position' type-id='type-id-63' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='get_window_position' type-id='type-id-64' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='get_window_borders' type-id='type-id-65' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='set_window_constraints' type-id='type-id-66' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='get_window_constraints' type-id='type-id-65' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='set_display_flag' type-id='type-id-67' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='set_window_title' type-id='type-id-68' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='flush_vertex_cache' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='prepare_vertex_cache' type-id='type-id-69' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='update_transformation' type-id='type-id-56' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='shutdown' type-id='type-id-70' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='acknowledge_drawing_halt' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='acknowledge_drawing_resume' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='set_display_option' type-id='type-id-63' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='clear_depth_buffer' type-id='type-id-71' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='update_render_state' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='get_clipboard_text' type-id='type-id-72' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='set_clipboard_text' type-id='type-id-73' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='has_clipboard_text' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='apply_window_constraints' type-id='type-id-74' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='draw_prim' type-id='type-id-75' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='draw_prim_indexed' type-id='type-id-76' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='create_vertex_buffer' type-id='type-id-77' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='destroy_vertex_buffer' type-id='type-id-78' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='lock_vertex_buffer' type-id='type-id-79' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='unlock_vertex_buffer' type-id='type-id-78' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='create_vertex_decl' type-id='type-id-80' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='create_index_buffer' type-id='type-id-81' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='destroy_index_buffer' type-id='type-id-82' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='lock_index_buffer' type-id='type-id-83' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='unlock_index_buffer' type-id='type-id-82' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='draw_vertex_buffer' type-id='type-id-84' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='draw_indexed_buffer' type-id='type-id-85' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EVENT_SOURCE' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='76' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pad' type-id='type-id-11' visibility='default' filepath='include/allegro5/events.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' size-in-bits='1408' is-struct='yes' naming-typedef-id='type-id-41' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='123' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='required' type-id='type-id-88' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suggested' type-id='type-id-88' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='settings' type-id='type-id-13' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='info' type-id='type-id-20' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='index' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='score' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='130' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_INDEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='40' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index_size' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-90' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_LOCKED_REGION' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='24' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-20' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='type-id-10' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pitch' type-id='type-id-10' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pixel_size' type-id='type-id-10' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TRANSFORM' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/allegro5/transformations.h' line='14' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-7' visibility='default' filepath='include/allegro5/transformations.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='35' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decl' type-id='type-id-94' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-90' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_DECL' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='13' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elements' type-id='type-id-96' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stride' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d3d_decl' type-id='type-id-20' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d3d_dummy_shader' type-id='type-id-20' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_ELEMENT' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='73' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attribute' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='storage' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ALLEGRO_RENDER_STATE' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='112' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_mask' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='depth_test' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depth_function' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alpha_test' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alpha_function' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='alpha_test_value' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_BUFFER_COMMON' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='20' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-44' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_only' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_locked' type-id='type-id-1' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='lock_flags' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locked_memory' type-id='type-id-20' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='local_buffer_length' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='lock_offset' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_length' type-id='type-id-10' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_VECTOR' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='9' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_itemsize' type-id='type-id-101' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_items' type-id='type-id-102' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_size' type-id='type-id-101' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_unused' type-id='type-id-101' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-16' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-103'/>
    <typedef-decl name='ALLEGRO_BITMAP_INTERFACE' type-id='type-id-28' filepath='include/allegro5/internal/aintern_bitmap.h' line='26' column='1' id='type-id-104'/>
    <typedef-decl name='ALLEGRO_BITMAP_WRAP' type-id='type-id-3' filepath='include/allegro5/bitmap.h' line='22' column='1' id='type-id-19'/>
    <typedef-decl name='ALLEGRO_BLENDER' type-id='type-id-35' filepath='include/allegro5/internal/aintern_bitmap.h' line='24' column='1' id='type-id-23'/>
    <typedef-decl name='ALLEGRO_COLOR' type-id='type-id-37' filepath='include/allegro5/color.h' line='13' column='1' id='type-id-36'/>
    <typedef-decl name='ALLEGRO_DISPLAY' type-id='type-id-38' filepath='include/allegro5/display.h' line='105' column='1' id='type-id-105'/>
    <typedef-decl name='ALLEGRO_DISPLAY_INTERFACE' type-id='type-id-46' filepath='include/allegro5/internal/aintern_display.h' line='15' column='1' id='type-id-106'/>
    <typedef-decl name='ALLEGRO_EVENT_SOURCE' type-id='type-id-86' filepath='include/allegro5/events.h' line='74' column='1' id='type-id-39'/>
    <typedef-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' type-id='type-id-87' filepath='include/allegro5/internal/aintern_display.h' line='131' column='1' id='type-id-41'/>
    <typedef-decl name='ALLEGRO_INDEX_BUFFER' type-id='type-id-89' filepath='include/allegro5/internal/aintern_primitives_types.h' line='99' column='1' id='type-id-107'/>
    <typedef-decl name='ALLEGRO_LOCKED_REGION' type-id='type-id-91' filepath='include/allegro5/bitmap_lock.h' line='23' column='1' id='type-id-21'/>
    <typedef-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' type-id='type-id-5' filepath='include/allegro5/mouse_cursor.h' line='35' column='1' id='type-id-108'/>
    <typedef-decl name='ALLEGRO_TRANSFORM' type-id='type-id-92' filepath='include/allegro5/transformations.h' line='12' column='1' id='type-id-22'/>
    <typedef-decl name='ALLEGRO_VERTEX_BUFFER' type-id='type-id-93' filepath='include/allegro5/internal/aintern_primitives_types.h' line='95' column='1' id='type-id-109'/>
    <typedef-decl name='ALLEGRO_VERTEX_DECL' type-id='type-id-95' filepath='include/allegro5/internal/aintern_primitives_types.h' line='81' column='1' id='type-id-110'/>
    <typedef-decl name='ALLEGRO_VERTEX_ELEMENT' type-id='type-id-97' filepath='include/allegro5/internal/aintern_primitives_types.h' line='71' column='1' id='type-id-111'/>
    <typedef-decl name='_ALLEGRO_RENDER_STATE' type-id='type-id-98' filepath='include/allegro5/internal/aintern_display.h' line='116' column='1' id='type-id-45'/>
    <typedef-decl name='_AL_BUFFER_COMMON' type-id='type-id-99' filepath='include/allegro5/internal/aintern_primitives.h' line='33' column='1' id='type-id-90'/>
    <typedef-decl name='_AL_VECTOR' type-id='type-id-100' filepath='include/allegro5/internal/aintern_vector.h' line='16' column='1' id='type-id-43'/>
    <typedef-decl name='__int64_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-112'/>
    <typedef-decl name='__uint32_t' type-id='type-id-113' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-114'/>
    <typedef-decl name='int64_t' type-id='type-id-112' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-88'/>
    <typedef-decl name='size_t' type-id='type-id-8' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-101'/>
    <typedef-decl name='uint32_t' type-id='type-id-114' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-115'/>
    <typedef-decl name='uintptr_t' type-id='type-id-8' filepath='/usr/include/stdint.h' line='79' column='1' id='type-id-44'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-4'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-116'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-113'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-72'/>
    <qualified-type-def type-id='type-id-110' const='yes' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-143'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-27'/>
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <class-decl name='ALLEGRO_FILECHOOSER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
    <class-decl name='ALLEGRO_MOUSE_CURSOR' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <class-decl name='ALLEGRO_OGL_EXTRAS' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-178'/>
    <class-decl name='ALLEGRO_SHADER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-185'/>
    <class-decl name='_AL_LIST_ITEM' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-186'/>
    <typedef-decl name='ALLEGRO_FILECHOOSER' type-id='type-id-183' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='38' column='1' id='type-id-174'/>
    <function-decl name='al_init_native_dialog_addon' mangled-name='al_init_native_dialog_addon' filepath='addons/native_dialog/dialog.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_init_native_dialog_addon'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='al_is_native_dialog_addon_initialized' mangled-name='al_is_native_dialog_addon_initialized' filepath='addons/native_dialog/dialog.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_native_dialog_addon_initialized'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='al_shutdown_native_dialog_addon' mangled-name='al_shutdown_native_dialog_addon' filepath='addons/native_dialog/dialog.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_shutdown_native_dialog_addon'>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='al_create_native_file_dialog' mangled-name='al_create_native_file_dialog' filepath='addons/native_dialog/dialog.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_native_file_dialog'>
      <parameter type-id='type-id-144' name='initial_path' filepath='addons/native_dialog/dialog.c' line='56' column='1'/>
      <parameter type-id='type-id-144' name='title' filepath='addons/native_dialog/dialog.c' line='57' column='1'/>
      <parameter type-id='type-id-144' name='patterns' filepath='addons/native_dialog/dialog.c' line='58' column='1'/>
      <parameter type-id='type-id-10' name='mode' filepath='addons/native_dialog/dialog.c' line='59' column='1'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='al_show_native_file_dialog' mangled-name='al_show_native_file_dialog' filepath='addons/native_dialog/dialog.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_show_native_file_dialog'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/dialog.c' line='80' column='1'/>
      <parameter type-id='type-id-175' name='dialog' filepath='addons/native_dialog/dialog.c' line='81' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='al_get_native_file_dialog_count' mangled-name='al_get_native_file_dialog_count' filepath='addons/native_dialog/dialog.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_native_file_dialog_count'>
      <parameter type-id='type-id-182' name='dialog' filepath='addons/native_dialog/dialog.c' line='89' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_native_file_dialog_path' mangled-name='al_get_native_file_dialog_path' filepath='addons/native_dialog/dialog.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_native_file_dialog_path'>
      <parameter type-id='type-id-182' name='dialog' filepath='addons/native_dialog/dialog.c' line='98' column='1'/>
      <parameter type-id='type-id-101' name='i' filepath='addons/native_dialog/dialog.c' line='98' column='1'/>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-decl name='al_destroy_native_file_dialog' mangled-name='al_destroy_native_file_dialog' filepath='addons/native_dialog/dialog.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_destroy_native_file_dialog'>
      <parameter type-id='type-id-175' name='dialog' filepath='addons/native_dialog/dialog.c' line='108' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='al_show_native_message_box' mangled-name='al_show_native_message_box' filepath='addons/native_dialog/dialog.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_show_native_message_box'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/dialog.c' line='131' column='1'/>
      <parameter type-id='type-id-144' name='title' filepath='addons/native_dialog/dialog.c' line='132' column='1'/>
      <parameter type-id='type-id-144' name='heading' filepath='addons/native_dialog/dialog.c' line='132' column='1'/>
      <parameter type-id='type-id-144' name='text' filepath='addons/native_dialog/dialog.c' line='132' column='1'/>
      <parameter type-id='type-id-144' name='buttons' filepath='addons/native_dialog/dialog.c' line='133' column='1'/>
      <parameter type-id='type-id-10' name='flags' filepath='addons/native_dialog/dialog.c' line='133' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='al_get_allegro_native_dialog_version' mangled-name='al_get_allegro_native_dialog_version' filepath='addons/native_dialog/dialog.c' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_allegro_native_dialog_version'>
      <return type-id='type-id-115'/>
    </function-decl>
    <typedef-decl name='_AL_LIST_ITEM' type-id='type-id-186' filepath='include/allegro5/internal/aintern_list.h' line='9' column='1' id='type-id-180'/>
    <typedef-decl name='ALLEGRO_MOUSE_CURSOR' type-id='type-id-184' filepath='include/allegro5/mouse_cursor.h' line='10' column='1' id='type-id-176'/>
    <typedef-decl name='ALLEGRO_SHADER' type-id='type-id-185' filepath='include/allegro5/shader.h' line='14' column='1' id='type-id-179'/>
    <type-decl name='void' id='type-id-187'/>
    <pointer-type-def type-id='type-id-187' id='type-id-20'/>
    <function-type size-in-bits='64' id='type-id-117'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-121'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-124'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-123'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-123'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-144'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-134'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-140'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-102'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-149'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-150'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-151'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-153'>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-154'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-155'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-156'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-157'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-159'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-161'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-144'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-163'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-169'>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-187'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-171'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-20'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/gtk_dialog.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <class-decl name='_GObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='252' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-189' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-190' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qdata' type-id='type-id-191' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='258' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeClass' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='451' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-193' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='454' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeInstance' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='461' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_class' type-id='type-id-195' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='464' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GtkWidget' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='133' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-197' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-198' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GInitiallyUnowned' type-id='type-id-188' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='194' column='1' id='type-id-197'/>
    <typedef-decl name='GType' type-id='type-id-199' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='427' column='1' id='type-id-193'/>
    <typedef-decl name='GTypeClass' type-id='type-id-192' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='434' column='1' id='type-id-200'/>
    <typedef-decl name='GTypeInstance' type-id='type-id-194' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='436' column='1' id='type-id-189'/>
    <typedef-decl name='GtkWidget' type-id='type-id-196' filepath='/usr/include/gtk-3.0/gtk/gtktypes.h' line='46' column='1' id='type-id-201'/>
    <typedef-decl name='gsize' type-id='type-id-8' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='83' column='1' id='type-id-199'/>
    <typedef-decl name='guint' type-id='type-id-113' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='61' column='1' id='type-id-190'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-198'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-205'/>
    <class-decl name='_GtkWidgetPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-206'/>
    <function-decl name='_al_init_native_dialog_addon' mangled-name='_al_init_native_dialog_addon' filepath='addons/native_dialog/gtk_dialog.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_native_dialog_addon'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_shutdown_native_dialog_addon' mangled-name='_al_shutdown_native_dialog_addon' filepath='addons/native_dialog/gtk_dialog.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_shutdown_native_dialog_addon'>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='_al_gtk_make_transient' mangled-name='_al_gtk_make_transient' filepath='addons/native_dialog/gtk_dialog.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_make_transient'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/gtk_dialog.c' line='55' column='1'/>
      <parameter type-id='type-id-202' name='window' filepath='addons/native_dialog/gtk_dialog.c' line='55' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <typedef-decl name='GData' type-id='type-id-205' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-203'/>
    <typedef-decl name='GtkWidgetPrivate' type-id='type-id-206' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='66' column='1' id='type-id-204'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/gtk_filesel.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <class-decl name='ALLEGRO_NATIVE_DIALOG' size-in-bits='2560' is-struct='yes' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='26' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='title' type-id='type-id-208' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-10' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fc_initial_path' type-id='type-id-209' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fc_path_count' type-id='type-id-101' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fc_paths' type-id='type-id-210' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fc_patterns' type-id='type-id-43' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fc_patterns_ustr' type-id='type-id-208' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mb_heading' type-id='type-id-208' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mb_text' type-id='type-id-208' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mb_buttons' type-id='type-id-208' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mb_pressed_button' type-id='type-id-10' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tl_thread' type-id='type-id-211' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tl_text_cond' type-id='type-id-212' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tl_text_mutex' type-id='type-id-213' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tl_pending_text' type-id='type-id-208' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tl_init_error' type-id='type-id-1' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1160'>
        <var-decl name='tl_done' type-id='type-id-1' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='tl_have_pending' type-id='type-id-1' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='tl_events' type-id='type-id-39' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tl_textview' type-id='type-id-20' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='is_active' type-id='type-id-1' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='window' type-id='type-id-20' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='async_queue' type-id='type-id-20' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='dtor_item' type-id='type-id-214' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_NATIVE_DIALOG' type-id='type-id-207' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='21' column='1' id='type-id-215'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-214'/>
    <class-decl name='ALLEGRO_COND' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-222'/>
    <class-decl name='ALLEGRO_MUTEX' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-223'/>
    <class-decl name='ALLEGRO_PATH' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-224'/>
    <class-decl name='ALLEGRO_THREAD' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-225'/>
    <class-decl name='_AL_LIST_ITEM' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-226'/>
    <function-decl name='_al_show_native_file_dialog' mangled-name='_al_show_native_file_dialog' filepath='addons/native_dialog/gtk_filesel.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_show_native_file_dialog'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/gtk_filesel.c' line='152' column='1'/>
      <parameter type-id='type-id-216' name='fd' filepath='addons/native_dialog/gtk_filesel.c' line='153' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='_AL_LIST_ITEM' type-id='type-id-226' filepath='include/allegro5/internal/aintern_list.h' line='9' column='1' id='type-id-221'/>
    <typedef-decl name='ALLEGRO_PATH' type-id='type-id-224' filepath='include/allegro5/path.h' line='20' column='1' id='type-id-219'/>
    <typedef-decl name='ALLEGRO_THREAD' type-id='type-id-225' filepath='include/allegro5/threads.h' line='27' column='1' id='type-id-220'/>
    <typedef-decl name='ALLEGRO_MUTEX' type-id='type-id-223' filepath='include/allegro5/threads.h' line='31' column='1' id='type-id-218'/>
    <typedef-decl name='ALLEGRO_COND' type-id='type-id-222' filepath='include/allegro5/threads.h' line='35' column='1' id='type-id-217'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/gtk_menu.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <function-decl name='_al_init_menu' mangled-name='_al_init_menu' filepath='addons/native_dialog/gtk_menu.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_menu'>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/gtk_menu.c' line='165' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_init_popup_menu' mangled-name='_al_init_popup_menu' filepath='addons/native_dialog/gtk_menu.c' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_init_popup_menu'>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/gtk_menu.c' line='175' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_destroy_menu' mangled-name='_al_destroy_menu' filepath='addons/native_dialog/gtk_menu.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_destroy_menu'>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/gtk_menu.c' line='192' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_insert_menu_item_at' mangled-name='_al_insert_menu_item_at' filepath='addons/native_dialog/gtk_menu.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_insert_menu_item_at'>
      <parameter type-id='type-id-228' name='item' filepath='addons/native_dialog/gtk_menu.c' line='223' column='1'/>
      <parameter type-id='type-id-10' name='i' filepath='addons/native_dialog/gtk_menu.c' line='223' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_destroy_menu_item_at' mangled-name='_al_destroy_menu_item_at' filepath='addons/native_dialog/gtk_menu.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_destroy_menu_item_at'>
      <parameter type-id='type-id-228' name='item' filepath='addons/native_dialog/gtk_menu.c' line='252' column='1'/>
      <parameter type-id='type-id-10' name='i' filepath='addons/native_dialog/gtk_menu.c' line='252' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_update_menu_item_at' mangled-name='_al_update_menu_item_at' filepath='addons/native_dialog/gtk_menu.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_update_menu_item_at'>
      <parameter type-id='type-id-228' name='item' filepath='addons/native_dialog/gtk_menu.c' line='287' column='1'/>
      <parameter type-id='type-id-10' name='i' filepath='addons/native_dialog/gtk_menu.c' line='287' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_show_display_menu' mangled-name='_al_show_display_menu' filepath='addons/native_dialog/gtk_menu.c' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_show_display_menu'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/gtk_menu.c' line='323' column='1'/>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/gtk_menu.c' line='323' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_hide_display_menu' mangled-name='_al_hide_display_menu' filepath='addons/native_dialog/gtk_menu.c' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_hide_display_menu'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/gtk_menu.c' line='355' column='1'/>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/gtk_menu.c' line='355' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_show_popup_menu' mangled-name='_al_show_popup_menu' filepath='addons/native_dialog/gtk_menu.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_show_popup_menu'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/gtk_menu.c' line='432' column='1'/>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/gtk_menu.c' line='432' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_get_menu_display_height' mangled-name='_al_get_menu_display_height' filepath='addons/native_dialog/gtk_menu.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_get_menu_display_height'>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/gtk_msgbox.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <function-decl name='_al_show_native_message_box' mangled-name='_al_show_native_message_box' filepath='addons/native_dialog/gtk_msgbox.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_show_native_message_box'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/gtk_msgbox.c' line='122' column='1'/>
      <parameter type-id='type-id-216' name='fd' filepath='addons/native_dialog/gtk_msgbox.c' line='123' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/gtk_textlog.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <function-decl name='_al_open_native_text_log' mangled-name='_al_open_native_text_log' filepath='addons/native_dialog/gtk_textlog.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_open_native_text_log'>
      <parameter type-id='type-id-216' name='textlog' filepath='addons/native_dialog/gtk_textlog.c' line='129' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_append_native_text_log' mangled-name='_al_append_native_text_log' filepath='addons/native_dialog/gtk_textlog.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_append_native_text_log'>
      <parameter type-id='type-id-216' name='textlog' filepath='addons/native_dialog/gtk_textlog.c' line='176' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='_al_close_native_text_log' mangled-name='_al_close_native_text_log' filepath='addons/native_dialog/gtk_textlog.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_close_native_text_log'>
      <parameter type-id='type-id-216' name='textlog' filepath='addons/native_dialog/gtk_textlog.c' line='205' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/gtk_thread.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <typedef-decl name='GSourceFunc' type-id='type-id-229' filepath='/usr/include/glib-2.0/glib/gmain.h' line='195' column='1' id='type-id-230'/>
    <typedef-decl name='gboolean' type-id='type-id-231' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='56' column='1' id='type-id-232'/>
    <typedef-decl name='gint' type-id='type-id-10' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='55' column='1' id='type-id-231'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-229'/>
    <function-decl name='_al_gtk_ensure_thread' mangled-name='_al_gtk_ensure_thread' filepath='addons/native_dialog/gtk_thread.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_ensure_thread'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_gtk_init_args' mangled-name='_al_gtk_init_args' filepath='addons/native_dialog/gtk_thread.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_init_args'>
      <parameter type-id='type-id-20' name='ptr' filepath='addons/native_dialog/gtk_thread.c' line='107' column='1'/>
      <parameter type-id='type-id-101' name='size' filepath='addons/native_dialog/gtk_thread.c' line='107' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_gtk_wait_for_args' mangled-name='_al_gtk_wait_for_args' filepath='addons/native_dialog/gtk_thread.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_wait_for_args'>
      <parameter type-id='type-id-230' name='func' filepath='addons/native_dialog/gtk_thread.c' line='127' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='addons/native_dialog/gtk_thread.c' line='127' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_gtk_lock_args' mangled-name='_al_gtk_lock_args' filepath='addons/native_dialog/gtk_thread.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_lock_args'>
      <parameter type-id='type-id-234' name='data' filepath='addons/native_dialog/gtk_thread.c' line='149' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_al_gtk_release_args' mangled-name='_al_gtk_release_args' filepath='addons/native_dialog/gtk_thread.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_release_args'>
      <parameter type-id='type-id-234' name='data' filepath='addons/native_dialog/gtk_thread.c' line='158' column='1'/>
      <return type-id='type-id-232'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-20' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-234'/>
    <function-type size-in-bits='64' id='type-id-233'>
      <parameter type-id='type-id-234' name='data'/>
      <return type-id='type-id-232'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/gtk_xgtk.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <function-decl name='_al_gtk_set_display_overridable_interface' mangled-name='_al_gtk_set_display_overridable_interface' filepath='addons/native_dialog/gtk_xgtk.c' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_set_display_overridable_interface'>
      <parameter type-id='type-id-1' name='on' filepath='addons/native_dialog/gtk_xgtk.c' line='547' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_al_gtk_get_window' mangled-name='_al_gtk_get_window' filepath='addons/native_dialog/gtk_xgtk.c' line='554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_gtk_get_window'>
      <parameter type-id='type-id-18' name='display' filepath='addons/native_dialog/gtk_xgtk.c' line='554' column='1'/>
      <return type-id='type-id-202'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='addons/native_dialog/menu.c' comp-dir-path='build/addons/native_dialog' language='LANG_C11'>
    <class-decl name='ALLEGRO_MENU' size-in-bits='1536' is-struct='yes' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='105' column='1' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-39' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='display' type-id='type-id-18' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='parent' type-id='type-id-228' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='items' type-id='type-id-43' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='is_event_source' type-id='type-id-1' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1416'>
        <var-decl name='is_popup_menu' type-id='type-id-1' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='extra1' type-id='type-id-20' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_MENU_INFO' size-in-bits='192' is-struct='yes' visibility='default' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='50' column='1' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='caption' type-id='type-id-144' visibility='default' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-237' visibility='default' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-10' visibility='default' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='icon' type-id='type-id-25' visibility='default' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_MENU_ITEM' size-in-bits='448' is-struct='yes' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='77' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-227' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='popup' type-id='type-id-227' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='caption' type-id='type-id-208' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='icon' type-id='type-id-25' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unique_id' type-id='type-id-237' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='id' type-id='type-id-237' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='flags' type-id='type-id-10' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='extra1' type-id='type-id-20' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='extra2' type-id='type-id-20' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_MENU_ID' size-in-bits='128' is-struct='yes' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='98' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='menu' type-id='type-id-227' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='unique_id' type-id='type-id-237' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='id' type-id='type-id-237' visibility='default' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_al_tagbstring' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/utf8.h' line='20' column='1' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mlen' type-id='type-id-10' visibility='default' filepath='include/allegro5/utf8.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slen' type-id='type-id-10' visibility='default' filepath='include/allegro5/utf8.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='include/allegro5/utf8.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_MENU' type-id='type-id-235' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='46' column='1' id='type-id-241'/>
    <typedef-decl name='ALLEGRO_MENU_INFO' type-id='type-id-236' filepath='addons/native_dialog/allegro5/allegro_native_dialog.h' line='55' column='1' id='type-id-242'/>
    <typedef-decl name='ALLEGRO_MENU_ITEM' type-id='type-id-238' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='75' column='1' id='type-id-243'/>
    <typedef-decl name='ALLEGRO_USTR' type-id='type-id-240' filepath='include/allegro5/utf8.h' line='12' column='1' id='type-id-244'/>
    <typedef-decl name='_AL_MENU_ID' type-id='type-id-239' filepath='addons/native_dialog/allegro5/internal/aintern_native_dialog.h' line='96' column='1' id='type-id-245'/>
    <typedef-decl name='__uint16_t' type-id='type-id-246' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-247'/>
    <typedef-decl name='uint16_t' type-id='type-id-247' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-237'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-246'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <function-decl name='_al_walk_over_menu' mangled-name='_al_walk_over_menu' filepath='addons/native_dialog/menu.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_walk_over_menu'>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/menu.c' line='91' column='1'/>
      <parameter type-id='type-id-252' name='proc' filepath='addons/native_dialog/menu.c' line='92' column='1'/>
      <parameter type-id='type-id-20' name='extra' filepath='addons/native_dialog/menu.c' line='92' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='al_create_menu' mangled-name='al_create_menu' filepath='addons/native_dialog/menu.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_menu'>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='al_create_popup_menu' mangled-name='al_create_popup_menu' filepath='addons/native_dialog/menu.c' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_create_popup_menu'>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='al_clone_menu' mangled-name='al_clone_menu' filepath='addons/native_dialog/menu.c' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_clone_menu'>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/menu.c' line='359' column='1'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='al_clone_menu_for_popup' mangled-name='al_clone_menu_for_popup' filepath='addons/native_dialog/menu.c' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_clone_menu_for_popup'>
      <parameter type-id='type-id-227' name='menu' filepath='addons/native_dialog/menu.c' line='366' column='1'/>
      <return type-id='type-id-227'/>
    </function-decl>
