<abi-corpus version='2.2' path='build/lib/liballegro_ttf.so' architecture='elf-amd-x86_64' soname='liballegro_ttf.so.5.2'>
  <elf-needed>
    <dependency name='liballegro_font.so.5.2'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='liballegro.so.5.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='al_get_allegro_ttf_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_init_ttf_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_ttf_addon_initialized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_load_ttf_font' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_load_ttf_font_f' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_load_ttf_font_stretch' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_load_ttf_font_stretch_f' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_shutdown_ttf_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='addons/ttf/ttf.c' comp-dir-path='build/addons/ttf' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <type-decl name='float' size-in-bits='32' id='type-id-3'/>
    <type-decl name='int' size-in-bits='32' id='type-id-4'/>
    <class-decl name='ALLEGRO_COLOR' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/color.h' line='15' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r' type-id='type-id-3' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='g' type-id='type-id-3' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b' type-id='type-id-3' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='a' type-id='type-id-3' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_FONT' size-in-bits='320' is-struct='yes' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='8' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='height' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fallback' type-id='type-id-8' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vtable' type-id='type-id-9' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dtor_item' type-id='type-id-10' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='14' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_FONT_VTABLE' size-in-bits='832' is-struct='yes' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='18' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='font_height' type-id='type-id-12' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='font_ascent' type-id='type-id-12' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='font_descent' type-id='type-id-12' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='char_length' type-id='type-id-13' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='text_length' type-id='type-id-14' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='render_char' type-id='type-id-15' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='render' type-id='type-id-16' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='destroy' type-id='type-id-17' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_text_dimensions' type-id='type-id-18' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_font_ranges' type-id='type-id-19' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_glyph_dimensions' type-id='type-id-20' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='get_glyph_advance' type-id='type-id-21' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_glyph' type-id='type-id-22' visibility='default' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_GLYPH' size-in-bits='320' is-struct='yes' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='55' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bitmap' type-id='type-id-24' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='y' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='w' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='h' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='kerning' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='offset_x' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='offset_y' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='advance' type-id='type-id-4' visibility='default' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_al_tagbstring' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/utf8.h' line='20' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mlen' type-id='type-id-4' visibility='default' filepath='include/allegro5/utf8.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slen' type-id='type-id-4' visibility='default' filepath='include/allegro5/utf8.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='include/allegro5/utf8.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_COLOR' type-id='type-id-5' filepath='include/allegro5/color.h' line='13' column='1' id='type-id-27'/>
    <typedef-decl name='ALLEGRO_FONT' type-id='type-id-6' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='48' column='1' id='type-id-28'/>
    <typedef-decl name='ALLEGRO_FONT_VTABLE' type-id='type-id-11' filepath='addons/ttf/../font/allegro5/internal/aintern_font.h' line='6' column='1' id='type-id-29'/>
    <typedef-decl name='ALLEGRO_GLYPH' type-id='type-id-23' filepath='addons/ttf/../font/allegro5/allegro_font.h' line='53' column='1' id='type-id-30'/>
    <typedef-decl name='ALLEGRO_USTR' type-id='type-id-25' filepath='include/allegro5/utf8.h' line='12' column='1' id='type-id-31'/>
    <typedef-decl name='__uint32_t' type-id='type-id-32' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-33'/>
    <typedef-decl name='uint32_t' type-id='type-id-33' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-34'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-35'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-32'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-22'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-40'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-43'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-10'/>
    <class-decl name='ALLEGRO_BITMAP' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-59'/>
    <class-decl name='ALLEGRO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-60'/>
    <class-decl name='_AL_LIST_ITEM' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <function-decl name='al_load_ttf_font_f' mangled-name='al_load_ttf_font_f' filepath='addons/ttf/ttf.c' line='857' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_ttf_font_f'>
      <parameter type-id='type-id-57' name='file' filepath='addons/ttf/ttf.c' line='857' column='1'/>
      <parameter type-id='type-id-44' name='filename' filepath='addons/ttf/ttf.c' line='858' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='addons/ttf/ttf.c' line='858' column='1'/>
      <parameter type-id='type-id-4' name='flags' filepath='addons/ttf/ttf.c' line='858' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_load_ttf_font_stretch_f' mangled-name='al_load_ttf_font_stretch_f' filepath='addons/ttf/ttf.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_ttf_font_stretch_f'>
      <parameter type-id='type-id-57' name='file' filepath='addons/ttf/ttf.c' line='866' column='1'/>
      <parameter type-id='type-id-44' name='filename' filepath='addons/ttf/ttf.c' line='867' column='1'/>
      <parameter type-id='type-id-4' name='w' filepath='addons/ttf/ttf.c' line='867' column='1'/>
      <parameter type-id='type-id-4' name='h' filepath='addons/ttf/ttf.c' line='867' column='1'/>
      <parameter type-id='type-id-4' name='flags' filepath='addons/ttf/ttf.c' line='867' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_load_ttf_font' mangled-name='al_load_ttf_font' filepath='addons/ttf/ttf.c' line='1006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_ttf_font'>
      <parameter type-id='type-id-44' name='filename' filepath='addons/ttf/ttf.c' line='1006' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='addons/ttf/ttf.c' line='1006' column='1'/>
      <parameter type-id='type-id-4' name='flags' filepath='addons/ttf/ttf.c' line='1006' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_load_ttf_font_stretch' mangled-name='al_load_ttf_font_stretch' filepath='addons/ttf/ttf.c' line='1014' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_load_ttf_font_stretch'>
      <parameter type-id='type-id-44' name='filename' filepath='addons/ttf/ttf.c' line='1014' column='1'/>
      <parameter type-id='type-id-4' name='w' filepath='addons/ttf/ttf.c' line='1014' column='1'/>
      <parameter type-id='type-id-4' name='h' filepath='addons/ttf/ttf.c' line='1014' column='1'/>
      <parameter type-id='type-id-4' name='flags' filepath='addons/ttf/ttf.c' line='1015' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='al_init_ttf_addon' mangled-name='al_init_ttf_addon' filepath='addons/ttf/ttf.c' line='1133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_init_ttf_addon'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='al_is_ttf_addon_initialized' mangled-name='al_is_ttf_addon_initialized' filepath='addons/ttf/ttf.c' line='1170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_is_ttf_addon_initialized'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='al_shutdown_ttf_addon' mangled-name='al_shutdown_ttf_addon' filepath='addons/ttf/ttf.c' line='1178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_shutdown_ttf_addon'>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='al_get_allegro_ttf_version' mangled-name='al_get_allegro_ttf_version' filepath='addons/ttf/ttf.c' line='1195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='al_get_allegro_ttf_version'>
      <return type-id='type-id-34'/>
    </function-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-59' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-55'/>
    <typedef-decl name='ALLEGRO_FILE' type-id='type-id-60' filepath='include/allegro5/file.h' line='15' column='1' id='type-id-56'/>
    <typedef-decl name='_AL_LIST_ITEM' type-id='type-id-61' filepath='include/allegro5/internal/aintern_list.h' line='9' column='1' id='type-id-58'/>
    <type-decl name='void' id='type-id-62'/>
    <pointer-type-def type-id='type-id-62' id='type-id-7'/>
    <function-type size-in-bits='64' id='type-id-37'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-38'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-45'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-46'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-50'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-51'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-47'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-48'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-49'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-53'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-62'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-54'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-62'/>
    </function-type>
  </abi-instr>
</abi-corpus>
