<abi-corpus version='2.2' path='build/lib/liballegro_video.so' architecture='elf-amd-x86_64' soname='liballegro_video.so.5.2'>
  <elf-needed>
    <dependency name='liballegro_audio.so.5.2'/>
    <dependency name='libtheoradec.so.1'/>
    <dependency name='libogg.so.0'/>
    <dependency name='libvorbis.so.0'/>
    <dependency name='liballegro.so.5.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_al_compute_scaled_dimensions' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_video_identify_ogv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_al_video_ogv_vtable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_close_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_allegro_video_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_audio_rate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_event_source' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_fps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_frame' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_position' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_scaled_height' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_get_video_scaled_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_identify_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_identify_video_f' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_init_video_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_video_addon_initialized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_is_video_playing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_open_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_open_video_f' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_seek_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_set_video_playing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_shutdown_video_addon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_start_video' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='al_start_video_with_voice' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='addons/video/ogv.c' comp-dir-path='build/addons/video' language='LANG_C11'>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
    <class-decl name='ALLEGRO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-3'/>
    <function-decl name='_al_video_ogv_vtable' mangled-name='_al_video_ogv_vtable' filepath='addons/video/ogv.c' line='1360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_video_ogv_vtable'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_al_video_identify_ogv' mangled-name='_al_video_identify_ogv' filepath='addons/video/ogv.c' line='1365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_al_video_identify_ogv'>
      <parameter type-id='type-id-2' name='f' filepath='addons/video/ogv.c' line='1365' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <typedef-decl name='ALLEGRO_FILE' type-id='type-id-3' filepath='include/allegro5/file.h' line='15' column='1' id='type-id-1'/>
  </abi-instr>
  <abi-instr address-size='64' path='addons/video/video.c' comp-dir-path='build/addons/video' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='type-id-5'/>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <type-decl name='double' size-in-bits='64' id='type-id-7'/>
    <enum-decl name='ALLEGRO_BITMAP_WRAP' filepath='include/allegro5/bitmap.h' line='17' column='1' id='type-id-8'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_DEFAULT' value='0'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_REPEAT' value='1'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_CLAMP' value='2'/>
      <enumerator name='ALLEGRO_BITMAP_WRAP_MIRROR' value='3'/>
    </enum-decl>
    <enum-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' filepath='include/allegro5/mouse_cursor.h' line='12' column='1' id='type-id-10'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_NONE' value='0'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_DEFAULT' value='1'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ARROW' value='2'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_BUSY' value='3'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_QUESTION' value='4'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_EDIT' value='5'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_MOVE' value='6'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_N' value='7'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_W' value='8'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_S' value='9'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_E' value='10'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NW' value='11'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SW' value='12'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_SE' value='13'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_RESIZE_NE' value='14'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PROGRESS' value='15'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_PRECISION' value='16'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_LINK' value='17'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_ALT_SELECT' value='18'/>
      <enumerator name='ALLEGRO_SYSTEM_MOUSE_CURSOR_UNAVAILABLE' value='19'/>
      <enumerator name='ALLEGRO_NUM_SYSTEM_MOUSE_CURSORS' value='20'/>
    </enum-decl>
    <enum-decl name='ALLEGRO_VIDEO_POSITION_TYPE' filepath='addons/video/allegro5/allegro_video.h' line='42' column='1' id='type-id-11'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ALLEGRO_VIDEO_POSITION_ACTUAL' value='0'/>
      <enumerator name='ALLEGRO_VIDEO_POSITION_VIDEO_DECODE' value='1'/>
      <enumerator name='ALLEGRO_VIDEO_POSITION_AUDIO_DECODE' value='2'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='type-id-12'/>
    <array-type-def dimensions='2' type-id='type-id-12' size-in-bits='512' id='type-id-13'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-14' id='type-id-15'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-14' id='type-id-15'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-16'/>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='1024' id='type-id-17'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-14' id='type-id-18'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='1152' id='type-id-19'>
      <subrange length='36' lower-bound='0' upper-bound='35' type-id='type-id-14' id='type-id-20'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <class-decl name='ALLEGRO_BITMAP' size-in-bits='3456' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='28' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vt' type-id='type-id-23' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_format' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_flags' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_depth' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_samples' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_display' type-id='type-id-24' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_wrap_u' type-id='type-id-25' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_wrap_v' type-id='type-id-25' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_memory_format' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='w' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='h' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pitch' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cl' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cr_excl' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ct' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='cb_excl' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='locked' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lock_x' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lock_y' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='lock_w' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lock_h' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lock_data' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lock_flags' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='locked_region' type-id='type-id-27' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='inverse_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='inverse_transform_dirty' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='proj_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='use_bitmap_blender' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='blender' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='shader' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='parent' type-id='type-id-31' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='xofs' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='yofs' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='memory' type-id='type-id-32' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='extra' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='dtor_item' type-id='type-id-33' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dirty' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BITMAP_INTERFACE' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='124' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='draw_bitmap_region' type-id='type-id-35' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='upload_bitmap' type-id='type-id-36' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='update_clipping_rectangle' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='destroy_bitmap' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_region' type-id='type-id-38' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unlock_region' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lock_compressed_region' type-id='type-id-39' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlock_compressed_region' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bitmap_pointer_changed' type-id='type-id-40' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backup_dirty_bitmap' type-id='type-id-37' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_BLENDER' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='15' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blend_op' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='blend_source' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blend_dest' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blend_alpha_op' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blend_alpha_source' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='blend_alpha_dest' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='blend_color' type-id='type-id-42' visibility='default' filepath='include/allegro5/internal/aintern_bitmap.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_COLOR' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/allegro5/color.h' line='15' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r' type-id='type-id-12' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='g' type-id='type-id-12' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b' type-id='type-id-12' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='a' type-id='type-id-12' visibility='default' filepath='include/allegro5/color.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY' size-in-bits='5056' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='133' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='es' type-id='type-id-45' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='vt' type-id='type-id-46' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='refresh_rate' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='flags' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='w' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='h' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='min_w' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='min_h' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_w' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='max_h' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='backbuffer_format' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='extra_settings' type-id='type-id-47' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ogl_extras' type-id='type-id-48' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='bitmaps' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='num_cache_vertices' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='cache_enabled' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='vertex_cache_size' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='vertex_cache' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='cache_texture' type-id='type-id-50' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='cur_blender' type-id='type-id-29' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='default_shader' type-id='type-id-30' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='projview_transform' type-id='type-id-28' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='render_state' type-id='type-id-51' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='display_invalidated_callbacks' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='display_validated_callbacks' type-id='type-id-49' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='use_constraints' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_DISPLAY_INTERFACE' size-in-bits='3776' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='17' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='create_display' type-id='type-id-53' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy_display' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_current_display' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unset_current_display' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear' type-id='type-id-56' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='draw_pixel' type-id='type-id-57' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flip_display' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='update_display_region' type-id='type-id-58' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='acknowledge_resize' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='resize_display' type-id='type-id-59' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='quick_size' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_orientation' type-id='type-id-60' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='create_bitmap' type-id='type-id-61' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_target_bitmap' type-id='type-id-62' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get_backbuffer' type-id='type-id-63' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_compatible_bitmap' type-id='type-id-64' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='switch_out' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='switch_in' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='draw_memory_bitmap_region' type-id='type-id-65' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='wait_for_vsync' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='set_mouse_cursor' type-id='type-id-66' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='set_system_mouse_cursor' type-id='type-id-67' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='show_mouse_cursor' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='hide_mouse_cursor' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='set_icons' type-id='type-id-68' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='set_window_position' type-id='type-id-69' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='get_window_position' type-id='type-id-70' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='get_window_borders' type-id='type-id-71' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='set_window_constraints' type-id='type-id-72' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='get_window_constraints' type-id='type-id-71' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='set_display_flag' type-id='type-id-73' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='set_window_title' type-id='type-id-74' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='flush_vertex_cache' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='prepare_vertex_cache' type-id='type-id-75' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='update_transformation' type-id='type-id-62' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='shutdown' type-id='type-id-76' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='acknowledge_drawing_halt' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='acknowledge_drawing_resume' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='set_display_option' type-id='type-id-69' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='clear_depth_buffer' type-id='type-id-77' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='update_render_state' type-id='type-id-54' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='get_clipboard_text' type-id='type-id-78' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='set_clipboard_text' type-id='type-id-79' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='has_clipboard_text' type-id='type-id-55' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='apply_window_constraints' type-id='type-id-80' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='draw_prim' type-id='type-id-81' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='draw_prim_indexed' type-id='type-id-82' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='create_vertex_buffer' type-id='type-id-83' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='destroy_vertex_buffer' type-id='type-id-84' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='lock_vertex_buffer' type-id='type-id-85' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='unlock_vertex_buffer' type-id='type-id-84' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='create_vertex_decl' type-id='type-id-86' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='create_index_buffer' type-id='type-id-87' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='destroy_index_buffer' type-id='type-id-88' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='lock_index_buffer' type-id='type-id-89' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='unlock_index_buffer' type-id='type-id-88' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='draw_vertex_buffer' type-id='type-id-90' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='draw_indexed_buffer' type-id='type-id-91' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EVENT_SOURCE' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/allegro5/events.h' line='76' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pad' type-id='type-id-17' visibility='default' filepath='include/allegro5/events.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' size-in-bits='1408' is-struct='yes' naming-typedef-id='type-id-47' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='123' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='required' type-id='type-id-94' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suggested' type-id='type-id-94' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='settings' type-id='type-id-19' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='info' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='index' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='score' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='130' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_INDEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='40' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index_size' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-96' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_LOCKED_REGION' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='24' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='type-id-16' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pitch' type-id='type-id-16' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pixel_size' type-id='type-id-16' visibility='default' filepath='include/allegro5/bitmap_lock.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_TRANSFORM' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/allegro5/transformations.h' line='14' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-13' visibility='default' filepath='include/allegro5/transformations.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_BUFFER' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='35' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decl' type-id='type-id-100' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='common' type-id='type-id-96' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_DECL' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='13' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elements' type-id='type-id-102' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stride' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d3d_decl' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d3d_dummy_shader' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VERTEX_ELEMENT' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='73' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attribute' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='storage' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives_types.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VIDEO' size-in-bits='2048' is-struct='yes' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='15' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-4' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_frame' type-id='type-id-31' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='video_position' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fps' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='scaled_width' type-id='type-id-12' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='scaled_height' type-id='type-id-12' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mixer' type-id='type-id-105' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='voice' type-id='type-id-106' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='audio' type-id='type-id-107' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='audio_position' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='audio_rate' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='es_inited' type-id='type-id-5' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='es' type-id='type-id-45' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='file' type-id='type-id-108' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='playing' type-id='type-id-5' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='position' type-id='type-id-7' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dtor_item' type-id='type-id-33' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='data' type-id='type-id-26' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ALLEGRO_VIDEO_INTERFACE' size-in-bits='384' is-struct='yes' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='6' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='open_video' type-id='type-id-110' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='7' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='close_video' type-id='type-id-110' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_video' type-id='type-id-110' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_video_playing' type-id='type-id-110' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='seek_video' type-id='type-id-111' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='update_video' type-id='type-id-110' visibility='default' filepath='addons/video/allegro5/internal/aintern_video.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ALLEGRO_RENDER_STATE' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='112' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_mask' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='depth_test' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depth_function' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alpha_test' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alpha_function' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='alpha_test_value' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_display.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_BUFFER_COMMON' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='20' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-50' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_only' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_locked' type-id='type-id-5' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='lock_flags' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locked_memory' type-id='type-id-26' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='local_buffer_length' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='lock_offset' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock_length' type-id='type-id-16' visibility='default' filepath='include/allegro5/internal/aintern_primitives.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_AL_VECTOR' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='9' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_itemsize' type-id='type-id-115' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_items' type-id='type-id-116' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_size' type-id='type-id-115' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_unused' type-id='type-id-115' visibility='default' filepath='include/allegro5/internal/aintern_vector.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ALLEGRO_BITMAP' type-id='type-id-22' filepath='include/allegro5/bitmap.h' line='12' column='1' id='type-id-117'/>
    <typedef-decl name='ALLEGRO_BITMAP_INTERFACE' type-id='type-id-34' filepath='include/allegro5/internal/aintern_bitmap.h' line='26' column='1' id='type-id-118'/>
    <typedef-decl name='ALLEGRO_BITMAP_WRAP' type-id='type-id-8' filepath='include/allegro5/bitmap.h' line='22' column='1' id='type-id-25'/>
    <typedef-decl name='ALLEGRO_BLENDER' type-id='type-id-41' filepath='include/allegro5/internal/aintern_bitmap.h' line='24' column='1' id='type-id-29'/>
    <typedef-decl name='ALLEGRO_COLOR' type-id='type-id-43' filepath='include/allegro5/color.h' line='13' column='1' id='type-id-42'/>
    <typedef-decl name='ALLEGRO_DISPLAY' type-id='type-id-44' filepath='include/allegro5/display.h' line='105' column='1' id='type-id-119'/>
    <typedef-decl name='ALLEGRO_DISPLAY_INTERFACE' type-id='type-id-52' filepath='include/allegro5/internal/aintern_display.h' line='15' column='1' id='type-id-120'/>
    <typedef-decl name='ALLEGRO_EVENT_SOURCE' type-id='type-id-92' filepath='include/allegro5/events.h' line='74' column='1' id='type-id-45'/>
    <typedef-decl name='ALLEGRO_EXTRA_DISPLAY_SETTINGS' type-id='type-id-93' filepath='include/allegro5/internal/aintern_display.h' line='131' column='1' id='type-id-47'/>
    <typedef-decl name='ALLEGRO_INDEX_BUFFER' type-id='type-id-95' filepath='include/allegro5/internal/aintern_primitives_types.h' line='99' column='1' id='type-id-121'/>
    <typedef-decl name='ALLEGRO_LOCKED_REGION' type-id='type-id-97' filepath='include/allegro5/bitmap_lock.h' line='23' column='1' id='type-id-27'/>
    <typedef-decl name='ALLEGRO_SYSTEM_MOUSE_CURSOR' type-id='type-id-10' filepath='include/allegro5/mouse_cursor.h' line='35' column='1' id='type-id-122'/>
    <typedef-decl name='ALLEGRO_TRANSFORM' type-id='type-id-98' filepath='include/allegro5/transformations.h' line='12' column='1' id='type-id-28'/>
    <typedef-decl name='ALLEGRO_VERTEX_BUFFER' type-id='type-id-99' filepath='include/allegro5/internal/aintern_primitives_types.h' line='95' column='1' id='type-id-123'/>
    <typedef-decl name='ALLEGRO_VERTEX_DECL' type-id='type-id-101' filepath='include/allegro5/internal/aintern_primitives_types.h' line='81' column='1' id='type-id-124'/>
    <typedef-decl name='ALLEGRO_VERTEX_ELEMENT' type-id='type-id-103' filepath='include/allegro5/internal/aintern_primitives_types.h' line='71' column='1' id='type-id-125'/>
    <typedef-decl name='ALLEGRO_VIDEO' type-id='type-id-104' filepath='addons/video/allegro5/allegro_video.h' line='53' column='1' id='type-id-126'/>
    <typedef-decl name='ALLEGRO_VIDEO_INTERFACE' type-id='type-id-109' filepath='addons/video/allegro5/internal/aintern_video.h' line='13' column='1' id='type-id-127'/>
    <typedef-decl name='ALLEGRO_VIDEO_POSITION_TYPE' type-id='type-id-11' filepath='addons/video/allegro5/allegro_video.h' line='51' column='1' id='type-id-128'/>
    <typedef-decl name='_ALLEGRO_RENDER_STATE' type-id='type-id-112' filepath='include/allegro5/internal/aintern_display.h' line='116' column='1' id='type-id-51'/>
    <typedef-decl name='_AL_BUFFER_COMMON' type-id='type-id-113' filepath='include/allegro5/internal/aintern_primitives.h' line='33' column='1' id='type-id-96'/>
    <typedef-decl name='_AL_VECTOR' type-id='type-id-114' filepath='include/allegro5/internal/aintern_vector.h' line='16' column='1' id='type-id-49'/>
    <typedef-decl name='__int64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-129'/>
    <typedef-decl name='__uint32_t' type-id='type-id-130' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-131'/>
